{
    "English":
    {
        "tooltips":
        {
            "Save"                      :   "Save",
            "Restore"                   :   "Restore",
            "Best solution"             :   "Best solution",
            "Customize"                 :   "Customize",
            "Import level"              :   "Import level",
            "Delete"                    :   "Delete",
            "Copy design\nto current"   :   "Copy design\nto current",
            "Delete level"              :   "Delete level",
            "Return"                    :   "Return",
            "Level Editor"              :   "Level Editor",
            "Level select"              :   "Level select",
            "Design"                    :   "Design",
            "Test"                      :   "Test",
            "Experiment"                :   "Experiment",
            "Scores"                    :   "Scores",
            "Help"                      :   "Help",
            "Repeat\ndialogue"          :   "Repeat\ndialogue",
            "Hint"                      :   "Hint",
            "New design"                :   "New design",
            "Valve"                     :   "Valve",
            "Steam Inlet"               :   "Steam Inlet",
            "Rotate left"               :   "Rotate left",
            "Rotate right"              :   "Rotate right",
            "Reflect\nvertically"       :   "Reflect\nvertically",
            "Reflect\nhorizontally"     :   "Reflect\nhorizontally",
            "Lock blocks"               :   "Lock blocks",
            "Add sign"                  :   "Add sign",
            "Stop tests"                :   "Stop tests",
            "Repeat 1 test"             :   "Repeat 1 test",
            "Run all tests"             :   "Run all tests",
            "Export to\nclipboard"      :   "Export to\nclipboard",
            "Import from\nclipboard"    :   "Import from\nclipboard",
            "Accuracy mode"             :   "Accuracy mode",
            "Price mode"                :   "Price mode",
            "Steam mode"                :   "Steam mode",
            "Confirm"                   :   "Confirm",
            "Cancel"                    :   "Cancel",
            "Exit"                      :   "Exit",
            "Full Screen"               :   "Full Screen",
            "Join our Discord group"    :   "Join our Discord group",
            "Info"                      :   "Info",
            "Select language"           :   "Select language",
            "If you are stuck, consider discussing your challenges with the brightest minds of our High Pressure Steam Society on Discord. Press Esc and click the \"Join our Discord group\" button." :
                                            "If you are stuck, consider discussing your challenges with the brightest minds of our High Pressure Steam Society on Discord. Press Esc and click the \"Join our Discord group\" button.",
            "Alas our journey must stop somewhere. The adventure continues\nin the full game.\n\nTo be continued..." :
                                            "Alas our journey must stop somewhere. The adventure continues\nin the full game.\n\nTo be continued...",
            "Cross"                     :   "Cross",
            "50"                        :   "50",
            "Normally Open"             :   "Normally Open",
            "Normally Closed"           :   "Normally Closed",
            "Switch"                    :   "Switch",
            "Buffer"                    :   "Buffer",
            "Inverter"                  :   "Inverter",
            "Comparator"                :   "Comparator",
            "Amp50"                     :   "Amp50",
            "Div2"                      :   "Div2",
            "Mul2"                      :   "Mul2",
            "Encrypt"                   :   "Encrypt",
            "Decrypt"                   :   "Decrypt",
            "Sensor"                    :   "Sensor",
            "Subtractor"                :   "Subtractor",
            "Adder"                     :   "Adder",
            "Latch"                     :   "Latch",
            "Tabulator"                 :   "Tabulator",
            "Broken Link"               :   "Broken Link",
            "Zoom"                      :   "Zoom",
            "Flow Detector"             :   "Flow Detector",
            "LatchE"                    :   "LatchE",
            "Latch2"                    :   "Latch2",
            "Latch5"                    :   "Latch5",
            "Latch10"                   :   "Latch10",
            "Min"                       :   "Min",
            "Max"                       :   "Max",
            "Fuse"                      :   "Fuse",
            "Counter"                   :   "Counter",
            "ROM"                       :   "ROM",
            "Poem"                      :   "Poem",
            "Clock"                     :   "Clock",
            "Cross v2"                  :   "Cross v2",
            "CounterE"                  :   "CounterE",
            "Delay"                     :   "Delay",
            "Self-timed latch"          :   "Self-timed latch",
            "Lock Picking"              :   "Lock Picking",
            "Code filter"               :   "Code filter",
            "Steamputer"                :   "Steamputer",
            "END"                       :   "END",

        },
        "help":
        [
            "In the level select menu, the bottom panel describes the design requirements. Each design has four ports and the requirements state the expected output in terms of other ports. Each port has a colour identifier. Click on the requirements to receive a hint.",
            "Once you pass all the tests, the next design becomes available. You can always come back to refine your solution.\n\nPress the pipe button below to continue the tutorial. You can return to the help by pressing F1.",
            "Pipes can be laid down by either left mouse button dragging the pipe from the source to the destination, or by clicking left mouse button to extend the pipe in the direction of the mouse. Right click to cancel pipe laying mode.",
            "Hold the right mouse button to delete pipes and other elements.",
            "The build menu allows you to add components into your design. Select the steam inlet component and hover over your design. The arrow buttons change the orientation. This can also be done using keys Q and E or the mouse scroll wheel. Clicking the left mouse button will place the component. Right click to exit steam inlet placing mode.",
            "Valves can be placed in the same way. Pressing Tab, or middle mouse button, is a shortcut to enter valve placement mode. Pressing Tab, or middle mouse button, again switches to steam inlet placement.",
            "A steam inlet will supply steam at pressure 100. Any pipes with open ends will vent the steam to the atmosphere at pressure 0.",
            "Pressure at different points is visible on pipe connections. Note how each pipe has a little resistance.",
            "Valves allow steam to pass through them if the (+) side of the valve is at a higher pressure than the (-) side. The higher it is, the more the valve is open. Steam on the (+) and (-) sides is not consumed.\n\nHere, the (-) side is vented to atmosphere and thus at 0 pressure. With (+) at 100 PSI and (-) at 0 PSI, the valve is 100% open. If (+) is at 75 and (-) is at 25, the valve will be 50% open.",
            "If the pressure on the (+) side is equal or lower than the (-) side, the valve becomes closed and no steam will pass through.",
            "By pressurising (+) side with a steam inlet, the valve will become open only if the pressure on the (-) side is lower than 100 PSI.\n\nAs before, the openness of the valve is the pressure on the (+) side minus the pressture on the (-) side.",
            "Applying high pressure to the (-) side will close the valve as the pressure on the (-) side becomes equal or higher than the (+) side.",
            "The test menu allows you to inspect how well your design is performing. The first three buttons pause the testing, repeatedly run a single test and run all tests respectively. You can also use hotkeys 1, 2 and 3.\n\nThe current scores for individual tests are shown with the scores of best design seen below. On the right is the final score formed from the worst of all tests.",
            "The next panel shows the sequence of inputs and expected outputs for the current test. The current phase is highlighted. The output recorded on the last run is shown to the right. You can press Space to fast forward to the next phase.\n\nThe score is based on how close the output is to the target value. The graph shows the output value during the final stage of the test. The faded line in the graph shows the path of the best design so far.",
            "The experiment menu allows you to manually set the ports and examine your design's operation. The vertical sliders set the desired value. The horizontal sliders below set force of the input. Setting the slider all the way left makes it an output. Initial values are set from the current test.",
            "The graph at the bottom shows the history of the port values.",
            "Components can be selected by either clicking while holding Ctrl, or dragging while holding Shift. Selected components can be moved using WASD keys, or rotated using Q and E, if the destination is empty. Keys to copy and paste are: C for copy, X for cut and V for paste. To delete selected components, press Delete.\n\nUndo is reached through Z key (Ctrl is optional) and Redo through either Y or Shift+Z. Undo can also be triggered by holding right mouse button and clicking the left one.",
            "Pressing Esc shows the game menu. The buttons allow you to exit the game, switch between windowed and full screen, join our Discord group and show credits.\n\nThe sliders adjust the sound effects and music volumes.",
            "Completed designs are available for use as components. Available components are shown in the build menu. Changing a design will update its implementation in all components.\n\nDouble-clicking on the component allows you to inspect it. You can pop back up the stack by clicking the design icon in the top left. Pressing the customize button, while inspecting, creates a local design which can be edited and is no longer updated when the original is changed. The design will turn red to signify this.",
            "There are four slots to save designs. The best design is also saved so it can be recalled later. Designs can be exchanged using a clipboard string.\n\nClicking the score shows the global score graph, and your score compared to your friends. Their designs are available to be examined.",
            "One method of creating a specific pressure is by simultaneously supplying and venting a pipe at a specific ratio. A valve is as open as the pressure on the (+) side minus the pressure on the (-) side.\n\nOpenness = P - N\n\nWhere P is the pressure on the Positive side of the valve and N is the pressure on the Negative side. Here the lower valve openness is 40 (60 - 20).",
            "The pressure generated in this arrangement is, in percent, the openness of the source valve divided by the sum of the openness of both valves.\n\nPressure = S / (S + V)\n\nWhere S is Supply valve openness and V is Venting valve openness.\nIn this case, Supply is 40 (40 - 0). Venting is also 40 (60 - 20). The expected value between is 40 / (40 + 40) = 50%, thus 50 PSI.",
            "Three scoring modes are available. The default (Accuracy) mode scores the proximity to the target value (for the worst test).\n\nPrice mode ranks designs by cost. Pipes cost £1 per port, valves cost £10 and steam inlets cost £5. There is an extra £4 charge for each subdesign.\n\nSteam mode measures the amount of steam supplied by the steam inlets.",
            "It is possible to create user defined levels. These have a user defined icon, tests and can be exchanged through the clipboard.\nTests and test steps can be added/removed using the +/- buttons. The time period per step is configurable. If, when playing all tests, some steps can be skipped, the skip all button selects the subtest to start on. The design can be optionally reset on all or only in play one test mode. The port icons select which ports are used. Clicking the ports on the left of the value selects the ports used as the output. The values are changed in the experiment menu.",
        ],
        "dialogue":
        [
            [
                {"who":"charles", "text":"Greetings Gertrude! My name is Charles Chavvington, the proprietor of these General High Pressure Steam Works. From here we supply High Pressure Steam across half the city, powering everything from steam umbrellas to steam xylophones.\n\nMy dearly departed wife, Ada, stipulated that her research into the mathematical properties of steam should continue beyond her time with us. Which leads us to the reason for you coming into my employ. Your undertaking shall be to preserve her legacy and continue these scientific inquiries."},
                {"who":"charles", "text":"I trust you have mastered elementary steam engineering in your prior studies, but before we allow you access to her laboratory, you must first demonstrate you are adept at basic steam pipe construction.\n\nConnect the West generator to the East facilities, and the North generator to the South facilities. Under no circumstance should you connect the pipes together! Doing so will deliver free steam to the South facilities, and they never pay their bills on time!"},
                {"who":"charles", "text":"If you are unfamiliar with our High Pressure Steam pipes, there is an engineering manual available up on the top right with the \"?\" symbol."}
            ],
            [
                {"who":"charles", "text":"Darn it! The secure door to Ada's laboratory is operated with low pressure steam! I could never figure out how she would get this blasted thing open.\n\nHere at General High Pressure Steam Works we generate steam at 100 Pounds per Square Inch. The door uses Moorhouse's low pressure steam which operates at 50 Pounds per Square Inch (PSI). I'll be damned if I pipe that degenerate Moorhouse steam onto my property!"},
                {"who":"charles", "text":"Unless you can magic up a supply of low pressure steam at 50 PSI, we might as well give up.\n\nIn the build menu, you will find a steam inlet which can supply you plenty of High Pressure Steam at 100 PSI. It is up there, marked with a spanner. You can also press Tab twice to get access to it."}
            ],
            [
                {"who":"charles", "text":"By Jove! You did it! Terrible waste of good steam, but it got the job done. I apologise for the untidy state, but some hoodlums have gained access and left a frightful mess.\n\nIn this laboratory, my dearest Ada conducted experiments on the valves I constructed to her exact specifications. By applying a good dose of High Pressure Steam to the port marked with a \"+\", we can open the valve, allowing steam to pass freely between the two unmarked ends."},
                {"who":"charles", "text":"Give it a try. Connect West and East, but only when North is at a High Pressure."}
            ],
            [
                {"who":"nicola", "text":"Impressive!"},
                {"who":"charles", "text":"Ah, Nicola, you are just in time. Gertrude, Nicola will be your assistant. He has already begun studying the notes Ada left. Now, the next bit is a little more challenging for the old grey matter.\n\nWhile applying steam to the \"+\" port opens the valve, applying steam to the \"-\" side closes it. The valve is only open when \"+\" is under a Higher Pressure than the \"-\" side."},
                {"who":"charles", "text":"Ada asked me to add this so she could make a valve that closes upon application of High Pressure to the control pipe. Let's see if these valves still operate correctly.\n\nConnect the East and West, but only when the pressure coming from the South is lower than 100 PSI.\n\nYou can use the steam inlet as a source of good High Pressure Steam."}
            ],
            [
                {"who":"charles", "text":"Excellent! Now, combining these two designs, we can construct a component that switches between two sources.\n\nWhen the West control house supplies 100 PSI High Pressure Steam, the North generator should be connected to the East facilities. But when the West control house is at 0 PSI atmospheric pressure, the South generator should be connected to the East facilities."},
                {"who":"nicola", "text":"What happens when the control house supplies a pressure between 0 and 100?"},
                {"who":"charles", "text":"What!?! That would be low pressure steam! We do not work with low pressure steam! I did not make my fortune by supplying people with low pressure steam!\n\nNever mind all that low pressure nonsense. When West control is High Pressure, connect the North generator, otherwise connect the South generator."}
            ],
            [
                {"who":"nicola", "text":"Lady Chavvington's notes talk about a steam connection between the laboratory and Lady Easley's residence that was used for communication."},
                {"who":"charles", "text":"Yes, I had it removed. New procedures. Too much of our High Pressure Steam was going missing. The only steam permitted to leave our facility is metered and provided to paying customers. None of my High Pressure Steam may leave these walls."},
                {"who":"nicola", "text":"I think we can still establish a connection without delivering any steam out. According to these notes..."},
                {"who":"charles", "text":"Hah! Impossible! This is elementary steamology, my dear boy! Steam communication relies on the transfer of steam, and thou shalt not \"Transfer\" any of my steam out!\n\nIn any case, I am needed elsewhere. This matter does not appear as urgent as the investigations into my missing steam."},
                {"who":"nicola", "text":"According to Lady Chavvington, Charles was not known as the greatest listener. She describes the design in some detail."},
                {"who":"ada", "text":"June 5th\nI created a fantastic pressure replicating device today. To create a pressure of a specific value, I used valves, supplying and venting steam, at a precise ratio. By opening the steam valve to 80%, and opening the atmospheric venting valve to 20%, I could recreate the original pressure of 80 PSI. Charles's valves appear to open to the pressure on the \"+\" side, minus the pressure on the \"-\" side."},
                {"who":"ada", "text":"This appears to work for a whole range of values with the minimal of error. Due to its isolating properties I shall name it a \"buffer\".\n\nCommunication through pressure, rather than the flow of steam, offers wondrous possibilities as the value is not distorted by the resistance of long pipes. I explained the idea to Charles, although he was more consumed with matters of company profit."},
                {"who":"nicola", "text":"It appears some parts of the original design still remain installed in the wall. As long as we use Lady Easley's steam to power the devices beyond the wall, Charles will have no complaint."}
            ],
            [
                {"who":"nicola", "text":"Not perfect, but we can always come back and improve it. Fascinating, is it not? The combination of valves reproduces any pressure value. The incoming pressure opens the steam inlet and the atmosphere venting valves to the exact levels to correctly reproduce the pressure in the output pipe.\n\nLet us send our first message and visit Lady Easley to see if it works."},
                {"who":"annie", "text":"[Some time later]\nYou gave me such a scare! For a minute I thought it was Ada talking to me from beyond the grave."},
                {"who":"nicola", "text":"Our apologies Lady Easley. We are attempting to continue Lady Chavvington's research. We were trying to send 80 PSI which according to our codebook means \"Hello\""},
                {"who":"annie", "text":"No! 80 PSI means, \"Help! I am trapped in the afterlife!\". It is 20 PSI that means \"Hello\".\n\nWhen Ada installed the system she made a mistake on the valves and all the pressures were received upside down. It was when investigating the issue she got her epiphany on the possibilities of steam. We never fixed it, and instead I inverted all the pressure values in my codebook."},
                {"who":"nicola", "text":"Interesting. Perhaps we should see if we can make the same mistake."}
            ],
            [
                {"who":"charles", "text":"Drat! For the life of me I cannot find the pressure comparator Ada made. Every year, the highly prestigious High Pressure Steam Society compares the pressures provided by all the High Pressure Steam Works to determine the supplier of the Highest Pressure Steam. Without an accurate comparator, we will have to cancel this year's competition.\n\nMy five year winning record will be ruined! I am sure she had another one around here somewhere..."},
                {"who":"nicola", "text":"We should try and make it, otherwise he will just keep interfering..."},
                {"who":"charles", "text":"What was that you say, boy?"},
                {"who":"nicola", "text":"I said we could make one, sir."},
                {"who":"charles", "text":"Splendid! Just remember, it is not enough to connect the output to High Pressure Steam when one input is greater than the other, one must also vent the output when the opposite is true. My pipes are fully sealed and never leak steam unless a valve is opened to permit them to vent."}
            ],
            [
                {"who":"charles", "text":"Excellent! Such precision! I am sure it could detect the pressure of a feather on a cricket pitch.\n\nI need but one more device before I shall leave you to your investigations. In order to be admitted to the High Pressure Steam Society, one must show their steam works produce High Pressure Steam."},
                {"who":"charles", "text":"Here at General High Pressure Steam Works, we produce High Pressure Steam at 100 PSI, the only pressure I would recognise as true High Pressure Steam. But technically any steam pressure above 50 PSI is considered High Pressure Steam. As the chair of the High Pressure Steam society, it is my responsibility to make sure inferior low pressure steam producing deviants are not permitted to join.\n\nI require a device to correctly determine the quality of the applicant's steam."},
                {"who":"nicola", "text":"We still have your design for the 50 PSI steam generator in the tool box. We can use the designs we already made as components."}
            ],
            [
                {"who":"charles", "text":"Bravo! With this contraption I will keep those low pressure steam producers out of our exclusive society."},
                {"who":"nicola", "text":"How many members are there so far?"},
                {"who":"charles", "text":"Well... One... As I said \"Very Exclusive\".\n\nIn any case, I must be off lest I miss the reception drinks!"},
                {"who":"nicola", "text":"Finally...\n\nAccording to Lady Chavvington's diary, a second communication pipeline was installed leading to the residence of none other than Lord Moorhouse! Charles would not have been happy if he had found it. Look."},
                {"who":"ada", "text":"June 17th\n\nWith the pipeline to Lord Moorhouse's estate complete, I am beginning work on a device to compact the high range of pressure values (0-100), to ones acceptable by the low pressure system (0-50). To my complete surprise, when powered by Lord Moorhouse's low pressure steam, but still using 100 PSI as the reference input, the pressure buffer was able to scale the input pressure to precisely one half."},
                {"who":"nicola", "text":"Really!?! How can that possibly work?"}
            ],
            [
                {"who":"nicola", "text":"Astonishing! Well, that got us half way there. We can send; but now we need to receive. We must amplify their steam pressure to our range. According to Lady Chavvington, we must power the device with our 100 PSI steam, but use 50 PSI as the reference pressure."}
            ],
            [
                {"who":"nicola", "text":"Let's see if this works.\n\n80 PSI [Hello]\n55 PSI [Request meeting]\n57 PSI [Afternoon tea at Madingley Hall]"},
                {"who":"george", "text":"...\n23 PSI [Negative]\n...\n6  PSI [6]\n12 PSI [/]\n7  PSI [7]"},
                {"who":"nicola", "text":"What?!? 6/7? Let me check the diary.\n...\nAll the entry for June 7th talks about is the design of the pressure inverter. How could he even communicate with us if the pressures were reversed? ... reversed ... reversed? ...  Of course!\n\nMy apologies. Too much time spent in the colonies. Here is the correct entry."},
                {"who":"ada", "text":"July 6th\n\nI suspect our communications have been compromised! After days of pleading, Lord Moorhouse agreed to combine our research efforts. We exchanged the codes to the doors of our respective laboratories over our steam communicator. Just hours later, a hand-delivered note was received at our residence informing me his laboratory has been ransacked and I was no longer welcome. I rushed to find mine had also been broken into! So much work lost."},
                {"who":"ada", "text":"I stored the code securely. Surely Charles would not have done such a thing. I immediately had the door on my laboratory replaced. Charles would rather die than operate a Moorhouse steam door."},
                {"who":"ada", "text":"I no longer feel safe here. I contacted my sister to expect my imminent arrival. It was a perfect time to test my new encryption system, which will keep our communications secure. I still have not received the sign Charles promised to put on the pipe that leads to her residence. He can be so forgetful at times."},
                {"who":"nicola", "text":"That was her last diary entry.\n\nOh dear! I didn't think that pipe was leading anywhere so I used the components for our other designs. Luckily some were welded down so I left them in place. The encryption unit seems mostly functional."}
            ],
            [
                {"who":"nicola", "text":"Well that was simple. The encryption is simply an unbalanced buffer. But how could you possibly make a design which accurately reverses such a cypher?\n\nPerhaps Lady Easley could help. I shall enquire if she is available to assist us.\n..."},
                {"who":"annie", "text":"Among Ada's papers, did you happen to find a napkin from the Madingley Hall tea rooms? I believe it was dated June 24th. We were discussing the new Royal Society paper on \"convergence in monotonic series\" when Ada began scribbling things down on a napkin. She then proceeded to run out exclaiming how she may have solved the decryption problem. Without settling the bill, I might add."},
                {"who":"ada", "text":"June 24th\nA decryption device can be formed by repeatedly guessing the value, encrypting it and comparing it to the encrypted input. Should the input be higher, we increase the guess. Should it be lower, we reduce it. Such a device could reverse numerous functions.\n\nCharles's steam comparator was just what I needed, although I must remember to return it to him before this year's high pressure steam society meeting."},
                {"who":"nicola", "text":"At least we know where his comparator got to."}
            ],
            [
                {"who":"nicola", "text":"Incredible! Using this technique we could improve the precision of all our designs. Lady Chavvington's sister must have more information about these techniques.\n\n80 PSI [Hello]"},
                {"who":"ada", "text":"80 PSI [Hello]\n93 PSI [This is Ada Chavvington]\n"},
                {"who":"nicola", "text":"60 PSI [Who?]\n73 PSI [Repeat]"},
                {"who":"ada", "text":"25 PSI [A], 28 PSI [D], 25 PSI [A]\n24 PSI [_]\n27 PSI [C], 32 PSI [H], 25 PSI [A], 46 PSI [V], 46 PSI [V], 33 PSI [I], 38 PSI [N], 31 PSI [G], 44 PSI [T], 39 PSI [O], 38 PSI [N]"},
                {"who":"nicola", "text":"This is unexpected. We must inform Lord Chavvington at once.\n...\nLord Chavvington! We established a link to Lady Chavvington's sister's residence, but the person at the other end claims to be Lady Chavvington herself!"},
                {"who":"charles", "text":"Ah, yes, that would be Ada."},
                {"who":"nicola", "text":"B... But Lord Chavvington, you said Ada had died."},
                {"who":"charles", "text":"What nonsense! Ada is perfectly fine and staying with her sister until we resolve this matter of the missing High Pressure Steam."},
                {"who":"nicola", "text":"You called her your \"dearly departed\"."},
                {"who":"charles", "text":"Yes... She has departed... To her sister's..."},
                {"who":"nicola", "text":"Everyone assumed she died..."},
                {"who":"charles", "text":"Hmm... Yes... On reflection, that would explain the flowers and cards expressing sympathy for my loss. I was touched by people's concern for the loss of my High Pressure Steam.\n\nNevertheless. The sooner you complete the steam calculation machine, the sooner we can get to the bottom of this. Continue the research post haste."},
                {"who":"ada", "text":"June 27th\nTogether with Lord Moorhouse such progress has been made in our research into steam computation. Our previous designs suffered from inaccuracies. Only when the valves were perfectly balanced and produced an output of 50, was the result perfect. With this I was struck with an idea.\n\nI could sense how open any valve is, by placing a second valve which vented the steam and adjusting its openness. Only when the two valves are equally open, will the pressure between them be precisely 50. All I had to do is to adjust the value until this was the case."},
                {"who":"ada", "text":"Using this, Lord Moorhouse was able to create a steam pressure adding component, which I hope he will reveal to me.\n\nLord Moorhouse is most shy yet smart as a whip, alas often he becomes too afraid to share his innovations."}
            ],
            [
                {"who":"nicola", "text":"Well it works. We can now sense how open a valve is, but I don't see how this gets us closer to steam computation. I suppose we must ask Lord Moorhouse."},
                {"who":"nicola", "text":"Lord Moorhouse. Thank you for allowing us to call upon you. In her absence, we are attempting to continue the steam computation work of Lady Chavvington. Only you know the construction of the pressure adding unit and we beg you share it with us."},
                {"who":"george", "text":"I do agree. Having thought on this, the advancement of knowledge must continue despite her collusion with Charles against me. I will disclose the secret of addition in exchange for the assurance that she is safe from him. Hearing the rumours that pass through these halls, I suspect her dead by his hand."},
                {"who":"nicola", "text":"Lady Chavvington is alive and well, staying with her sister."},
                {"who":"george", "text":"That is a relief. The idea of her spending any more time in that high pressure death trap keeps me up at night. If one of those high pressure tankers were to explode, perish the thought, the destruction would be immense. I would not rest until the world was rid of this high pressure horror...\n\nOh... Where was I? The addition design. Before you can make one, you must make one of subtraction. A valve is as open as the pressure on the (+) side minus the pressure on the (-) side. Once you create such a valve, you can then measure its openness."},
                {"who":"george", "text":"But now, you must leave. With Ada safe, I have an important task I must prepare for."}
            ],
            [
                {"who":"charles", "text":"I have brought the sign for the pipe that Ada asked for."},
                {"who":"nicola", "text":"That must have been months ago."},
                {"who":"charles", "text":"Yes, well, when a Chavvington says he will do something, it will get done. You don't have to remind him every month.\n\nCould you please send her a message from me?\n\n80, 94, 76, 52, 68, 70"},
                {"who":"nicola", "text":"I see you have learned the codes!"},
                {"who":"charles", "text":"Learned?!? I designed them! It was during my time in the military. A combination of the most frequent messages exchanged between captains.\n\nBe a good chap and send it off at once."},
                {"who":"nicola", "text":"80 PSI [Hello]\n94 PSI [This is Charles Chavvington]\n76 PSI [My sweetest angel]\n52 PSI [My heart yearns for you]\n68 PSI [I longingly await your return]\n70 PSI [Without you life has lost all meaning]"},
                {"who":"charles", "text":"Good, now, I see the subtractor design is complete. Excellent! As my dearly departed Ada once said..."},
                {"who":"nicola", "text":"Sir! You must stop using that phrase! People are beginning to think you a murderer..."},
                {"who":"charles", "text":"Hmm... Yes. As Ada..., who is no longer with us, once said, \"An adder is but an inversion of a subtractor. The output minus one of the inputs must be equal to the other input\". But which input?\n\nShe spent some time frustrated as the design would get stuck when that input was zero and switching the inputs just made the design stuck when the other input was zero. Her eureka moment came when she realised it needed to be a combination of both approaches."}
            ],
            [
                {"who":"annie", "text":"Why have you not been responding to my messages?"},
                {"who":"nicola", "text":"Our apologies Lady Easley, we did not know you had sent any."},
                {"who":"annie", "text":"They should be recorded on your message latches over here.\n...\n\nThey're missing! The latches must have been stolen by whoever broke into the laboratory. You should recreate them at once lest you miss any other important communications."},
                {"who":"annie", "text":"When a message is stable, a pulse of steam is sent on the timing pipe. This causes the latch to capture the value at that time. The latch will record the value, but will maintain the old value until the timing pipe has returned to a low pressure level.\n\nBecause these latches can be placed in sequence to record a series of messages, it is important that the new value is only released once the timing pipe has returned to low pressure."},
                {"who":"annie", "text":"I was always impressed about how well sealed Charles's valves are with a closed valve able to maintain the pressure within a pipe indefinitely.\n\nI do hope the design isn't lost, for I had such hopes for expanding it in a variety of ways."}
            ],
            [
                {"who":"charles", "text":"Great news everyone! Allow me to introduce Professor Joseph Cogsworth. One of, if not THE, brightest mind in all of the lands. His gear based tabulating machines have done wonders for our accounting department.\n\nHe has been aiding in our missing High Pressure Steam situation and has condescended to take an interest in Ada's work."},
                {"who":"joseph", "text":"Interesting to see how far you have come. I see you have reconstructed the latch to the same specification as Ada described in her notes."},
                {"who":"nicola", "text":"Those notes went missing during the break in. How did you know of them?"},
                {"who":"joseph", "text":"Ada was always a great admirer of my work. Although I thought her steam based approach to be crude and inaccurate, she would often seek my advice in hopes that it could be made adequate."},
                {"who":"charles", "text":"Once you complete the steam tabulator, we will be able to determine which of my accountants has been embezzling my High Pressure Steam.\n\nEach tabulator either adds, or subtracts a value from the current tally. The North connection selects between adding or subtracting and the South connection provides a timing pulse of High Pressure Steam.\n\nAda had to improve all her previous designs to increase the accuracy of all the used components. Work she never managed to complete."}
            ],
            [
                {"who":"charles", "text":"Very good, but alas too late, for Professor Cogsworth has already identified the guilty accountant."},
                {"who":"joseph", "text":"Indeed, but in return all I ask is to take possession of this crude attempt at a steam based tabulating device. Ada wished for me to be the custodian of all her research. Gertrude? Nicola? Your work here is done."},
                {"who":"ada", "text":"I hardly think so! Unlikely I would pass my work over to a man with both character and intellect of a parasitic wasp."},
                {"who":"joseph", "text":"Ada! I was under the impression you had died."},
                {"who":"ada", "text":"Charles! Apprehend this man, for he is the cause of all of this perturbation."},
                {"who":"charles", "text":"What!?! I hardly think a man of his stature would be involved in such petty crimes."},
                {"who":"george", "text":"It's true Charles. Joseph poisoned me against you with mistruths, manipulating us to detest one another. At first I collaborated with him due to his dislike of high pressure steam, but it was only later I realised his hatred of ALL steam!"},
                {"who":"charles", "text":"Is this true Joseph? You have no passion for High Pressure Steam?"},
                {"who":"joseph", "text":"Of course it is true! Ghastly substance. But to have me apprehended? For what? But you have no proof of any misdeeds."},
                {"who":"ada", "text":"Actually we do. Your gear tabulating machines have been removing tiny fractions from each transaction. It was only when we compared the results to the steam tabulator that we spotted these errors. All this so you could slowly syphon off high pressure steam. Were it not for Charles's sense of something being amiss, this would have never been spotted."},
                {"who":"joseph", "text":"Preposterous! What would I want with this revolting substance!"},
                {"who":"george", "text":"To slowly fill the pressure vessel you asked me to construct under the town hall."},
                {"who":"charles", "text":"What!?! But that's a low pressure vessel! Have you no idea of the consequences of filling it with High Pressure Steam!?!"},
                {"who":"joseph", "text":"The only consequences would be the world finally rejecting steam once and for all! It should be reserved for executions and only seen in museums. To think! Steam invading the offices and displacing my machines! For it is only gears that can produce a...\n\nWHAT!?! Let go of me! Unhand me, you wretched fools! You cannot do this to me! Wait until the Academy hears about this!"},
                {"who":"charles", "text":"The Academy certainly will hear about this!\n\nWell that's a satisfying conclusion to this matter. My High Pressure Steam is safe as is my dear Ada."},
                {"who":"ada", "text":"Actually darling, I think the story of steam computation is only just beginning."},
                {"who":"charles", "text":"Indeed. But, perhaps we should diffuse that steam bomb first."}
            ],
            [
                {"who":"ada", "text":"Thank you Gertrude. If not for your quick thinking, we would have had a disaster on our hands."},
                {"who":"george", "text":"I am also rather impressed. Ada, I cannot apologise enough for accusing you of ransacking my residence. Would it be possible for Gertrude and Nicola to aid me in my designs? I think their input will be highly constructive."},
                {"who":"ada", "text":"Speak no more of this, for I must be forgiven also. As a gesture of good will, feel free to use my... our laboratory. Lady Easley already has access. I do believe Charles and I need a bit of a break from all this commotion. We shall return in a few days and I already look forward to inspecting your discoveries."},
                {"who":"george", "text":"Thank you, and safe journey.\n\nNicola, could you find me that x2 pressure amplifier."},
                {"who":"nicola", "text":"It's right here.\n\nThe construction is simple, yet I find the operation stunningly useful."},
                {"who":"george", "text":"Indeed. Although this device amplifies values from a specific range of 0 to 50 to the range of 0 to 100. Given a minimum and maximum value, I do believe we can construct an amplifier which will zoom into any given range."},
                {"who":"nicola", "text":"We shall name it the Zoom element."},
                {"who":"george", "text":"Quite, although we should invent it first. The North can be our maximum and the South our minimum. The East output will tell us where the West input lies within the range."}
            ],
            [
                {"who":"george", "text":"Good, now we can zoom into any pressure range we choose. What I need next is a way of detecting if we are within a range. Take a look at this \"steam speedometer\".\n\nAda made it for Charles to measure the amount of steam passing through it. When steam passes through a long pipe, it will lose some pressure. The faster the steam is passing through, the more pressure it loses. If the two sides are at same pressure, there must be no moving steam. She even put some valves in the pipe to increase the resistance and make the difference greater."},
                {"who":"george", "text":"What I need is a way of telling if the West input reference is between the two pressures. It must be lower than the North, but higher than the South."}
            ],
            [
                {"who":"george", "text":"Now, by zooming into a range, I can tell more precisely how much steam someone is using, but I can also tell if I am within the range I am inspecting. I shall tell my customers to prepare for an extra decimal place on their next steam bills!"},
                {"who":"annie", "text":"Has all this research been to solely to aid your company profits? This is not what our agreement was."},
                {"who":"george", "text":"But Lady Easley! I made these for you. Believe me, these will be very useful components in the future."},
                {"who":"annie", "text":"I highly doubt that. I think it is time for some pure research.\n\nLet's go back to the Latch design Ada and I were working on. I wanted a latch which can be enabled or disabled. If the North input is high, the latch operates as normal, but if it is low, it should neither drive the output, nor accept a new input upon seeing a timing pulse. We can use the old design, although it may be more efficient to make a custom one."}
            ],
            [
                {"who":"annie", "text":"Now, the reason I wanted that design was to be able to construct an \"addressable latch\" where the North input selects between one of several latches. This way I could store several values and access each at will.\n\nLet's start with two. The North input selects between two latches. North value 0 to 50 will select one, and North value 50 to 100 will select the second."}
            ],
            [
                {"who":"annie", "text":"Exactly, unfortunately this is as far as we got. Next I wanted a latch that could store five values, but Ada and I could never fit it all into a single design. The select ranges would be 0-20, 20-40, 40-60, 60-80 and 80-100. Unfortunately detecting which of the ranges the select signal was in was too difficult."},
                {"who":"george", "text":"If only one had a range detecting design."},
                {"who":"annie", "text":"Your design detects flow, not a pressure range."},
                {"who":"george", "text":"Well, yes and no. It detects a pressure range of flowing steam. If placed in chain, and steam is passed through, they will detect a range of pressures."}
            ],
            [
                {"who":"annie", "text":"I admit, that flow detector was quite ingenious and was just the trick we needed. But now, how would we go about strapping two of these Latch5 block to make a Latch10?\n\nThe select ranges would be 0-10, 10-20, 20-30..."},
                {"who":"george", "text":"And this is why I asked for the zoom element to be designed. I have seen the genius in your ideas and have already planned ahead."}
            ],
            [
                {"who":"ada", "text":"Well, I am impressed. We had only been gone a couple days and you have created the storage part of the Steamputer."},
                {"who":"nicola", "text":"The what?"},
                {"who":"annie", "text":"All will be revealed in good time.\n\nWell, I think my job here is done! I managed to design the storage. I will leave you to investigate the calculations and control?"},
                {"who":"ada", "text":"Well let's start small. We need a component which gives us the smaller of the two input values. Should be simple enough."}
            ],
            [
                {"who":"charles", "text":"Ada! My darling! Try this exciting new beverage George introduced me to! It is called \"Froffee Coffee\". Taste it!"},
                {"who":"ada", "text":"Hmmm, yes it is rather ni..."},
                {"who":"charles", "text":"You know what would make it even better!?!"},
                {"who":"ada", "text":"High press..."},
                {"who":"charles", "text":"High Pressure Steam!"},
                {"who":"ada", "text":"Darling. I very much appreciate you have made amends with George, but were you two not supposed to be planning the programme elements?"},
                {"who":"charles", "text":"Already done! George is finalising the poem... or should I say requirements."},
                {"who":"ada", "text":"Oh! Well we must quickly create the Max component and then you can have access to our engineers.\n\nThe output this time must be the maximum of the two inputs."}
            ],
            [
                {"who":"charles", "text":"If we have some time before George comes, we should spend it making his pressure vessels safer. They are safe up to 90 PSI, but beyond that they are liable to explode. What I require is a \"steam fuse\". Allow the flow of steam from West to East, but once the pressure reaches beyond 90PSI, disconnect the supply and vent the vessel. Remember to disconnect the supply first, and only then vent the tank."}
            ],
            [
                {"who":"charles", "text":"Come George! I think we have some privacy!"},
                {"who":"george", "text":"Are you sure about this Charles? Lady Easley barely acknowledges my existence."},
                {"who":"charles", "text":"Stiff upper lip old chap!"},
                {"who":"george", "text":"Very well. This is somewhat of a sensitive matter. I require a device which increases by 10 PSI each cycle. It should start at 0 PSI and at each timing pulse should increase by 10 PSI. Instead of reaching 100 PSI, it should reset back to 0 PSI.\n\nPlease, do be discreet about its construction."}
            ],
            [
                {"who":"george", "text":"Charles, I cannot thank you enough for letting me use your poems. This one perfectly articulates my feelings for Lady Easley. It describes her beauty, her kindness and her ingenious latch designs. All I needed to do is replace the object of affection from your \"High Pressure Steam\" to my \"Lady Easley\"."},
                {"who":"george", "text":"Take a look at Easley's Latch10 design. We require something simpler, yet more complex. For each input value range, I need a specific pressure to be output. There is no need to ever update the values held.\n\nNow might be a good time to examine how to make custom components. You can use any old design as a basis and change the implementation for that instance."}
            ],
            [
                {"who":"george", "text":"We are nearly there. Let's connect these parts together so it will replay my poem. At every steam pulse, the next value should be read out. This won't be trivial as our counter goes through a sequence 0, 10, 20, 30... while our poem storage wants a sequence 5, 15, 25, 35..."}
            ],
            [
                {"who":"charles", "text":"Excellent stuff! It is just a shame we have to rely on these horrid Cogsworth clocks to provide the timing pulses."},
                {"who":"nicola", "text":"Gertrude, do you remember how you diffused that bomb? I think we can make a clock just as precise."},
                {"who":"charles", "text":"However you do it, I want it flip once every tick and I don't want it changing time depending on what it is connected to."}
            ],
            [
                {"who":"ada", "text":"What have you two been up to?"},
                {"who":"charles", "text":"George and I have just delivered a most marvellous poetry reciting machine to Lady Easley. It has been programmed to recite George's feelings towards her.\n\nWith sufficient refinement one could reduce such a device to the size of a horse."},
                {"who":"ada", "text":"That sounds lovely. Although I do hope you reversed the pressures as Annie's codes are all negated."},
                {"who":"george", "text":"WHAT!?! Nicola! What did I just send her?"},
                {"who":"nicola", "text":"Hmm... It appears you complemented her on her magnificent beard ... requested her lewd etchings ... and instructed her to attack the enemy at dawn."},
                {"who":"george", "text":"...\nOn that note, I shall return to my residence to spend some time with a bottle of brandy."},
                {"who":"ada", "text":"Charles! Go and help him!\n\nWhile they are gone, perhaps you two can help. Charles was supposed to install two pipes into this wall, but it only has one. I need North connected to South, and West to East. Is there any way we can do this without waiting for a new pipe to be installed?"},
                {"who":"nicola", "text":"Good thing we live in a clockwork universe because I think I have an idea."}
            ],
            [
                {"who":"annie", "text":"Hello Ada. Is George here? I have come to speak with him about this machine that has been delivered to my residence."},
                {"who":"ada", "text":"Oh Annie! I am so sorry. He and Charles were completely ignorant of the codebook differences."},
                {"who":"annie", "text":"Oh, I figured that out immediately. It would have made it such a silly farce otherwise."},
                {"who":"ada", "text":"Nicola! Go and fetch George and Charles, wherever they got to."},
                {"who":"annie", "text":"This poetry device they made is quite a marvellous contraption. The components used are ingenious. Gertrude? This counter. I assume you had a hand in its construction. Could you adapt the design to include a way of setting the value? The new value would come on the West port, and the North port will select whether to use the new value."}
            ],
            [
                {"who":"ada", "text":"I have to say Annie, do you not find all this rather complicated?"},
                {"who":"annie", "text":"I do, but look how far we have come. Remember the week you spent trying to get the adder to work? Looking back, it all looks so simple now. Not only has our research progressed, but I think we have such a better understanding of steam."},
                {"who":"ada", "text":"Then perhaps you could aid me in looking at one of your message latches. I can't figure out what's wrong. All the messages from Lady Bechdel come out as nonsense."},
                {"who":"annie", "text":"Interesting. It appears that the timing pulse arrives little too early, before the value has become stable. If I could delay the pulse by a little less than a tick, then that would fix it. It would need to have a very quick shift between 0 and 100 PSI. Let us make something."}
            ],
            [
                {"who":"annie", "text":"What does this gauge show?"},
                {"who":"ada", "text":"That would be the steam pressure going to the Cogsworth Clockworks. Why?"},
                {"who":"annie", "text":"Look. It is such a peculiar pattern. Also, are they not closed? It is a Sunday after all.\n\nIt jumps up to 100 PSI for one tick, then another value for another tick, before returning to 0 PSI."},
                {"who":"ada", "text":"That is intriguing. I wonder if we could decode it."}
            ],
            [
                {"who":"nicola", "text":"Lady Chavvington! I have searched all across the city and I have failed to locate..."},
                {"who":"ada", "text":"We know where they are! George managed to get a message through to us by turning an inlet on and off. They have been locked in the Cogsworth Clockworks steam room. Let us go there at once!"},
                {"who":"charles", "text":"[BANG] [BANG] [BANG]\nGet us out! The room is filling with High Pressure Steam! Oh, the cruel irony of being killed by the thing I love."},
                {"who":"nicola", "text":"The key that should open this door doesn't work! It appears someone has shot at the lock and ruptured a pipe inside! I know nothing of picking locks, let alone broken ones."}
            ],
            [
                {"who":"charles", "text":"Gertrude! I cannot thank you enough, not only for saving our lives, but also doing so using High Pressure Steam!"},
                {"who":"ada", "text":"Darling, how did you get into this dreadful situation?"},
                {"who":"charles", "text":"George and I were enjoying a couple drinks at the Old Brass tavern when things turned blurry. The next thing I remember is waking up in this room with Cogsworth accusing us of ruining his life. After being dismissed from the Academy, his investors began asking questions. His only choice was to silence us, giving him enough time to take his investors' money and beat a hasty retreat.\n\nQuick! To the aerodrome! We must not let him get away."},
                {"who":"george", "text":"This pipe carries launch codes from West to East. Each one is three codes long and transmitted at two ticks per code. Once we see Cogsworth's code of 27, 39, 31, we will know he is here and trying to get away."},
                {"who":"ada", "text":"Then it would be too late. By then he will have permission to launch and could get away. We must tell the aerodrome manager not to allow him to leave."},
                {"who":"george", "text":"Alas, the manager has been replaced with a Cogsworth machine. Likely a compromised one.\n\nWe must not allow Cogsworth's launch code to get through, yet we must not disrupt the aerodrome lest he discovers we are onto him.\n\nWhat if we delayed the signal by a few ticks and if we see it, we could remove it? This will give us time to locate and apprehend him."}
            ],
            [
                {"who":"ada", "text":"At last. With Cogsworth behind bars, we can finally complete our Steamputer.\n\nAll the parts are now in place. I have written what I shall name a \"programme\", to calculate Fibonacci numbers, but the results are incorrect.\n\nWe will need to refine the components until we get a functioning machine. There may be considerable time spent diagnosing the issues and fine tuning."}
            ],
            [
                {"who":"charles", "text":"It is here! The response from the Academy.\n\n\"We thank you for your submission of the Steamputer for review by the Academy of Sciences. We find it has considerably extended our knowledge in steam computation. Therefore we are pleased to say your application for membership has been approved!\""},
                {"who":"nicola", "text":"Congratulations Lady Chavvington."},
                {"who":"ada", "text":"Actually, the application was not for me. It was on Gertrude's behalf.\n\nGertrude, you were the one who constructed all these components and have shown us how to manipulate steam to wondrous uses. It is you who should be teaching others of the steam computation."},
                {"who":"charles", "text":"Huzzah!\n\nLet us celebrate this afternoon!"},
                {"who":"george", "text":"Lady Easley? Will you join us for the occasion?"},
                {"who":"annie", "text":"I am afraid I cannot, for I have an appointment this afternoon with a dashing gentleman."},
                {"who":"george", "text":"Oh."},
                {"who":"annie", "text":"That would be you George. Afternoon tea at Madingley Hall was offered and I graciously accept."},
                {"who":"ada", "text":"Thank you for playing ComPressure."}
            ]
        ],
        "hints":
        [
            [
                {"who":"charles", "text":"Click and hold the left mouse button to place a new pipe from the start point to the end. If you drag a new pipe over the old one, it will not connect them. If you get something wrong, you can remove the pipes using the right mouse button."}
            ],
            [
                {"who":"charles", "text":"The build menu lets you place a steam source which supplies steam at 100 PSI. An open ended pipe will release the pressure to 0. By tapping off a pipe somewhere in the middle, it may be possible to create a pressure somewhere in between."}
            ],
            [
                {"who":"charles", "text":"The build menu has the valve component. By connecting the \"+\" side of the valve to the North, it allows the North input to control how open the valve is. You can then simply connect East and West to connect the two when North is at High Pressure."}
            ],
            [
                {"who":"nicola", "text":"If I understand correctly, we need to connect the \"+\" port of the valve to a high pressure steam source, and the port marked \"-\" to the South input. This will connect East and West only when the South port pressure is low. If it is high, it will close the valve."}
            ],
            [
                {"who":"nicola", "text":"When the input is high, we connect the North. We know how to do that from the \"Normally Open\" design. And when the input is low, we connect the South. That's our \"Normally Closed\" design."}
            ],
            [
                {"who":"nicola", "text":"Well, let's start with the basics. When the input is high, we will connect the output to a steam source. When it is low, we will connect to the atmosphere. To connect to atmosphere, we simply leave the pipe end open.\n\nAs Lady Chavvington noted, the valves are analogue and it appears when values are between 0 and 100, the valves will partly open and recreate the exact ratio."}
            ],
            [
                {"who":"nicola", "text":"This time, when the input is high pressure, we want it to be connected to atmosphere. When the input is low is when we supply the steam. Our switch design was able to select between two values. Those values could be steam and atmosphere."}
            ],
            [
                {"who":"nicola", "text":"We can use valves to measure which of North and South is higher. If North is higher, we connect the output to steam. If South is higher, we connect it to atmosphere.\n\nRemember, the steam in the output pipe will not drain away by itself, we need to  actively release it using a valve."}
            ],
            [
                {"who":"nicola", "text":"I guess we already have a comparator, and we have a source of a precise value of 50."}
            ],
            [
                {"who":"nicola", "text":"When the input is 100, we want the output to be 50. So I guess we connect our 50 generator to the output using a valve. And when the input is 0, we vent the output to atmosphere."}
            ],
            [
                {"who":"nicola", "text":"This sounds like our buffer design again, but when the input is 50, we want the output to be 100. So the atmosphere venting valve should be closed once we reach 50. I guess, instead of using the 100 PSI on \"+\" side of the venting valve, we could switch it to 50. "}
            ],
            [
                {"who":"nicola", "text":"I don't remember there being any other components in this. I think we just need to connect what is there to the output."}
            ],
            [
                {"who":"nicola", "text":"If we pass the output through our encryption component, we can determine what the input must have been.\n\nWhen the two inputs on the comparator are equal, the output is neither pressurised, nor vented. If we get too much wobble, we should go back to our comparator design and make it less strong."}
            ],
            [
                {"who":"nicola", "text":"We can use the same trick as in our decrypt design. We increase or decrease the amount we open the bottom valve until the pressure between them is exactly 50. We have an Amp50 which does this."}
            ],
            [
                {"who":"nicola", "text":"We open one valve to the value of the West input minus the South input, we can then open a second valve to the same level of openness by looking for when the pressure between them is 50."}
            ],
            [
                {"who":"nicola", "text":"This one is somewhat harder. Using a subtractor gives us too much wobble.\n\nComparing the output minus one of the inputs to the other input fails if the second input is 0 and the valve is fully closed. But in that case we can use a second valve pair to do the same comparison and switching the inputs. We can then use an Amp50 to make sure the pressure between the four valves is 50 PSI.\n\nClick the requirements for a diagram of this setup."}
            ],
            [
                {"who":"annie", "text":"When the South input is high, we open our storage pipe. We can the use a buffer to pressurize the output to the same level as we captured. We have to close off the output while the South input is high so as to not let the new pressure propagate through. The easiest way to guarantee this is to use threshold of 50 on the timing and output valves."}
            ],
            [
                {"who":"nicola", "text":"The output is the value of a latch controlled by the South input. The input to the latch is either the latch output plus or minus the West input. The North input selects between them. We have an adder, a subtractor and a switch."}
            ],
            [
                {"who":"nicola", "text":"For a change a wobble is actually desirable. Amplifiers in a ring configuration will make the design unstable and will wobble up and down."}
            ],
            [
                {"who":"nicola", "text":"When West is higher than South, start adding more steam. When West is lower than North, start releasing more steam."}
            ],
            [
                {"who":"nicola", "text":"You can put valves in series. Only if all the valves are open will steam flow through."}
            ],
            [
                {"who":"nicola", "text":"This is not much different than our normal latch design, except the output and the timing pulse are not connected when the North input is low."}
            ],
            [
                {"who":"nicola", "text":"If the North select input is higher than 50, we enable one latch, otherwise we enable the other."}
            ],
            [
                {"who":"nicola", "text":"We need so many select signals! What if we chain a row of flow detectors with steam inlet at one end and atmosphere at the other? This would give us all the values we need to create."}
            ],
            [
                {"who":"nicola", "text":"We can use two Latch5 elements and switch between them depending if the select is below or above 50. But then we would need to scale the select from one of the two ranges (0 - 50, or 50 - 100) to the range the Latch5 design takes (0 - 100).\n\nI guess that Zoom element is useful after all, but in this instance it may need to be quite powerful. Each zoom would be connected to five flow detectors, and it will take it a while to pressurize all those pipes. To make a design stronger, we could simply duplicate it."}
            ],
            [
                {"who":"ada", "text":"It should be as easy as a comparator and a switch."}
            ],
            [
                {"who":"ada", "text":"Is this not just the same as our Min component but selecting the other way round?"}
            ],
            [
                {"who":"charles", "text":"We can form a value of 90 PSI using a long pipe venting pipe. A comparator between that and out input will tell us when to vent the vessel. As our comparator pressure rises from 0 PSI to 50 PSI, it should close off the input. Once it rises above 50 PSI it should open a valve to release the content of the vessel to the atmosphere."}
            ],
            [
                {"who":"george", "text":"We can use an adder with a static 10 PSI on one input. Then use a latch to capture the new value. Finally a Fuse in the loop will reset the counter to 0 PSI."}
            ],
            [
                {"who":"george", "text":"We can use the same method we used in the Latch10 design to select between ten values. Each value will need to be custom made and connected to the output when selected. This involves several custom designs."}
            ],
            [
                {"who":"george", "text":"We can connect our counter to the ROM, but first we will need to add 5 using an adder."}
            ],
            [
                {"who":"nicola", "text":"If we form a ring of Amp50 components with an inversion somewhere, we can get a regular beat. Once we get it close, we can tune it by adding pipe elements to slow it down a little."}
            ],
            [
                {"who":"nicola", "text":"A clock can select between the two inputs and on the other side of the wall, a synchronised clock can select between the outputs. Although we should not connect both inputs. By the time we open one, the second should be sealed off. We can use a 50 PSI as a reference."}
            ],
            [
                {"who":"annie", "text":"We can amend the counter to insert a switch to select between a new value or the incremented one."}
            ],
            [
                {"who":"annie", "text":"We only need to delay values of 0 PSI and 100 PSI. A chain of Amp50 elements will delay the pulse, with some minor tuning."}
            ],
            [
                {"who":"annie", "text":"A delay element will give us the timing pulse we need. Once we see the delayed pulse, we can capture the value, but also force the delay input to 0 PSI."}
            ],
            [
                {"who":"nicola", "text":"Instead of just plugging the hole, we could attach it to 100 PSI. That would make it easier. To make a steam key, one can replicate the pressures that are formed inside the lock."}
            ],
            [
                {"who":"george", "text":"We need three latches to delay the input sufficiently. A clock generator with a custom additional delay can clock them. To detect if all values are correct, a pipe can be slowly filled and if any latch value is either greater or less than the searched value, it can vent the pipe."}
            ],
            [
                {"who":"ada", "text":"Take your time and understand how the machine works. Once you do, you can improve your designs so they improve the operation of the Steamputer."}
            ],
            [
                {"who":"ada", "text":"No more hints. Enjoy your win."}
            ]
        ]
    },
    "中文":
    {
        "tooltips":
        {
            "Save"                      :   "保存",
            "Restore"                   :   "查看",
            "Best solution"             :   "最优设计",
            "Customize"                 :   "自定义",
            "Import level"              :   "导入关卡",
            "Delete"                    :   "删除",
            "Copy design\nto current"   :   "覆盖当前",
            "Delete level"              :   "删除",
            "Return"                    :   "返回",
            "Level Editor"              :   "编辑器",
            "Level select"              :   "选关",
            "Design"                    :   "元件",
            "Test"                      :   "测试",
            "Experiment"                :   "调试",
            "Scores"                    :   "分数",
            "Help"                      :   "帮助",
            "Repeat\ndialogue"          :   "对话",
            "Hint"                      :   "提示",
            "New design"                :   "新元件",
            "Valve"                     :   "阀门",
            "Steam Inlet"               :   "蒸汽源",
            "Rotate left"               :   "左旋",
            "Rotate right"              :   "右旋",
            "Reflect\nvertically"       :   "垂直翻转",
            "Reflect\nhorizontally"     :   "水平翻转",
            "Lock blocks"               :   "锁定方块",
            "Add sign"                  :   "注释",
            "Stop tests"                :   "停止",
            "Repeat 1 test"             :   "运行当前样例",
            "Run all tests"             :   "运行所有样例",
            "Export to\nclipboard"      :   "导出至剪贴板",
            "Import from\nclipboard"    :   "导入自剪贴板",
            "Accuracy mode"             :   "精准度模式",
            "Price mode"                :   "价格模式",
            "Steam mode"                :   "蒸汽量模式",
            "Confirm"                   :   "确认",
            "Cancel"                    :   "取消",
            "Exit"                      :   "退出",
            "Full Screen"               :   "全屏",
            "Join our Discord group"    :   "加入Discord服务器",
            "Info"                      :   "关于",
            "Select language"           :   "语言",
            "If you are stuck, consider discussing your challenges with the brightest minds of our High Pressure Steam Society on Discord. Press Esc and click the \"Join our Discord group\" button." :
                                            "如果您在游玩过程中遇到困难， 可以前来Discord上与优秀的高压蒸汽协会成员一同讨论您遇到的挑战。 按下Esc并点击“加入Discord服务器”来加入。",
            "Alas our journey must stop somewhere. The adventure continues\nin the full game.\n\nTo be continued..." :
                                            "看来我们的旅程必须在此停下了。 您将能够在完整游戏中继续您的冒险。\n\n敬请期待。",


            "Cross":      "交叉",
            "50":      "50源",
            "Normally Open":      "常开开关",
            "Normally Closed":      "常闭开关",
            "Switch":      "选择器",
            "Buffer":      "缓冲器",
            "Inverter":      "翻转器",
            "Comparator":      "比较器",
            "Amp50":      "鉴别器",
            "Div2":      "除二器",
            "Mul2":      "乘二器",
            "Encrypt":      "加密器",
            "Decrypt":      "解密器",
            "Sensor":      "测量器",
            "Subtractor":      "减法器",
            "Adder":      "加法器",
            "Latch":      "锁存器",
            "Tabulator":      "制表器",
            "Broken Link":      "解除连接",
            "Zoom":      "放大器",
            "Flow Detector":      "流量探测器",
            "LatchE":      "可控锁存器",
            "Latch2":      "二锁存器",
            "Latch5":      "五锁存器",
            "Latch10":      "十锁存器",
            "Min":      "最小值器",
            "Max":      "最大值器",
            "Fuse":      "保险器",
            "Counter":      "计数器",
            "ROM":      "只读存储器",
            "Poem":      "诗歌朗诵器",
            "Clock":      "时钟",
            "Cross v2":      "交叉2",
            "CounterE":      "可控计数器",
            "Delay":      "延时器",
            "Self-timed latch":      "定时锁存器",
            "Lock Picking":      "撬锁",
            "Code filter":      "过滤器",
            "Steamputer":      "蒸汽计算机",
            "END":      "尾声"


        },
        "help":
        [
            "在选关页面中， 下方的面板展示了此关的设计目标。 每一关四周都有四个管道， 每个管道有其对应的颜色。 设计目标说明了管道的之间应当如何相互作用。 点击设计目标面板可获得提示。",
            "当您通过了所有测试样例时， 您便可进入下一关。 您可随时返回调整先前的解法。\n\n点击下方的管道按钮以继续进行教程。 您可以按F1打开此帮助。",
            "管道可通过两种方法放置： 一是按住左键， 从起点拖动至终点来放置管道； 二是点击左键， 使管道向鼠标方向延伸。 点击右键可退出管道放置状态。",
            "按住右键可删除管道以及其他元件。",
            "您可通过元件页面向关卡中添加元件。 选中蒸汽源并将鼠标停留在关卡中时， 可通过方向键改变蒸汽源朝向。 您也可通过按Q键与E键或是滚动滚轮来旋转。 点击左键可放置元件，点击右键可退出元件放置模式。",
            "阀门可通过同种方式放置。 按下Tab键或是滚轮， 可快速选中阀门； 而再次按下Tab键或是滚轮，可选中蒸汽源。",
            "蒸汽源会提供压强为100 PSI的蒸汽， 而断开的管道会将蒸汽排放至大气中， 压强变为0 PSI。",
            "在管道的连接处可以读出该点的压强。 注意每段管道都有一部分阻抗。",
            "当阀门的“+”端压强大于“-”端压强时， 蒸汽可以通过。 二者差值越大， 阀门的开度越大。 “+”端与“-”端的蒸汽不会被消耗。\n\n在图中， “-”端连接大气， 因此为0 PSI； 而“+”端为100 PSI， 故阀门的开度为100%。 如果“+”端为75 PSI而“-”端为25 PSI， 则阀门的开度为50%。",
            "“+”端的压强不大于“-”端的压强时， 阀门将会关闭， 蒸汽无法通过。",
            "如果在阀门的“+”端连接蒸汽源， 那么只有当“-”端的压强小于100 PSI时， 阀门才会打开。\n\n和之前一样， 阀门的开度与“+”端与“-”端的差值成正比。",
            "在阀门的“-”端连接蒸汽源会关闭阀门， 因为“-”端的压强总是不小于“+”端的压强。",
            "您可通过测试页面观察您的设计运行结果如何。 该页面中前三个按钮的作用分别是停止、 运行当前样例和运行所有样例， 对应的快捷键是1、2、3。\n\n每一样例上标注的是当前的分数， 下方标注的是最优设计的分数。 在最右端是通过取各分数最小值得到的最终分数。",
            "下方面板展示了当前样例的输入序列和预期输出。 当前运行的样例将被高亮显示。 上一次运行的结果记录在了输入序列右端。 您可按空格键切换至下一个样例。\n\n您每一样例所得的分数由最终输出与预期输出的差值决定。 图像将显示样例中最后一个状态的输出曲线。\n淡线代表最优设计的曲线。",
            "在调试页面中， 您可以手动改变各个管道的值， 观察设计是如何运行的。 竖直滑块可调整所需的值， 水平滑块可调整输入强度。 将水平滑块移至最左会变为输出管道。 各管道道初始值由当前样例决定。",
            "下方的图像记录了各个管道的值的变化。",
            "有两种方式同时选中多个元件： 按住Ctrl时点击， 或是按住Shift时拖动。 选中的元件在不被阻挡的情况下， 可通过WASD移动， 通过Q和E旋转。 选中的元件可通过C键复制， X键剪切， V键粘贴。 按下Delete可删除选中元件。 可通过Z键或同时按下左右键撤销， Y键或是Shift+Z重做。",
            "按下Esc可打开游戏菜单。 菜单中可退出游戏、 切换窗口与全屏、 加入Discord服务器或查看制作信息。\n\n右端滑块可调整音效与音乐的音量大小。",
            "已完成的设计可作为元件使用。 元件页面中会列出所有可用的元件。 改变元件的设计将会影响到所有使用该元件的关卡。\n\n双击元件可查看元件内部设计， 点击左上元件图标可退出。 查看元件内部时， 点击自定义变为自定义元件可自由修改内部设计， 不受原元件影响。 红色元件表明这是一个自定义元件。",
            "每关有四个可保存设计的档位， 最优设计也会自动保存以便使用。 设计可以通过剪贴板导入与导出。\n\n进入分数页面可展示全球分数分布曲线与您和您的好友的分数。 您可以自由查看您与您的好友的设计。",
            "在同时通过蒸汽源导入蒸汽并排放蒸汽至大气的情况下， 适当调整导气与排气的比例可以产生特定的压强。 阀门的开度由“+”端与“-”端的差值决定。\n\n开度 = ( P - N ）%\n\n其中P代表“+”端压强， N代表“-”端压强。 左端下方的阀门开度为40% (60 - 20）。",
            "左图中的设计产生的压强， 可通过导气阀开度除以二者开度的和近似计算。\n\n压强 = 100 * S / (S + V)\n\n其中S表示导气阀的开度， V表示排气阀的开度。 左图中， 导气阀开度为40% (40 - 0)， 排气阀开度也为40% (60 - 20)。\n二者之间的输出值是100 * 40% / (40% + 40%） = 50， 即50 PSI。",
            "有三种计分模式可供选择。\n默认模式（精确度模式）通过最差情况下与预期输出的差值计分排名。\n\n价格模式通过造价多少排名。 管道开口各花费£1， 阀门花费£5，  蒸汽源花费£10， 集成元件额外花费£4。\n\n蒸汽量模式通过计算蒸汽源的蒸汽消耗量排名。",
            "玩家可制造自制关卡， 绘制关卡图标、 设计样例并通过剪贴板分享。 测试样例可以通过+或-按钮来增加或删去， 每个状态的时长都可自行调整。 如果在运行所有样例时有些状态可被跳过， 也可通过对应按钮来设置。 设计可只在当前样例下重置， 也可在所有样例下重置。 可通过管道图标选择需要的管道以及输出管道。 输入值均可通过调试页面更改。",
        ],
        "dialogue":
        [
            [
                {"who":"charles", "text":"你好， Gertrude！  我是Charles Chavvington， 是这项通用高压蒸汽工程的所有人。 我们从这里向半个城市提供高压蒸汽， 从蒸汽伞到蒸汽木琴的各式物品都由我们提供动力。\n\n我已离去的妻子Ada要求， 在她离开我们之后， 我们要继续她对于蒸汽的数学性质的研究， 因此我们雇用了你。 你的职责是维护她留下的设计， 并继续进行这些研究。"},
                {"who":"charles", "text":"相信你在之前的学习中已经掌握了基本的蒸汽工程知识， 但在你进入她的实验室之前， 必须先证明你能熟练做到基础的蒸汽管道建造。\n\n将西部的蒸汽厂连接到东部设施， 并将北部的蒸汽厂连接到南部设施。 不要把管子连在一起！ 这样做会为南部的设施提供免费蒸汽， 而且他们从不按时付账！\n\n如果你还不太熟悉我们的高压蒸汽管道， 右上角有一本标着“？”的工程手册。"}
            ],
            [
                {"who":"charles", "text":"见鬼， Ada的实验室安全门居然是用低压蒸汽操作的！ 不知道她是怎么把这玩意打开的。\n\n在通用高压蒸汽工程里， 我们生产的蒸汽压强都是100磅每平方英寸（PSI）， 而这个门用的是Moorhouse的低压蒸汽， 工作压强是50磅每平方英寸（PSI）。 如果我把他那变质的蒸汽引到我的屋里， 我会被诅咒的！"},
                {"who":"charles", "text":"如果你不能提供50 PSI的低压蒸汽， 我们就只能放弃了。\n\n在元件页面中， 你可以找到蒸汽源， 它可以为你提供大量的100 PSI高压蒸汽。 就在上面， 用扳手标记着。 你也可以按两次Tab来选中。"}
            ],
            [
                {"who":"charles", "text":"天哪， 你做到了！ 虽然这白白浪费了大量的优质蒸汽， 但它确实能用。 抱歉， 这里面并不太整洁， 因为曾经有一些流氓闯入过， 把这里弄得一团糟。\n\n在这个实验室里， 我亲爱的Ada对我按照精确规格制造的阀门进行了研究。 在标有“+”的端口上施加高压蒸汽时， 阀门会被打开， 蒸汽可以在两个未标记的端口之间自由流动。\n\n试一试吧， 当北部处于高压时， 连接西部和东部。"}
            ],
            [
                {"who":"nicola", "text":"做得好！"},
                {"who":"charles", "text":"啊， Nicola， 你来得正是时候。 Gertrude， Nicola将成为你的助手， 他已经开始研究Ada留下的笔记了。 下一个部分对你将会是更大的挑战。\n\n向“+”端通入蒸汽时会打开阀门， 而向“-”端通入蒸汽会关闭阀门。 阀门只有在“+”端的压强高于“-”端时才会打开。 \n\nAda让我加上这个， 这样她就能在向控制管施加高压时关闭阀门。 让我们试试这些阀门还能不能正常工作。"},
                {"who":"charles", "text":"当南部的压强低于100 PSI时， 连接西部和东部。\n\n你可以使用蒸汽源提供良好的高压蒸汽。"}
            ],
            [
                {"who":"charles", "text":"好极了！ 现在把这两种设计结合， 应该可以构造一个在两个源之间切换的元件。\n\n当西控制室提供100 PSI的高压蒸汽时， 东设施应连接到北蒸汽厂； 但当西控制室的压强为0 PSI时， 东设施应连接至南蒸汽厂。"},
                {"who":"nicola", "text":"控制室提供的压强在0到100 PSI之间时会发生什么？"},
                {"who":"charles", "text":"什么！？！ 那就是低压蒸汽了， 我们可不用低压蒸汽！ 我可不是靠给人们提供低压蒸汽挣钱的！\n\n总之别管那些没用的低压蒸汽。 当西控制室给高压蒸汽时，接北蒸汽厂，否则接南蒸汽厂。"}
            ],
            [
                {"who":"nicola", "text":"Chavvington女士的笔记提到， 实验室和Easley女士的住所之间连接有用来通讯的管道。"},
                {"who":"charles", "text":"是的， 不过我已经把它拆了。 太多高压蒸汽不知道导哪儿去了， 所以现在有了新规定， 只有按量供应给付费客户的蒸汽才允许离开我们工厂， 其他所有高压蒸汽都不能通过这些墙导出去。"},
                {"who":"nicola", "text":"但根据这些笔记， 我想还是有办法在不导出蒸汽的情况下建立一个连接的……"},
                {"who":"charles", "text":"哈哈， 那是不可能的！ 这可是最基础的蒸汽学！ 蒸汽信号的传递依赖于蒸汽的传递， 而现在任何蒸汽都不能“传递”出去。\n\n无论如何， 我还有其他事情需要去办。 调查我那不知去向的蒸汽可比现在这件事紧急多了。"},
                {"who":"nicola", "text":"正如Chavvington女士在笔记里写的那样， Charles并不是个好的倾听者。 她在笔记里具体地描述了这个设计。"},
                {"who":"ada", "text":"6月5日\n我今天制造了一个神奇的压强复制元件。 为了产生一个特定的压强值， 我使用两个阀门， 以精确的比例导入并排放蒸汽。 把导气阀开到80%， 把排气阀开到20%， 就能产生与原来相同的80 PSI。 Charles的阀门开度看起来是“+”端的压强减去“-”端的压强。\n\n这适用于整个数值范围， 误差也很小。 由于它能隔离开前后管道之间的影响， 我将它命名为“缓冲器”。"},
                {"who":"ada", "text":"不是通过蒸汽流， 而是通过压强进行通讯。 这个想法能够带来很多神奇的可能性， 因为压强不会因长管道的阻抗产生偏差。 我向Charles解释了这个想法， 但他显然更关心公司的利益。"},
                {"who":"nicola", "text":"原来的一些部分设计似乎还安装在墙上。 只要我们用Easley女士的蒸汽为墙外的装置提供动力， Charles就没法抱怨了。"}
            ],
            [
                {"who":"nicola", "text":"还不是很好， 但我们可以随时回来改进。 太神奇了， 通过两个阀门的组合能重现任何压强值。 输入的压强把导气阀和排气阀打开到对应的程度， 就可以正确地在输出端重现原管道中的压强。\n\n让我们给Easley女士发送一条消息， 看看这个管道还是不是有效。"},
                {"who":"annie", "text":"[一段时间后]\n你吓了我一跳！ 有那么一瞬间， 我以为是Ada在坟墓另一边跟我说话！"},
                {"who":"nicola", "text":"我们向您道歉， Easley女士。 我们正尝试继续Chavvington女士的研究。 我试图发送80 PSI， 因为根据我们的代码本， 它的意思是“你好”。"},
                {"who":"annie", "text":"不！ 80 PSI意味着 “救命！ 我被困在来世！ ”。 20 PSI的意思才是“你好”。\n\nAda安装系统时， 在阀门上犯了一个错误， 所以所有的压强都被翻转过来了。 正是在调查这个问题时， 她突然意识到蒸汽的可能性。 我们没有修复它， 而是在代码本中翻转了所有的压强值。"},
                {"who":"nicola", "text":"有意思。 也许我们应该试试能不能犯同样的错误。"}
            ],
            [
                {"who":"charles", "text":"可恶， 无论如何我都找不到Ada制造的压强比较仪！ 著名的高压蒸汽协会每年都会对所有高压蒸汽工厂提供的蒸汽压强进行比较， 确定哪一家供应商提供压强最高的蒸汽。 如果没有准确的比较器， 我们就不得不取消今年的比赛了。\n\n我蝉联五年的获奖记录会被毁掉的！ 我敢肯定她放了一个比较器在这附近的某个地方……"},
                {"who":"nicola", "text":"我们得给他做一个， 不然他会在这里一直打扰……"},
                {"who":"charles", "text":"你刚才说了什么？"},
                {"who":"nicola", "text":"我说我们可以做一个比较器， 先生。"},
                {"who":"charles", "text":"好极了！ 记住， 只做到在一个输入大于另一个时将输出连接到高压蒸汽是不够的。 相反的情况发生时， 还必须将输出排空。 我的管道是完全密封的， 永远不会泄漏蒸汽， 所以必须打开一个阀门让它们排气。"}
            ],
            [
                {"who":"charles", "text":"非常好， 十分精确！ 我相信它连一根羽毛在一整个球场上产生的压强都能探测到。\n\n不过在你继续研究之前， 我还需要一个装置。 要想加入高压蒸汽协会， 就必须证明自己的蒸汽厂生产的是高压蒸汽。"},
                {"who":"charles", "text":"在我的通用高压蒸汽工程中， 生产的都必须是100 PSI的高压蒸汽， 这也是我唯一真正认可的的高压蒸汽。 但从技术上讲， 任何超过50 PSI的蒸汽压力都能被视为高压蒸汽。 作为高压蒸汽协会的主席，我有责任确保没有任何生产劣质低压蒸汽的人员加入。\n\n我需要一个装置来确定申请人的蒸汽的质量。"},
                {"who":"nicola", "text":"你设计的50 PSI发生器还在工具箱里。 我们可以用已经完成的设计作为元件。"}
            ],
            [
                {"who":"charles", "text":"很好！ 有了这个装置， 我就不会让那些生产低压蒸汽的人进入我们的独家协会。"},
                {"who":"nicola", "text":"协会里到目前为止有多少成员？"},
                {"who":"charles", "text":"嗯……一个……正如我所说的“独家”……\n\n无论如何， 我现在必须离开， 以免错过我的酒会！"},
                {"who":"nicola", "text":"最后……\n\n根据Chavvington女士的笔记， 还有第二条通讯管道被安装， 通往了Moorhouse先生的住所！ 如果Charles知道了， 他不会高兴的。 你看："},
                {"who":"ada", "text":"6月17日\n\n随着通往Moorhouse先生庄园的管道逐渐完工， 我开始研制一种装置， 将高压值（0-100）压缩到低压系统可接受的范围（0-50）。 令我惊讶的是， 由Moorhouse先生的低压蒸汽提供蒸汽源， 但仍然使用100 PSI作为参考压强时， 缓冲器能够将输入压强精确地缩放到一半。\n\n这些特性在数学领域可能有着惊人的用途。"},
                {"who":"nicola", "text":"真的吗！？！那怎么可能呢？"}
            ],
            [
                {"who":"nicola", "text":"太令人吃惊了！ 好吧， 我们已经成功了一半了。 我们可以发送信号了， 但现在我们还需要接受信号。 我们必须把他的蒸汽压强扩大到我们的使用范围。 根据Chavvington女士的说法， 需要用100 PSI的蒸汽为元件提供蒸汽， 但是用50 PSI作为参考压强。"}
            ],
            [
                {"who":"nicola", "text":"试试看这能不能起作用。\n\n80 PSI[你好]\n55 PSI[请求会面]\n57 PSI[在Madingley大厅进行下午茶]"},
                {"who":"george", "text":"……\n23 PSI [拒绝]\n……\n6  PSI [6]\n12 PSI [/]\n7  PSI [7]"},
                {"who":"nicola", "text":"什么？！？ 6/7？ 让我查一下笔记。\n……\n 6月7日的所有内容都是关于压强翻转器的设计。 如果压强翻转了，他怎么能和我们沟通呢……翻转的……翻转？……对了！\n\n抱歉， 之前我的所在地使用的日月顺序是相反的。 这才是正确的笔记。"},
                {"who":"ada", "text":"7月6日\n\n我怀疑我们的通讯管道被破坏了！ 经过几天的恳求， Moorhouse先生终于同意了与我一同进行研究工作。 我们通过通讯管道交换了各自实验室门的密码。 但在几小时后， 我就收到了一张他手写的便条， 告知我他的实验室已被洗劫一空， 不愿再接受我的合作了。 我赶紧前往我的实验室， 发现也已经被人闯入了！ 许多工作成果都已经丢失了。"},
                {"who":"ada", "text":"我把密码保存地很安全， 而Charles也肯定不会做出这种事。 我立刻把实验室的门换掉了。 Charles宁死也不愿开Moorhouse的低压蒸汽门。"},
                {"who":"ada", "text":"我感觉这里不再安全了。 我联系了我姐姐， 告知她我很快就会前往她家。 这正适合测试我的新加密系统， 因为它能保持我们的通信安全。 Charles曾答应过会通过管道向姐姐的住所发送信号， 但我仍然没有收到。 他有时真的很健忘。"},
                {"who":"nicola", "text":"那是她最后一篇笔记。\n\n哦等等！ 我以为这根管道不会通向哪儿， 所以把这些部件都用到我们的其他设计中了。 还好有些管道是是焊住的， 我把它们留在原处了。 加密部分似乎基本上还可以正常工作。"}
            ],
            [
                {"who":"nicola", "text":"这并不难， 加密只是一个不平衡的缓冲器。 但是该怎样做出一个能精确解密的设计呢？\n\n也许Easley女士可以帮上忙， 我应该问问她有没有空帮助我们……"},
                {"who":"annie", "text":"你们有没有在Ada的文件里找到一张Madingley茶室的餐巾？ 那天应该是6月24日， 我们正在讨论英国皇家学会的新论文“单调序列的收敛性”时， Ada突然开始在餐巾上写些什么。 之后她就跑出了茶室， 大喊她可能已经解决了解密的问题。 顺带一提， 她没结账。"},
                {"who":"ada", "text":"6月24日\n解密设备可以通过反复猜测值， 对猜测的值进行加密， 并将其与加密输入进行比较， 来不断逼近原值。 如果输入值更高， 就增大猜测值； 如果输入值低一点， 就减小猜测值。 这样的设计还能实现许多功能的翻转。\n\n我需要用用Charles的比较器， 不过我得记得在今年的高压蒸汽协会会议之前把它还给他。"},
                {"who":"nicola", "text":"至少我们知道了他的比较器到哪儿去了。"}
            ],
            [
                {"who":"nicola", "text":"简直不可思议！ 我们可以用这种方法提高所有设计的精度。 Chavvington女士的姐姐一定有更多关于这些技术的信息。\n\n80 PSI[你好]"},
                {"who":"ada", "text":"80 PSI [你好]\n93 PSI [这里是Ada Chavvington]\n"},
                {"who":"nicola", "text":"60 PSI [谁?]\n73 PSI [重复]"},
                {"who":"ada", "text":"25 PSI [A], 28 PSI [D], 25 PSI [A]\n24 PSI [_]\n27 PSI [C], 32 PSI [H], 25 PSI [A], 46 PSI [V], 46 PSI [V], 33 PSI [I], 38 PSI [N], 31 PSI [G], 44 PSI [T], 39 PSI [O], 38 PSI [N]"},
                {"who":"nicola", "text":"怎么会这样？ 我们得马上通知Chavvington先生。\n……\nChavvington先生！ 我们与Chavvington女士的姐姐的住处联系上了， 但另一端的人却自称就是Chavvington女士本人！"},
                {"who":"charles", "text":"啊， 那应该就是Ada吧。"},
                {"who":"nicola", "text":"但……但是Chavvington先生， 你说Ada离世了。"},
                {"who":"charles", "text":"胡说八道！ Ada好好活着呢， 现在和她姐姐住在一起。 等我们解决了高压蒸汽不知去向的问题后她才回来。"},
                {"who":"nicola", "text":"但你说她“离去”了。"},
                {"who":"charles", "text":"对啊， 她“离”开这里“去”她姐姐……"},
                {"who":"nicola", "text":"每个人都觉得她离世了……"},
                {"who":"charles", "text":"嗯……好吧……我想了想， 这可能就解释了为什么会有人给我送花和卡片， 对我的损失表示同情。 我真的因人们对我失去高压蒸汽的担心感到很感动……\n\n不过这些都是无关的。 你越早完成蒸汽计算器， 我们就能越早弄清真相。 赶紧继续研究。"},
                {"who":"ada", "text":"6月27日\n我和Moorhouse先生在蒸汽计算方面取得了进展。 我们以前的设计不够精确， 只有当阀门完全平衡产生50 PSI的输出时， 结果才是精确的。 对于这一点我突然想到了一个主意。\n\n通过放置另一个阀门并调整其开度， 我可以探测任何阀门的开度。 因为只有当两个阀门开度相等时， 它们之间的压强才会精确到50 PSI。 我所要做的就是不断调整数值， 直到出现这种情况。"},
                {"who":"ada", "text":"利用这一方法， Moorhouse先生设计出了一个蒸汽压强加法器。 我十分希望他能向我透露他是怎么制作的。\n\nMoorhouse先生非常内向， 也十分聪明。 唉， 他总是害怕分享他的创新成果。"}
            ],
            [
                {"who":"nicola", "text":"好的， 它起作用了。 我们现在可以探测阀门的开度， 但还不清楚这对蒸汽计算有什么帮助。 我想我们得问问Moorhouse先生。"},
                {"who":"nicola", "text":"Moorhouse先生， 谢谢您允许我们前来拜访。 在Chavvington女士离开的情况下， 我们正试图继续完成她的蒸汽计算工作。 现在只有您知道加法器的结构， 请问能否向我们透露它的结构？"},
                {"who":"george", "text":"当然可以。 尽管她与Charles串通一同针对我， 知识的发展也不能因此停步。 我会将加法器的原理公之于众， 以确保她不受他的伤害。 那些传闻让我怀疑她已经死于他手。"},
                {"who":"nicola", "text":"Chavvington女士还活着， 现在和她姐姐住在一起。"},
                {"who":"george", "text":"这就让我放心了。 一想到她可能还要在那高压蒸汽的危险环境里呆上很久， 我就彻夜难眠。 如果有高压蒸汽罐爆炸了， 就将会造成极大的破坏性， 后果难以想象。 在摆脱这种高压恐怖之前， 我是不会停下的……\n\n哦……我刚刚说到哪儿了？ 对了是加法器。 在你做它之前， 你必须先做一个减法器。 阀门的开度等于“+”端的压强减去“-”端的压强。 先制造一个两端有压强差的阀门， 然后测量它的开度就可以得出结果。"},
                {"who":"george", "text":"但现在我就得走了。 既然Ada还活着， 我就要去准备更加重要的任务。"}
            ],
            [
                {"who":"charles", "text":"我把Ada要求通过管道发送的信号序列带来了。"},
                {"who":"nicola", "text":"那个信号几个月前就该发了。"},
                {"who":"charles", "text":"是的， 但我说过要做某件事时， 我肯定会去做的， 没必要每个月都提醒我。\n\n你能帮我给她发条信息吗？\n\n80， 94， 76， 52， 68， 70"},
                {"who":"nicola", "text":"看来你已经学会使用这些代码了！"},
                {"who":"charles", "text":"学会？！？ 这可是我设计的！ 我在从军的时候， 把上校之间最经常使用的消息组合设计成了这套代码。\n\n别问那么多了， 赶紧把消息发出去。"},
                {"who":"nicola", "text":"80 PSI [你好]\n94 PSI [这边是Charles Chavvington]\n76 PSI [我亲爱的天使]\n52 PSI [我的心向往着你]\n68 PSI [我热切地等待你的归来]\n70 PSI [没有你我的生命就没有意义]"},
                {"who":"charles", "text":"好极了， 看来现在减法器已经做好了！ 正如我已离去的妻子所说……"},
                {"who":"nicola", "text":"先生！ 你不要再用那个词了！ 人们都开始认为你是杀人犯了……"},
                {"who":"charles", "text":"嗯……好吧。 正如……不再和我们待在一起的Ada所说， “加法器就是反向的减法器。 输出减去其中一个输入应该等于另一个输入。” 但是应该减去哪个输入？\n\n她有一段时间很沮丧， 因为当一个输入为零时， 她的设计会卡住； 而交换输入后， 另一个输入为零也会使设计卡住。 后来她灵光一现， 意识到需要把两种方法结合。"}
            ],
            [
                {"who":"annie", "text":"为什么你们没有回复我的信息？"},
                {"who":"nicola", "text":"抱歉Easley女士， 但我们没有收到任何信息。"},
                {"who":"annie", "text":"它们应该记录在了你的信息锁存器上。\n……\n\n锁存器到哪儿去了！ 肯定是被闯进实验室的人偷了。 为防止错过其他重要的信息， 你们应该立刻重新制造锁存器。"},
                {"who":"annie", "text":"当信息稳定下来时， 时钟管会发送一个脉冲， 锁存器就会捕获当前值。 锁存器会记录当前值， 但时钟管恢复低压前， 输出都将保持旧值。\n\n因为需要通过顺序放置锁存器来记录一系列信息， 所以只有当时钟管恢复到低压时才能输出新值。"},
                {"who":"annie", "text":"Charles的阀门令我印象深刻， 因为它们的密封性非常好， 在关闭时能够保持管道内的压强不变。\n\n我希望这个设计能够重现， 因为我有对它进行多方面扩展的计划。"}
            ],
            [
                {"who":"charles", "text":"好消息！ 让我向你们介绍Joseph Cogsworth教授。 他在世上即便不是最聪明的也是最聪明的之一。 他制作的齿轮传动制表机为我们的会计部门创造了许多奇迹。\n\n他一直在帮助我们解决高压蒸汽失踪问题， 而且表现出了对Ada的成果的兴趣。"},
                {"who":"joseph", "text":"很高兴看到你们已经进展到这么远了。 看来你们已经重新造出了Ada在笔记里描述的寄存器。"},
                {"who":"nicola", "text":"那些笔记在实验室被闯入时就不见了， 你怎么知道的？"},
                {"who":"joseph", "text":"Ada很欣赏我的成果。 尽管我认为她那些基于蒸汽的计算方法太过粗糙， 不够准确， 她还是经常会征求我的意见， 希望能够提升精确度。"},
                {"who":"charles", "text":"一旦蒸汽制表器制作好了， 我们就能够确定哪个会计盗用了我的高压蒸汽。\n\n每个制表器从当前计数中加上或减去一个值。 北输入选择进行加或减， 南输入提供定时的高压蒸汽脉冲。\n\n为了提高各个元件的精确度， Ada必须改进她之前的所有设计。 这是她从未能完成的。"}
            ],
            [
                {"who":"charles", "text":"很好， 但已经迟了， 因为Cogsworth教授已经找出了盗用蒸汽的会计。"},
                {"who":"joseph", "text":"作为回报， 我希望能得到这种蒸汽制表器的原型设计。 Ada希望我能够接手她所有研究。 Gertrude， Nicola， 你们的工作已经完成了。"},
                {"who":"ada", "text":"我可没这么说过！ 我可不会把我的工作交给一个性格和智力都不怎么样的人。"},
                {"who":"joseph", "text":"Ada！ 我以为你已经去世了！"},
                {"who":"ada", "text":"Charles！ 抓住这个人， 他就是引起这一切事件的罪魁祸首！"},
                {"who":"charles", "text":"什么！？！ 我难以相信像他这样有地位的人会做出这样的行为。"},
                {"who":"george", "text":"是真的， Charles。 Joseph用谎言挑起我们相互攻击， 使我们彼此憎恶。 起初我和他合作是因为他不喜欢高压蒸汽， 但后来我才意识到， 他讨厌所有蒸汽！"},
                {"who":"charles", "text":"Joseph， 这是真的吗？ 你对高压蒸汽一点热情也没有？"},
                {"who":"joseph", "text":"当然是真的！ 可恶的蒸汽。 但是你要抓住我？ 凭什么？ 你没法证明我有任何不当行为！"},
                {"who":"ada", "text":"当然能够证明。 你的齿轮制表机从每笔交易中减去了很小的值。 我们将结果与蒸汽制表机进行比较时， 才发现了这些错误。 你就是通过这样逐渐挪用高压蒸汽的。 如果不是Charles感到有什么不对劲， 这件事就永远不会被发现。"},
                {"who":"joseph", "text":"太荒谬了！ 我要这恶心的蒸汽做什么！"},
                {"who":"george", "text":"把你让我在市政厅下方建造的蒸汽容器慢慢装满。"},
                {"who":"charles", "text":"什么！？！ 那可是个低压容器！ 你不知道装入高压蒸汽的后果吗！？！"},
                {"who":"joseph", "text":"唯一的后果是人们将永远拒绝蒸汽！ 它会留作处决之用， 而且只能在博物馆里看到。 看看现在！ 蒸汽管已经蔓延到了办公室内， 取代了我的机器！ 只有我的齿轮机器才能…\n\n什么！？！ 放开我！ 放开我， 你们这些可怜的傻瓜！ 你不能这样对我！ 等研究院了解了这件事再说！"},
                {"who":"charles", "text":"研究院当然会了解这件事！\n\n对这件事来说， 这是一个令人满意的结果。 我的高压蒸汽和我亲爱的Ada一样安全。"},
                {"who":"ada", "text":"事实上， 亲爱的， 我认为蒸汽计算的故事才刚刚开始。"},
                {"who":"charles", "text":"是的。 但是， 也许我们应该先把这个随时可能爆炸的蒸汽炸弹拆除……"}
            ],
            [
                {"who":"ada", "text":"谢谢你， Gertrude。 要不是你这么快就解决了它， 它可能就会带来灾难了。"},
                {"who":"george", "text":"对此我也十分钦佩。 Ada， 我对指控你洗劫我的实验室感到十分抱歉。 Gertrude和Nicola能帮助我进行设计吗？ 我认为他们的意见会很有建设性。"},
                {"who":"ada", "text":"别再说这些了， 我也得向你道歉。 为表达我的善意， 请随意使用我的……我们的实验室。 Easley女士已经有实验室的权限了。 我认为Charles和我需要在这场骚乱后休息一下。 我们将在几天后回来， 希望能够看到你们的进展。"},
                {"who":"george", "text":"好的， 一路平安。\n\nNicola， 你能帮我找找那个乘二器吗？"},
                {"who":"nicola", "text":"就在这儿。\n\n它的构造很简单， 但我发现这个设计模式非常有用。"},
                {"who":"george", "text":"的确。 这个装置只能把数值从0到50这一范围放大到0到100。 我认为在给定值的范围时， 可以制造一个把值放大到任何范围的元件。"},
                {"who":"nicola", "text":"我们可以把它命名为放大器。"},
                {"who":"george", "text":"是的， 但首先我们应该先制造出来。 北输入给出取值范围的上限， 南输入给出取值范围的下限。 东输出表示西输入在取值范围内的位置。"}
            ],
            [
                {"who":"george", "text":"很好， 现在我们可以放大任何压强范围。 接下来需要一种探测压强是否在某个范围内的元件。 看看这个“蒸汽速度表”。\n\nAda为Charles造了这个来测量蒸汽量。 当蒸汽通过长管道时， 它的压强会有所损失。 蒸汽的流速越快， 压强损失就越大。 如果两边的压强相同， 蒸汽就不会流动。 她甚至在管道里放了一些阀门来增加阻抗， 使差别更加明显。"},
                {"who":"george", "text":"现在需要一种设计来判断西输入值是否介于这两个压强之间。它需要比北压强低， 比南压强高。"}
            ],
            [
                {"who":"george", "text":"现在通过放大值的范围， 我可以更准确地判断蒸汽的使用量， 同时也可以判断值我是否在我检查的范围内。 下次我要告诉我的客户在蒸汽账单上多留一位小数！"},
                {"who":"annie", "text":"这些研究只是为了帮助你的公司盈利吗？我们定的协议上可不是这样说的。"},
                {"who":"george", "text":"Easley女士！ 这个元件确实是给你做的。 相信我， 之后这个元件将会非常有用。"},
                {"who":"annie", "text":"我对此深表怀疑。 是时候进行一些纯粹的研究了。\n\n让我们回到Ada和我正在研究的锁存器设计。 我想要一个可以启用或禁用的锁存器。 如果北输入是高压， 锁存器正常工作； 但如果是低压， 则既不应改变原有输出， 也不应在收到脉冲接受新的输入。 我们可以在旧设计外部进行延展， 但重做一个可能效率更高。"}
            ],
            [
                {"who":"annie", "text":"现在我想要一个“寻址锁存器”的设计， 其中北输入在几个锁存器中进行选择。 这样我就可以同时存储多个值并随意访问。\n\n让我们先从两个值开始。 北输入在两个锁存器之间选择。 值在0到50间时选择第一个， 在50到100间时选择第二个。"}
            ],
            [
                {"who":"annie", "text":"好， 但这就是我们目前能做到的最好地步了。 接下来我想要一个可以存储五个值的锁存器， 但我和Ada总是无法将其整体放入一个设计中。 选择范围是0-20， 20-40， 40-60， 60-80和80-100。 可检测选择信号处在哪一范围太困难了。"},
                {"who":"george", "text":"有检测压强范围的装置就能做了。"},
                {"who":"annie", "text":"但你的设计检测的是是否在某一范围， 不是在哪一个范围。"},
                {"who":"george", "text":"是， 但也不完全对。 它探测的是流动蒸汽的压力范围。 如果把它排成一列， 让蒸汽通过， 就能检测出压强处于哪个范围。"}
            ],
            [
                {"who":"annie", "text":"我承认， 流量探测器是很巧妙， 也确实是我们需要的。 但现在， 我们该如何把两个五锁存器合成一个十锁存器？\n\n选择范围是0-10，10-20，20-30……"},
                {"who":"george", "text":"这就是为什么我要设计放大器。 我早就看出了你的想法的绝妙之处， 并且已经提前计划好了。"}
            ],
            [
                {"who":"ada", "text":"真令我吃惊。 我们才离开了几天， 你们就已经造好了蒸汽计算机的存储器。"},
                {"who":"nicola", "text":"蒸汽什么？"},
                {"who":"annie", "text":"一切都会慢慢揭晓的。\n\n好吧， 我想我的工作已经完成了！ 我已经成功设计了存储器， 现在到你来设计计算和控制部分了？"},
                {"who":"ada", "text":"先从简单的部分做起吧。 我们需要一个能给出两个输入值中较小值的元件。 这应该不难。"}
            ],
            [
                {"who":"charles", "text":"亲爱的艾达！ 尝尝George介绍给我的这种令人兴奋的新饮料吧！ 它被称为“Froffee Coffee”。 尝尝看！"},
                {"who":"ada", "text":"嗯， 它尝起来的确很不错……"},
                {"who":"charles", "text":"你知道什么能让它变得更好吗！？！"},
                {"who":"ada", "text":"高压……?"},
                {"who":"charles", "text":"高压蒸汽！"},
                {"who":"ada", "text":"亲爱的， 我对你与George的重归于好感到高兴， 但你们两个不是应该在计划程序部分的设计吗？"},
                {"who":"charles", "text":"早就完成了！ George正在完善这个诗……或者应该说是要求。"},
                {"who":"ada", "text":"哦！ 我们必须赶紧完成最大值器， 然后就该去见我们的工程师了。\n\n这次输出两个输入中的较大值。"}
            ],
            [
                {"who":"charles", "text":"既然在George来之前还有时间， 我们应该花点时间让他的蒸汽容器更安全。 在压强未达到90 PSI之前， 容器都是安全的； 但一旦超过了这个值， 容器就有爆炸的危险。 我需要一个“蒸汽保险器”。 它允许蒸汽从西向东流动， 但一旦压强超过了90 PSI， 就立刻切断连接， 并排空容器。 记住要先断开蒸汽输入， 再把容器排空。"}
            ],
            [
                {"who":"charles", "text":"快来， George！ 我想我们有一些私事要谈！/n/n……"},
                {"who":"george", "text":"你真的这样认为吗， Charles？ Easley女士几乎都还不认识我。"},
                {"who":"charles", "text":"别总克制自己了老家伙！"},
                {"who":"george", "text":"好吧， 这还真是善解人意。 我需要一个每次循环会增加10 PSI的元件。 它从0 PSI开始， 在每个脉冲应增加10 PSI。 而要到达100 PSI时， 应重置回0 PSI。\n\n请谨慎考虑它的结构。"}
            ],
            [
                {"who":"george", "text":"Charles， 我非常感谢你能让我使用你写的诗。 这首诗完美地表达了我对Easley女士的感情。 它描述了她的美丽， 她的善良和她巧妙的锁存器设计。 我只需要把你的诗里的“高压蒸汽”换成“Easley女士”。"},
                {"who":"george", "text":"来看看Easley的十锁存器设计。 我们需要一个更简单但可能又更复杂的元件。 对于每个输入值范围， 我需要输出设定的压强值。 设定的值不需要更新。\n\n现在正好适合做一个自定义元件。 你可以在旧设计的基础上， 更改该元件的内部， 应用到其他设计里。"}
            ],
            [
                {"who":"george", "text":"我们快要成功了。 把这些部分连接起来就能重现我的诗了。 每次接受到蒸汽脉冲时， 它应读出下一个值。 这并不简单， 因为我们的计数器生成的序列是0，10，20，30…… 而我们的诗歌存储器需要的序列是5，15，25，35……"}
            ],
            [
                {"who":"charles", "text":"完美！ 可是我们还是不得不依靠这些可怕的Cogsworth时钟来提供定时脉冲。"},
                {"who":"nicola", "text":"Gertrude， 你还记得你是怎么拆除炸弹的吗？ 我们可以做一个同样精确的时钟。"},
                {"who":"charles", "text":"不管你怎么做， 我希望时钟的输出每刻翻转一次， 并且不会因为连接到什么上而发生改变。"}
            ],
            [
                {"who":"ada", "text":"你们两个在忙什么？"},
                {"who":"charles", "text":"George和我刚把一台最棒的诗歌朗诵器送给了Easley女士。 它被设置成会朗诵George对她的感情。\n\n只要有足够的调整， 就可以把这样的装置缩小到马的大小。"},
                {"who":"ada", "text":"听起来不错。 但我希望你们有翻转压强， 因为Annie记录的的代码都是相反的。"},
                {"who":"george", "text":"啥！？！ Nicola！ 我刚发送给她的信息是什么？"},
                {"who":"nicola", "text":"嗯……看起来你称赞了她华丽的胡须十分吸引人……请求得到她的淫秽蚀刻画……并指示她在黎明时攻击敌人。"},
                {"who":"george", "text":"...\n好的， 我回我的住处去喝瓶白兰地。"},
                {"who":"ada", "text":"Charles！ 去帮帮他!\n\n他们离开了， 但你们两个还可以来帮帮忙。 Charles本该在这堵墙上安装两根管道， 但现在只有一根。 我需要把南北两方和东西两方连接起来。 在新管道安装好之前有没有办法做到这一点？"},
                {"who":"nicola", "text":"我有个好主意。 幸好我们活在有时钟的世界里。"}
            ],
            [
                {"who":"annie", "text":"你好， Ada。 George在吗？ 我是来和他谈谈这台之前运到我家的机器的。"},
                {"who":"ada", "text":"哦， Annie！ 非常抱歉， 他和Charles都完全不知道代码本是有区别的。"},
                {"who":"annie", "text":"哦， 我当时很快就明白了。 按我的代码本解读这就只是一堆愚蠢的句子。"},
                {"who":"ada", "text":"Nicola！ 不管George和Charles到哪儿去了， 去把他们带来。"},
                {"who":"annie", "text":"他们制作的这个诗歌朗诵器真是个神奇的装置， 里面使用的元件都很巧妙。 Gertrude， 我想你也有参与计数器的建造。 你能调整一下设计， 加入设定当前值的方法吗？ 西输入会给出新值， 而北输入会选择是否使用新值。"}
            ],
            [
                {"who":"ada", "text":"安妮， 我不得不问， 你有没有觉得这一切越来越复杂了？"},
                {"who":"annie", "text":"我当然觉得， 但看看我们已经走了多远了。 还记得你花了一周的时间设计加法器吗？ 现在回想起来， 一切看起来都那么简单。 我们不仅在研究上取得了进展， 也对蒸汽有了更好的理解。"},
                {"who":"ada", "text":"那么也许你能帮我看看你的其中一个信息锁存器。 我不知道它出什么问题了， 所有来自Bechdel女士的信息都毫无意义。"},
                {"who":"annie", "text":"有趣。 定时脉冲似乎在值变得稳定之前就提前发出了。 如果能把脉冲延迟一点点， 就能解决问题了。 它需要在0到100 PSI之间快速转换。 让我们做点什么。"}
            ],
            [
                {"who":"annie", "text":"这个计量器显示的是什么？"},
                {"who":"ada", "text":"应该是通向Cogsworth钟表厂那儿的蒸汽压强。 为什么问这个？"},
                {"who":"annie", "text":"看， 它的变化模式有点奇怪。 而且今天是星期天， 他们不是应该休息了吗？\n\n它在一刻中跳到100 PSI， 下一刻跳到另一个值， 最后返回到0 PSI。"},
                {"who":"ada", "text":"这有点神秘。 我想试试能不能破译它。"}
            ],
            [
                {"who":"nicola", "text":"Chavvington女士！ 我搜遍了整个城市， 也找不到……"},
                {"who":"ada", "text":"我们知道他们在哪里！ George通过不断改变蒸汽开关给我们发送了信息。 他们被锁在了Cogsworth钟表厂的蒸汽房里。 我们现在就去那儿！"},
                {"who":"charles", "text":"[嘭][嘭][嘭]\n把我们救出来！ 房间里充满了高压蒸汽！ 我要被我爱的东西杀死了， 这可真是残酷的讽刺。"},
                {"who":"nicola", "text":"这扇门没法用钥匙打开了！ 看来有人朝门锁开过枪， 里面的管道破裂了！ 我对撬锁一无所知， 更别说是断了的锁。"}
            ],
            [
                {"who":"charles", "text":"Gertrude！ 我万分感激你！ 你不仅拯救了我们的生命，而且还是用高压蒸汽拯救的！"},
                {"who":"ada", "text":"亲爱的， 你怎么会陷入这种可怕的情况？"},
                {"who":"charles", "text":"George和我在那家古铜酒馆里喝了几杯， 然后一切都变得模糊不清了。 之后我记得的就是在这个房间里醒来， Cogsworth指控我们毁了他的生活。 被研究院开除后， 他的投资者也开始向他发难。 他只能压制住我们， 使他有足够的时间带上他的投资者的钱仓促逃离。\n\n快！ 去机场！ 我们不能让他逃跑。"},
                {"who":"george", "text":"这条管道从西向东输送起飞许可代码。 每组代码都有三个值， 每个值持续两刻。 一旦我们看到Cogsworth的代码27，39，31， 我们就会知道他正试图逃跑。"},
                {"who":"ada", "text":"到那时就太晚了， 他获得起飞许可后就会立刻逃脱了。 我们必须告诉机场经理不要让他离开。"},
                {"who":"george", "text":"唉， 经理早就被一台Cogsworth机器取代了。 他们早就对机器妥协了。\n\n我们不能让Cogsworth的代码通过， 但我们又不能破坏这根管道， 以免他发现我们在跟踪他。\n\n如果我们把信号延迟几秒， 并找到他的代码， 我们能把它删除吗？ 这将给我们争取逮捕他的时间。"}
            ],
            [
                {"who":"ada", "text":"终于， 科格斯沃斯坐牢后， 我们终于可以完成我们的蒸汽计算机了。\n\n所有元件都已就位。 我写了一个计算斐波那契数的程序， 但结果不太正确。\n\n我们需要对之前的元件进行改进， 直到计算机能够正常工作。 这可能需要花费大量时间来诊断问题并进行微调。"}
            ],
            [
                {"who":"charles", "text":"来自研究院的回复到了！\n\n“感谢您提交蒸汽计算机供研究院审查。 我们发现它大大扩展了我们在蒸汽计算方面的知识。 因此， 我们很高兴地通知您， 您的入会申请已获批准！”"},
                {"who":"nicola", "text":"祝贺你， Chavvington女士。"},
                {"who":"ada", "text":"实际上， 这并不是我的申请表， 而是代表Gertrude的。\n\nGertrude， 是你构造了所有的元件， 并向我们展示了如何通过操纵蒸汽得到奇妙的用途。 你才是能够教别人蒸汽计算的人。"},
                {"who":"charles", "text":"太棒了！\n\n让我们今天下午就来庆祝吧！"},
                {"who":"george", "text":"Easley女士？ 您愿意和我们一起参加这一活动吗？"},
                {"who":"annie", "text":"恐怕不行， 因为我今天下午将和一位风度翩翩的先生进行约会。"},
                {"who":"george", "text":"哦……"},
                {"who":"annie", "text":"那就是你， George。 Madingley大厅会提供下午茶， 我会欣然接受你的邀请的。"},
                {"who":"ada", "text":"感谢您游玩ComPressure！"}
            ]
        ],
        "hints":
        [
            [
                {"who":"charles", "text":"按住左键从起点到终点拖动以放置新管道。 新管道横跨旧管道时， 它们不会相互连接。 如果放置错误， 可以点击右键移除管道。"}
            ],
            [
                {"who":"charles", "text":"你可以通过元件页面放置一个蒸汽源。 蒸汽源提供100 PSI的蒸汽。 开口的管道会把压力释放到0 PSI。 在管道中间的某个地方开口， 就有可能在某个地方产生正确的压强。"}
            ],
            [
                {"who":"charles", "text":"元件页面也包含阀门元件。 将阀门的“+”端连接到北部， 就能够由北输入控制阀门的开度。 当北部处于高压时， 东部和西部应当可以直接连接。"}
            ],
            [
                {"who":"nicola", "text":"如果我没有理解错， 我们只需要将阀门的“+”端连接蒸汽源， 并将“-”端连接到南输入。 只有在南部处于低压时， 才会将东西部连接； 如果处于高压， 它就会关闭阀门。"}
            ],
            [
                {"who":"nicola", "text":"当输入高压时， 连接北部， 这就是“常开开关”的设计。 当输入低压时， 连接南方， 这就是“常闭开关”的设计。"}
            ],
            [
                {"who":"nicola", "text":"让我们从基础部分开始。 当输入较高时， 将输出连接到蒸汽源； 当输入较低时， 将输出连接到大气。 只需保持管道末端打开就能连接到大气。\n\n正如Chavvington女士所指出的， 阀门是给出的是模拟信号。 当数值在0到100之间时， 阀门会部分打开， 并可以生成准确的比率。"}
            ],
            [
                {"who":"nicola", "text":"这一次， 当输入较高时， 将输出连接到大气； 当输入较低时， 将输出连接到蒸汽源。 你可以选择阀门的另一端连接至蒸汽源或是大气。"}
            ],
            [
                {"who":"nicola", "text":"我们可以用阀门测量南北哪端压强高。 如果北方更高， 就将输出连接到蒸汽源； 如果南方更高， 将输出连接到大气。\n\n请记住， 输出管中的蒸汽不会自行排出， 需要使用阀门主动排放。"}
            ],
            [
                {"who":"nicola", "text":"我想我们已经有了一个比较器， 和一个精确的50源。"}
            ],
            [
                {"who":"nicola", "text":"当输入为100时， 我们希望输出为50， 所以应该将输出连接到50源； 当输入为0时， 应该将输出连接到大气。"}
            ],
            [
                {"who":"nicola", "text":"这听起来很像我们的缓冲器， 但当输入是50时， 输出应当是100。 所以压强到达50时， 排气阀应该关闭。 我猜应该把排气阀的“+”端换成50源。"}
            ],
            [
                {"who":"nicola", "text":"我不记得这里之前还有其他元件。 我认为只需要把它和输出连接起来就行。"}
            ],
            [
                {"who":"nicola", "text":"令输出通过加密器， 得出的结果应该和输入一样。\n\n当比较器上的两个输入相等时， 输出既不会导气， 也不会排气。 如果输出总是振荡， 应当回去调整比较器设计， 使它产生的输出不过于强大。"}
            ],
            [
                {"who":"nicola", "text":"可以使用与解密器一样的设计。 不断调整底部阀门的开度， 直到它们之间的压强正好为50。 鉴别器正好能实现这一点。"}
            ],
            [
                {"who":"nicola", "text":"令一个阀门的开度为西部输入减去南部输入， 然后令第二个阀门打开到相同的开度， 此时当它们之间的压强为50。"}
            ],
            [
                {"who":"nicola", "text":"这个有些难了。 使用减法器会带来太多的振动。\n\n如果用输出减去一个输入与另一个输入进行比较， 在第二个输入为0的情况下就会出错。 在这种情况下， 可以使用另一对阀门交换输入进行比较。 可以使用鉴别器来确保四个阀门之间的压强为50。\n\n点击设计目标面板可以看阀门配置。"}
            ],
            [
                {"who":"annie", "text":"当南部输入高压时， 打开存储管道。 可以使用缓冲器持续输出储存值。 而且在南部输入高压的时候必须关闭输出， 以免新的压强影响输出。 保证这一点的最简单方法是在输入阀和输出阀上使用50作为阈值。"}
            ],
            [
                {"who":"nicola", "text":"输出是由南输入控制的锁存器的值。 锁存器的输入是输出加上或减去西输入， 北输入在二者之间进行选择。 我们现在已经有加法器， 减法器和选择器了。"}
            ],
            [
                {"who":"nicola", "text":"这次我们反而需要振荡了。 将比较器连成环会使设计不稳定， 输出值会上下摆动。"}
            ],
            [
                {"who":"nicola", "text":"当西部高于南部时， 将输出连接到蒸汽源。 当西部低于北部时， 将输出连接到大气。"}
            ],
            [
                {"who":"nicola", "text":"可以把阀门串联起来。 只有所有的阀门都打开了，蒸汽才会通过。"}
            ],
            [
                {"who":"nicola", "text":"这与我们的普通锁存器没有太大区别， 只不过当北部输入低压时， 不要将脉冲与锁存器连接。"}
            ],
            [
                {"who":"nicola", "text":"北输入大于50时， 启用一个锁存器， 小于50时启用另一个。"}
            ],
            [
                {"who":"nicola", "text":"有这么多种选择信号！ 如果把一排流量探测器连在一起， 一端是蒸汽源， 另一端是大气呢？ 这样就能得到所需的所有范围了。"}
            ],
            [
                {"who":"nicola", "text":"可以使用两个五锁存器元件， 并在二者之间切换。 选择哪个五锁存器取决于选择信号是低于50还是高于50。 而且还需要将两个范围（0-50或50-100）缩放到五锁存器所需的范围（0-100）。\n\n放大器虽然很有用， 但在这种情况下， 它可能需要足够强大才不会出问题。 每一个放大器会连接到五个流量探测器， 并需要一段时间来给管道加压。 为了使设计更稳定， 我们可以直接复制放大器的内部结构。"}
            ],
            [
                {"who":"ada", "text":"它应该很简单， 只需要比较器和开关就行。"}
            ],
            [
                {"who":"ada", "text":"这不是和交换选择的最小值器一样吗？"}
            ],
            [
                {"who":"charles", "text":"可以使用很长的排气管形成90 PSI的压强值。 输入和90之间的比较器会告诉我们什么时候给容器排气。 比较器的输出从0 PSI上升到50 PSI时， 应该关闭输入； 而输出升至50 PSI以上后， 应通过阀门将容器内的蒸汽排放。"}
            ],
            [
                {"who":"george", "text":"可以利用加法器给输入增加固定的10 PSI， 然后使用锁存器捕获新值。 最后， 保险器将值重置为0 PSI。"}
            ],
            [
                {"who":"george", "text":"可以使用与十锁存器中相同的方法在10个值之间进行选择。 进行选择时， 每个值都需要自行制作并连接到输出。 这会涉及到许多自定义元件。"}
            ],
            [
                {"who":"george", "text":"可以将计数器连接到只读存储器， 但在那之前需要用加法器给它加5。"}
            ],
            [
                {"who":"nicola", "text":"如果做一个鉴别器的环， 并在某个地方加入一个翻转器， 就可以得到一个规则的振荡。 得到之后， 可以通过添加管道等来进行调整， 使它的频率低一点。"}
            ],
            [
                {"who":"nicola", "text":"可以用时钟可以在两个输入与两个输出之间进行同步选择。 因为不能够把两个输入都连接起来， 所以当我们选择其中一个输入时， 另一个输入应该是被封住的。 我们可以用50 PSI作为阈值。"}
            ],
            [
                {"who":"annie", "text":"我们可以修改计数器， 在里面插入一个开关， 选择使用新值或是递增值。"}
            ],
            [
                {"who":"annie", "text":"我们只需要延迟0 PSI和100 PSI的值。 一连串鉴别器可以延迟脉冲， 再进行一些微调即可。"}
            ],
            [
                {"who":"annie", "text":"延时器可以提供所需的定时脉冲。 一旦接收到延迟脉冲， 就可以捕捉值， 同时将延时器输入降为0 PSI。"}
            ],
            [
                {"who":"nicola", "text":"把那个洞用蒸汽源填上会更加容易。 制作蒸汽钥匙只需要复制锁内形成的压强值。"}
            ],
            [
                {"who":"george", "text":"需要三个锁存器延迟输入， 自定义延迟的时钟可以为它们计时。 为检测是否所有值都是对应的， 可以制作一个缓慢填充的管道， 且在锁存值不等于搜索值时排空管道。"}
            ],
            [
                {"who":"ada", "text":"花些时间理解一下蒸汽计算机是如何工作的。 一旦你理解了， 你就可以改善你的设计， 从而提升计算机的效果。"}
            ],
            [
                {"who":"ada", "text":"没有更多提示了。 享受你的胜利吧！"}
            ]
        ]
    },
    "Česky":
    {
        "tooltips":
        {
            "Save"                      :   "Uložit",
            "Restore"                   :   "Obnovit",
            "Best solution"             :   "Nejlepší řešení",
            "Customize"                 :   "Přizpůsobit",
            "Import level"              :   "Načíst úroveň",
            "Delete"                    :   "Smazat",
            "Copy design\nto current"   :   "Zkpírovat design\ndo současné úrovně",
            "Delete level"              :   "Smazat úroveň",
            "Return"                    :   "Návrat",
            "Level Editor"              :   "Editovat",
            "Level select"              :   "Úrovně",
            "Design"                    :   "Návrh",
            "Test"                      :   "Testování",
            "Experiment"                :   "Experimenty",
            "Scores"                    :   "Výsledky",
            "Help"                      :   "Dokumentace",
            "Repeat\ndialogue"          :   "Zopakovat\nrozhovor",
            "Hint"                      :   "Nápověda",
            "New design"                :   "Založit\nnovou úroveň",
            "Valve"                     :   "Ventil",
            "Steam Inlet"               :   "Přívod páry",
            "Rotate left"               :   "Otočit doleva",
            "Rotate right"              :   "Otočit doprava",
            "Reflect\nvertically"       :   "Překlopit\nsvisle",
            "Reflect\nhorizontally"     :   "Překlopit\nvodorovně",
            "Lock blocks"               :   "Uzamknout bloky",
            "Add sign"                  :   "Přidat komentář",
            "Stop tests"                :   "Zastavit testy",
            "Repeat 1 test"             :   "Opakovat jeden test",
            "Run all tests"             :   "Spustit všechny testy",
            "Export to\nclipboard"      :   "Uložt úroveň\ndo clipboardu",
            "Import from\nclipboard"    :   "Načíst úroveň\nz clipboardu",
            "Accuracy mode"             :   "Mód: přesnost",
            "Price mode"                :   "Mód: cena",
            "Steam mode"                :   "Mód: spotřeba páry",
            "Confirm"                   :   "Potvrdit",
            "Cancel"                    :   "Zrušit",
            "Exit"                      :   "Odejít",
            "Full Screen"               :   "Celá obrazovka",
            "Join our Discord group"    :   "Přidejte se k našemu Discordu",
            "Info"                      :   "Informace",
            "Select language"           :   "Vybrat jazyk",
            "If you are stuck, consider discussing your challenges with the brightest minds of our High Pressure Steam Society on Discord. Press Esc and click the \"Join our Discord group\" button." :
                                            "Pokud jste se vám nedaří, zkuste probrat své problémy s odborníky Spolku pro Vysokotlakou Páru na našem Discordu. Zmáčkněte Esc a klikněte na tlačítko \"Přidejte se k našemu Discordu\".",
            "Alas our journey must stop somewhere. The adventure continues\nin the full game.\n\nTo be continued..." :
                                            "Tento příběh zde prozatím končí. Naše dobrodružství ale pokračuje\nv plné verzi hry\n\nPokračování příště...",
            "Cross"                     :   "Cross",
            "50"                        :   "50",
            "Normally Open"             :   "Normally Open",
            "Normally Closed"           :   "Normally Closed",
            "Switch"                    :   "Switch",
            "Buffer"                    :   "Buffer",
            "Inverter"                  :   "Inverter",
            "Comparator"                :   "Comparator",
            "Amp50"                     :   "Amp50",
            "Div2"                      :   "Div2",
            "Mul2"                      :   "Mul2",
            "Encrypt"                   :   "Encrypt",
            "Decrypt"                   :   "Decrypt",
            "Sensor"                    :   "Sensor",
            "Subtractor"                :   "Subtractor",
            "Adder"                     :   "Adder",
            "Latch"                     :   "Latch",
            "Tabulator"                 :   "Tabulator",
            "Broken Link"               :   "Broken Link",
            "Zoom"                      :   "Zoom",
            "Flow Detector"             :   "Flow Detector",
            "LatchE"                    :   "LatchE",
            "Latch2"                    :   "Latch2",
            "Latch5"                    :   "Latch5",
            "Latch10"                   :   "Latch10",
            "Min"                       :   "Min",
            "Max"                       :   "Max",
            "Fuse"                      :   "Fuse",
            "Counter"                   :   "Counter",
            "ROM"                       :   "ROM",
            "Poem"                      :   "Poem",
            "Clock"                     :   "Clock",
            "Cross v2"                  :   "Cross v2",
            "CounterE"                  :   "CounterE",
            "Delay"                     :   "Delay",
            "Self-timed latch"          :   "Self-timed latch",
            "Lock Picking"              :   "Lock Picking",
            "Code filter"               :   "Code filter",
            "Steamputer"                :   "Steamputer",
            "END"                       :   "END",

        },
        "help":
        [
            "In the level select menu, the bottom panel describes the design requirements. Each design has four ports and the requirements state the expected output in terms of other ports. Each port has a colour identifier. Click on the requirements to receive a hint.",
            "Once you pass all the tests, the next design becomes available. You can always come back to refine your solution.\n\nPress the pipe button below to continue the tutorial. You can return to the help by pressing F1.",
            "Pipes can be laid down by either left mouse button dragging the pipe from the source to the destination, or by clicking left mouse button to extend the pipe in the direction of the mouse. Right click to cancel pipe laying mode.",
            "Hold the right mouse button to delete pipes and other elements.",
            "The build menu allows you to add components into your design. Select the steam inlet component and hover over your design. The arrow buttons change the orientation. This can also be done using keys Q and E or the mouse scroll wheel. Clicking the left mouse button will place the component. Right click to exit steam inlet placing mode.",
            "Valves can be placed in the same way. Pressing Tab, or middle mouse button, is a shortcut to enter valve placement mode. Pressing Tab, or middle mouse button, again switches to steam inlet placement.",
            "A steam inlet will supply steam at pressure 100. Any pipes with open ends will vent the steam to the atmosphere at pressure 0.",
            "Pressure at different points is visible on pipe connections. Note how each pipe has a little resistance.",
            "Valves allow steam to pass through them if the (+) side of the valve is at a higher pressure than the (-) side. The higher it is, the more the valve is open. Steam on the (+) and (-) sides is not consumed.\n\nHere, the (-) side is vented to atmosphere and thus at 0 pressure. With (+) at 100 PSI and (-) at 0 PSI, the valve is 100% open. If (+) is at 75 and (-) is at 25, the valve will be 50% open.",
            "If the pressure on the (+) side is equal or lower than the (-) side, the valve becomes closed and no steam will pass through.",
            "By pressurising (+) side with a steam inlet, the valve will become open only if the pressure on the (-) side is lower than 100 PSI.\n\nAs before, the openness of the valve is the pressure on the (+) side minus the pressture on the (-) side.",
            "Applying high pressure to the (-) side will close the valve as the pressure on the (-) side becomes equal or higher than the (+) side.",
            "The test menu allows you to inspect how well your design is performing. The first three buttons pause the testing, repeatedly run a single test and run all tests respectively. You can also use hotkeys 1, 2 and 3.\n\nThe current scores for individual tests are shown with the scores of best design seen below. On the right is the final score formed from the worst of all tests.",
            "The next panel shows the sequence of inputs and expected outputs for the current test. The current phase is highlighted. The output recorded on the last run is shown to the right. You can press Space to fast forward to the next phase.\n\nThe score is based on how close the output is to the target value. The graph shows the output value during the final stage of the test. The faded line in the graph shows the path of the best design so far.",
            "The experiment menu allows you to manually set the ports and examine your design's operation. The vertical sliders set the desired value. The horizontal sliders below set force of the input. Setting the slider all the way left makes it an output. Initial values are set from the current test.",
            "The graph at the bottom shows the history of the port values.",
            "Components can be selected by either clicking while holding Ctrl, or dragging while holding Shift. Selected components can be moved using WASD keys, or rotated using Q and E, if the destination is empty. Keys to copy and paste are: C for copy, X for cut and V for paste. To delete selected components, press Delete.\n\nUndo is reached through Z key (Ctrl is optional) and Redo through either Y or Shift+Z. Undo can also be triggered by holding right mouse button and clicking the left one.",
            "Pressing Esc shows the game menu. The buttons allow you to exit the game, switch between windowed and full screen, join our Discord group and show credits.\n\nThe sliders adjust the sound effects and music volumes.",
            "Completed designs are available for use as components. Available components are shown in the build menu. Changing a design will update its implementation in all components.\n\nDouble-clicking on the component allows you to inspect it. You can pop back up the stack by clicking the design icon in the top left. Pressing the customize button, while inspecting, creates a local design which can be edited and is no longer updated when the original is changed. The design will turn red to signify this.",
            "There are four slots to save designs. The best design is also saved so it can be recalled later. Designs can be exchanged using a clipboard string.\n\nClicking the score shows the global score graph, and your score compared to your friends. Their designs are available to be examined.",
            "One method of creating a specific pressure is by simultaneously supplying and venting a pipe at a specific ratio. A valve is as open as the pressure on the (+) side minus the pressure on the (-) side.\n\nOpenness = P - N\n\nWhere P is the pressure on the Positive side of the valve and N is the pressure on the Negative side. Here the lower valve openness is 40 (60 - 20).",
            "The pressure generated in this arrangement is, in percent, the openness of the source valve divided by the sum of the openness of both valves.\n\nPressure = S / (S + V)\n\nWhere S is Supply valve openness and V is Venting valve openness.\nIn this case, Supply is 40 (40 - 0). Venting is also 40 (60 - 20). The expected value between is 40 / (40 + 40) = 50%, thus 50 PSI.",
            "Three scoring modes are available. The default (Accuracy) mode scores the proximity to the target value (for the worst test).\n\nPrice mode ranks designs by cost. Pipes cost £1 per port, valves cost £10 and steam inlets cost £5. There is an extra £4 charge for each subdesign.\n\nSteam mode measures the amount of steam supplied by the steam inlets.",
            "It is possible to create user defined levels. These have a user defined icon, tests and can be exchanged through the clipboard.\nTests and test steps can be added/removed using the +/- buttons. The time period per step is configurable. If, when playing all tests, some steps can be skipped, the skip all button selects the subtest to start on. The design can be optionally reset on all or only in play one test mode. The port icons select which ports are used. Clicking the ports on the left of the value selects the ports used as the output. The values are changed in the experiment menu.",
        ],
        "dialogue":
        [
            [
                {"who":"charles", "text":"Greetings Gertrude! My name is Charles Chavvington, the proprietor of these General High Pressure Steam Works. From here we supply High Pressure Steam across half the city, powering everything from steam umbrellas to steam xylophones.\n\nMy dearly departed wife, Ada, stipulated that her research into the mathematical properties of steam should continue beyond her time with us. Which leads us to the reason for you coming into my employ. Your undertaking shall be to preserve her legacy and continue these scientific inquiries."},
                {"who":"charles", "text":"I trust you have mastered elementary steam engineering in your prior studies, but before we allow you access to her laboratory, you must first demonstrate you are adept at basic steam pipe construction.\n\nConnect the West generator to the East facilities, and the North generator to the South facilities. Under no circumstance should you connect the pipes together! Doing so will deliver free steam to the South facilities, and they never pay their bills on time!\n\nIf you are unfamiliar with our High Pressure Steam pipes, there is an engineering manual available up on the top right with the \"?\" symbol."}
            ],
            [
                {"who":"charles", "text":"Darn it! The secure door to Ada's laboratory is operated with low pressure steam! I could never figure out how she would get this blasted thing open.\n\nHere at General High Pressure Steam Works we generate steam at 100 Pounds per Square Inch. The door uses Moorhouse's low pressure steam which operates at 50 Pounds per Square Inch (PSI). I'll be damned if I pipe that degenerate Moorhouse steam onto my property!"},
                {"who":"charles", "text":"Unless you can magic up a supply of low pressure steam at 50 PSI, we might as well give up.\n\nIn the build menu, you will find a steam inlet which can supply you plenty of High Pressure Steam at 100 PSI. It is up there, marked with a spanner. You can also press Tab twice to get access to it."}
            ],
            [
                {"who":"charles", "text":"By Jove! You did it! Terrible waste of good steam, but it got the job done. I apologise for the untidy state, but some hoodlums have gained access and left a frightful mess.\n\nIn this laboratory, my dearest Ada conducted experiments on the valves I constructed to her exact specifications. By applying a good dose of High Pressure Steam to the port marked with a \"+\", we can open the valve, allowing steam to pass freely between the two unmarked ends.\n\nGive it a try. Connect West and East, but only when North is at a High Pressure."}
            ],
            [
                {"who":"nicola", "text":"Impressive!"},
                {"who":"charles", "text":"Ah, Nicola, you are just in time. Gertrude, Nicola will be your assistant. He has already begun studying the notes Ada left. Now, the next bit is a little more challenging for the old grey matter.\n\nWhile applying steam to the \"+\" port opens the valve, applying steam to the \"-\" side closes it. The valve is only open when \"+\" is under a Higher Pressure than the \"-\" side.\n\nAda asked me to add this so she could make a valve that closes upon application of High Pressure to the control pipe. Let's see if these valves still operate correctly.\n\n"},
                {"who":"charles", "text":"Connect the East and West, but only when the pressure coming from the South is lower than 100 PSI.\n\nYou can use the steam inlet as a source of good High Pressure Steam."}
            ],
            [
                {"who":"charles", "text":"Excellent! Now, combining these two designs, we can construct a component that switches between two sources.\n\nWhen the West control house supplies 100 PSI High Pressure Steam, the North generator should be connected to the East facilities. But when the West control house is at 0 PSI atmospheric pressure, the South generator should be connected to the East facilities."},
                {"who":"nicola", "text":"What happens when the control house supplies a pressure between 0 and 100?"},
                {"who":"charles", "text":"What!?! That would be low pressure steam! We do not work with low pressure steam! I did not make my fortune by supplying people with low pressure steam!\n\nNever mind all that low pressure nonsense. When West control is High Pressure, connect the North generator, otherwise connect the South generator."}
            ],
            [
                {"who":"nicola", "text":"Lady Chavvington's notes talk about a steam connection between the laboratory and Lady Easley's residence that was used for communication."},
                {"who":"charles", "text":"Yes, I had it removed. New procedures. Too much of our High Pressure Steam was going missing. The only steam permitted to leave our facility is metered and provided to paying customers. None of my High Pressure Steam may leave these walls."},
                {"who":"nicola", "text":"I think we can still establish a connection without delivering any steam out. According to these notes..."},
                {"who":"charles", "text":"Hah! Impossible! This is elementary steamology, my dear boy! Steam communication relies on the transfer of steam, and thou shalt not \"Transfer\" any of my steam out!\n\nIn any case, I am needed elsewhere. This matter does not appear as urgent as the investigations into my missing steam."},
                {"who":"nicola", "text":"According to Lady Chavvington, Charles was not known as the greatest listener. She describes the design in some detail."},
                {"who":"ada", "text":"June 5th\nI created a fantastic pressure replicating device today. To create a pressure of a specific value, I used valves, supplying and venting steam, at a precise ratio. By opening the steam valve to 80%, and opening the atmospheric venting valve to 20%, I could recreate the original pressure of 80 PSI. Charles's valves appear to open to the pressure on the \"+\" side, minus the pressure on the \"-\" side."},
                {"who":"ada", "text":"This appears to work for a whole range of values with the minimal of error. Due to its isolating properties I shall name it a \"buffer\".\n\nCommunication through pressure, rather than the flow of steam, offers wondrous possibilities as the value is not distorted by the resistance of long pipes. I explained the idea to Charles, although he was more consumed with matters of company profit."},
                {"who":"nicola", "text":"It appears some parts of the original design still remain installed in the wall. As long as we use Lady Easley's steam to power the devices beyond the wall, Charles will have no complaint."}
            ],
            [
                {"who":"nicola", "text":"Not perfect, but we can always come back and improve it. Fascinating, is it not? The combination of valves reproduces any pressure value. The incoming pressure opens the steam inlet and the atmosphere venting valves to the exact levels to correctly reproduce the pressure in the output pipe.\n\nLet us send our first message and visit Lady Easley to see if it works."},
                {"who":"annie", "text":"[Some time later]\nYou gave me such a scare! For a minute I thought it was Ada talking to me from beyond the grave."},
                {"who":"nicola", "text":"Our apologies Lady Easley. We are attempting to continue Lady Chavvington's research. We were trying to send 80 PSI which according to our codebook means \"Hello\""},
                {"who":"annie", "text":"No! 80 PSI means, \"Help! I am trapped in the afterlife!\". It is 20 PSI that means \"Hello\".\n\nWhen Ada installed the system she made a mistake on the valves and all the pressures were received upside down. It was when investigating the issue she got her epiphany on the possibilities of steam. We never fixed it, and instead I inverted all the pressure values in my codebook."},
                {"who":"nicola", "text":"Interesting. Perhaps we should see if we can make the same mistake."}
            ],
            [
                {"who":"charles", "text":"Drat! For the life of me I cannot find the pressure comparator Ada made. Every year, the highly prestigious High Pressure Steam Society compares the pressures provided by all the High Pressure Steam Works to determine the supplier of the Highest Pressure Steam. Without an accurate comparator, we will have to cancel this year's competition.\n\nMy five year winning record will be ruined! I am sure she had another one around here somewhere..."},
                {"who":"nicola", "text":"We should try and make it, otherwise he will just keep interfering..."},
                {"who":"charles", "text":"What was that you say, boy?"},
                {"who":"nicola", "text":"I said we could make one, sir."},
                {"who":"charles", "text":"Splendid! Just remember, it is not enough to connect the output to High Pressure Steam when one input is greater than the other, one must also vent the output when the opposite is true. My pipes are fully sealed and never leak steam unless a valve is opened to permit them to vent."}
            ],
            [
                {"who":"charles", "text":"Excellent! Such precision! I am sure it could detect the pressure of a feather on a cricket pitch.\n\nI need but one more device before I shall leave you to your investigations. In order to be admitted to the High Pressure Steam Society, one must show their steam works produce High Pressure Steam."},
                {"who":"charles", "text":"Here at General High Pressure Steam Works, we produce High Pressure Steam at 100 PSI, the only pressure I would recognise as true High Pressure Steam. But technically any steam pressure above 50 PSI is considered High Pressure Steam. As the chair of the High Pressure Steam society, it is my responsibility to make sure inferior low pressure steam producing deviants are not permitted to join.\n\nI require a device to correctly determine the quality of the applicant's steam."},
                {"who":"nicola", "text":"We still have your design for the 50 PSI steam generator in the tool box. We can use the designs we already made as components."}
            ],
            [
                {"who":"charles", "text":"Bravo! With this contraption I will keep those low pressure steam producers out of our exclusive society."},
                {"who":"nicola", "text":"How many members are there so far?"},
                {"who":"charles", "text":"Well... One... As I said \"Very Exclusive\".\n\nIn any case, I must be off lest I miss the reception drinks!"},
                {"who":"nicola", "text":"Finally...\n\nAccording to Lady Chavvington's diary, a second communication pipeline was installed leading to the residence of none other than Lord Moorhouse! Charles would not have been happy if he had found it. Look."},
                {"who":"ada", "text":"June 17th\n\nWith the pipeline to Lord Moorhouse's estate complete, I am beginning work on a device to compact the high range of pressure values (0-100), to ones acceptable by the low pressure system (0-50). To my complete surprise, when powered by Lord Moorhouse's low pressure steam, but still using 100 PSI as the reference input, the pressure buffer was able to scale the input pressure to precisely one half.\n\nThese properties could have wondrous uses in the field of mathematics."},
                {"who":"nicola", "text":"Really!?! How can that possibly work?"}
            ],
            [
                {"who":"nicola", "text":"Astonishing! Well, that got us half way there. We can send; but now we need to receive. We must amplify their steam pressure to our range. According to Lady Chavvington, we must power the device with our 100 PSI steam, but use 50 PSI as the reference pressure."}
            ],
            [
                {"who":"nicola", "text":"Let's see if this works.\n\n80 PSI [Hello]\n55 PSI [Request meeting]\n57 PSI [Afternoon tea at Madingley Hall]"},
                {"who":"george", "text":"...\n23 PSI [Negative]\n...\n6  PSI [6]\n12 PSI [/]\n7  PSI [7]"},
                {"who":"nicola", "text":"What?!? 6/7? Let me check the diary.\n...\nAll the entry for June 7th talks about is the design of the pressure inverter. How could he even communicate with us if the pressures were reversed? ... reversed ... reversed? ...  Of course!\n\nMy apologies. Too much time spent in the colonies. Here is the correct entry."},
                {"who":"ada", "text":"July 6th\n\nI suspect our communications have been compromised! After days of pleading, Lord Moorhouse agreed to combine our research efforts. We exchanged the codes to the doors of our respective laboratories over our steam communicator. Just hours later, a hand-delivered note was received at our residence informing me his laboratory has been ransacked and I was no longer welcome. I rushed to find mine had also been broken into! So much work lost."},
                {"who":"ada", "text":"I stored the code securely. Surely Charles would not have done such a thing. I immediately had the door on my laboratory replaced. Charles would rather die than operate a Moorhouse steam door."},
                {"who":"ada", "text":"I no longer feel safe here. I contacted my sister to expect my imminent arrival. It was a perfect time to test my new encryption system, which will keep our communications secure. I still have not received the sign Charles promised to put on the pipe that leads to her residence. He can be so forgetful at times."},
                {"who":"nicola", "text":"That was her last diary entry.\n\nOh dear! I didn't think that pipe was leading anywhere so I used the components for our other designs. Luckily some were welded down so I left them in place. The encryption unit seems mostly functional."}
            ],
            [
                {"who":"nicola", "text":"Well that was simple. The encryption is simply an unbalanced buffer. But how could you possibly make a design which accurately reverses such a cypher?\n\nPerhaps Lady Easley could help. I shall enquire if she is available to assist us.\n..."},
                {"who":"annie", "text":"Among Ada's papers, did you happen to find a napkin from the Madingley Hall tea rooms? I believe it was dated June 24th. We were discussing the new Royal Society paper on \"convergence in monotonic series\" when Ada began scribbling things down on a napkin. She then proceeded to run out exclaiming how she may have solved the decryption problem. Without settling the bill, I might add."},
                {"who":"ada", "text":"June 24th\nA decryption device can be formed by repeatedly guessing the value, encrypting it and comparing it to the encrypted input. Should the input be higher, we increase the guess. Should it be lower, we reduce it. Such a device could reverse numerous functions.\n\nCharles's steam comparator was just what I needed, although I must remember to return it to him before this year's high pressure steam society meeting."},
                {"who":"nicola", "text":"At least we know where his comparator got to."}
            ],
            [
                {"who":"nicola", "text":"Incredible! Using this technique we could improve the precision of all our designs. Lady Chavvington's sister must have more information about these techniques.\n\n80 PSI [Hello]"},
                {"who":"ada", "text":"80 PSI [Hello]\n93 PSI [This is Ada Chavvington]\n"},
                {"who":"nicola", "text":"60 PSI [Who?]\n73 PSI [Repeat]"},
                {"who":"ada", "text":"25 PSI [A], 28 PSI [D], 25 PSI [A]\n24 PSI [_]\n27 PSI [C], 32 PSI [H], 25 PSI [A], 46 PSI [V], 46 PSI [V], 33 PSI [I], 38 PSI [N], 31 PSI [G], 44 PSI [T], 39 PSI [O], 38 PSI [N]"},
                {"who":"nicola", "text":"This is unexpected. We must inform Lord Chavvington at once.\n...\nLord Chavvington! We established a link to Lady Chavvington's sister's residence, but the person at the other end claims to be Lady Chavvington herself!"},
                {"who":"charles", "text":"Ah, yes, that would be Ada."},
                {"who":"nicola", "text":"B... But Lord Chavvington, you said Ada had died."},
                {"who":"charles", "text":"What nonsense! Ada is perfectly fine and staying with her sister until we resolve this matter of the missing High Pressure Steam."},
                {"who":"nicola", "text":"You called her your \"dearly departed\"."},
                {"who":"charles", "text":"Yes... She has departed... To her sister's..."},
                {"who":"nicola", "text":"Everyone assumed she died..."},
                {"who":"charles", "text":"Hmm... Yes... On reflection, that would explain the flowers and cards expressing sympathy for my loss. I was touched by people's concern for the loss of my High Pressure Steam.\n\nNevertheless. The sooner you complete the steam calculation machine, the sooner we can get to the bottom of this. Continue the research post haste."},
                {"who":"ada", "text":"June 27th\nTogether with Lord Moorhouse such progress has been made in our research into steam computation. Our previous designs suffered from inaccuracies. Only when the valves were perfectly balanced and produced an output of 50, was the result perfect. With this I was struck with an idea.\n\nI could sense how open any valve is, by placing a second valve which vented the steam and adjusting its openness. Only when the two valves are equally open, will the pressure between them be precisely 50. All I had to do is to adjust the value until this was the case."},
                {"who":"ada", "text":"Using this, Lord Moorhouse was able to create a steam pressure adding component, which I hope he will reveal to me.\n\nLord Moorhouse is most shy yet smart as a whip, alas often he becomes too afraid to share his innovations."}
            ],
            [
                {"who":"nicola", "text":"Well it works. We can now sense how open a valve is, but I don't see how this gets us closer to steam computation. I suppose we must ask Lord Moorhouse."},
                {"who":"nicola", "text":"Lord Moorhouse. Thank you for allowing us to call upon you. In her absence, we are attempting to continue the steam computation work of Lady Chavvington. Only you know the construction of the pressure adding unit and we beg you share it with us."},
                {"who":"george", "text":"I do agree. Having thought on this, the advancement of knowledge must continue despite her collusion with Charles against me. I will disclose the secret of addition in exchange for the assurance that she is safe from him. Hearing the rumours that pass through these halls, I suspect her dead by his hand."},
                {"who":"nicola", "text":"Lady Chavvington is alive and well, staying with her sister."},
                {"who":"george", "text":"That is a relief. The idea of her spending any more time in that high pressure death trap keeps me up at night. If one of those high pressure tankers were to explode, perish the thought, the destruction would be immense. I would not rest until the world was rid of this high pressure horror...\n\nOh... Where was I? The addition design. Before you can make one, you must make one of subtraction. A valve is as open as the pressure on the (+) side minus the pressure on the (-) side. Once you create such a valve, you can then measure its openness."},
                {"who":"george", "text":"But now, you must leave. With Ada safe, I have an important task I must prepare for."}
            ],
            [
                {"who":"charles", "text":"I have brought the sign for the pipe that Ada asked for."},
                {"who":"nicola", "text":"That must have been months ago."},
                {"who":"charles", "text":"Yes, well, when a Chavvington says he will do something, it will get done. You don't have to remind him every month.\n\nCould you please send her a message from me?\n\n80, 94, 76, 52, 68, 70"},
                {"who":"nicola", "text":"I see you have learned the codes!"},
                {"who":"charles", "text":"Learned?!? I designed them! It was during my time in the military. A combination of the most frequent messages exchanged between captains.\n\nBe a good chap and send it off at once."},
                {"who":"nicola", "text":"80 PSI [Hello]\n94 PSI [This is Charles Chavvington]\n76 PSI [My sweetest angel]\n52 PSI [My heart yearns for you]\n68 PSI [I longingly await your return]\n70 PSI [Without you life has lost all meaning]"},
                {"who":"charles", "text":"Good, now, I see the subtractor design is complete. Excellent! As my dearly departed Ada once said..."},
                {"who":"nicola", "text":"Sir! You must stop using that phrase! People are beginning to think you a murderer..."},
                {"who":"charles", "text":"Hmm... Yes. As Ada..., who is no longer with us, once said, \"An adder is but an inversion of a subtractor. The output minus one of the inputs must be equal to the other input\". But which input?\n\nShe spent some time frustrated as the design would get stuck when that input was zero and switching the inputs just made the design stuck when the other input was zero. Her eureka moment came when she realised it needed to be a combination of both approaches."}
            ],
            [
                {"who":"annie", "text":"Why have you not been responding to my messages?"},
                {"who":"nicola", "text":"Our apologies Lady Easley, we did not know you had sent any."},
                {"who":"annie", "text":"They should be recorded on your message latches over here.\n...\n\nThey're missing! The latches must have been stolen by whoever broke into the laboratory. You should recreate them at once lest you miss any other important communications."},
                {"who":"annie", "text":"When a message is stable, a pulse of steam is sent on the timing pipe. This causes the latch to capture the value at that time. The latch will record the value, but will maintain the old value until the timing pipe has returned to a low pressure level.\n\nBecause these latches can be placed in sequence to record a series of messages, it is important that the new value is only released once the timing pipe has returned to low pressure."},
                {"who":"annie", "text":"I was always impressed about how well sealed Charles's valves are with a closed valve able to maintain the pressure within a pipe indefinitely.\n\nI do hope the design isn't lost, for I had such hopes for expanding it in a variety of ways."}
            ],
            [
                {"who":"charles", "text":"Great news everyone! Allow me to introduce Professor Joseph Cogsworth. One of, if not THE, brightest mind in all of the lands. His gear based tabulating machines have done wonders for our accounting department.\n\nHe has been aiding in our missing High Pressure Steam situation and has condescended to take an interest in Ada's work."},
                {"who":"joseph", "text":"Interesting to see how far you have come. I see you have reconstructed the latch to the same specification as Ada described in her notes."},
                {"who":"nicola", "text":"Those notes went missing during the break in. How did you know of them?"},
                {"who":"joseph", "text":"Ada was always a great admirer of my work. Although I thought her steam based approach to be crude and inaccurate, she would often seek my advice in hopes that it could be made adequate."},
                {"who":"charles", "text":"Once you complete the steam tabulator, we will be able to determine which of my accountants has been embezzling my High Pressure Steam.\n\nEach tabulator either adds, or subtracts a value from the current tally. The North connection selects between adding or subtracting and the South connection provides a timing pulse of High Pressure Steam.\n\nAda had to improve all her previous designs to increase the accuracy of all the used components. Work she never managed to complete."}
            ],
            [
                {"who":"charles", "text":"Very good, but alas too late, for Professor Cogsworth has already identified the guilty accountant."},
                {"who":"joseph", "text":"Indeed, but in return all I ask is to take possession of this crude attempt at a steam based tabulating device. Ada wished for me to be the custodian of all her research. Gertrude? Nicola? Your work here is done."},
                {"who":"ada", "text":"I hardly think so! Unlikely I would pass my work over to a man with both character and intellect of a parasitic wasp."},
                {"who":"joseph", "text":"Ada! I was under the impression you had died."},
                {"who":"ada", "text":"Charles! Apprehend this man, for he is the cause of all of this perturbation."},
                {"who":"charles", "text":"What!?! I hardly think a man of his stature would be involved in such petty crimes."},
                {"who":"george", "text":"It's true Charles. Joseph poisoned me against you with mistruths, manipulating us to detest one another. At first I collaborated with him due to his dislike of high pressure steam, but it was only later I realised his hatred of ALL steam!"},
                {"who":"charles", "text":"Is this true Joseph? You have no passion for High Pressure Steam?"},
                {"who":"joseph", "text":"Of course it is true! Ghastly substance. But to have me apprehended? For what? But you have no proof of any misdeeds."},
                {"who":"ada", "text":"Actually we do. Your gear tabulating machines have been removing tiny fractions from each transaction. It was only when we compared the results to the steam tabulator that we spotted these errors. All this so you could slowly syphon off high pressure steam. Were it not for Charles's sense of something being amiss, this would have never been spotted."},
                {"who":"joseph", "text":"Preposterous! What would I want with this revolting substance!"},
                {"who":"george", "text":"To slowly fill the pressure vessel you asked me to construct under the town hall."},
                {"who":"charles", "text":"What!?! But that's a low pressure vessel! Have you no idea of the consequences of filling it with High Pressure Steam!?!"},
                {"who":"joseph", "text":"The only consequences would be the world finally rejecting steam once and for all! It should be reserved for executions and only seen in museums. To think! Steam invading the offices and displacing my machines! For it is only gears that can produce a...\n\nWHAT!?! Let go of me! Unhand me, you wretched fools! You cannot do this to me! Wait until the Academy hears about this!"},
                {"who":"charles", "text":"The Academy certainly will hear about this!\n\nWell that's a satisfying conclusion to this matter. My High Pressure Steam is safe as is my dear Ada."},
                {"who":"ada", "text":"Actually darling, I think the story of steam computation is only just beginning."},
                {"who":"charles", "text":"Indeed. But, perhaps we should diffuse that steam bomb first."}
            ],
            [
                {"who":"ada", "text":"Thank you Gertrude. If not for your quick thinking, we would have had a disaster on our hands."},
                {"who":"george", "text":"I am also rather impressed. Ada, I cannot apologise enough for accusing you of ransacking my residence. Would it be possible for Gertrude and Nicola to aid me in my designs? I think their input will be highly constructive."},
                {"who":"ada", "text":"Speak no more of this, for I must be forgiven also. As a gesture of good will, feel free to use my... our laboratory. Lady Easley already has access. I do believe Charles and I need a bit of a break from all this commotion. We shall return in a few days and I already look forward to inspecting your discoveries."},
                {"who":"george", "text":"Thank you, and safe journey.\n\nNicola, could you find me that x2 pressure amplifier."},
                {"who":"nicola", "text":"It's right here.\n\nThe construction is simple, yet I find the operation stunningly useful."},
                {"who":"george", "text":"Indeed. Although this device amplifies values from a specific range of 0 to 50 to the range of 0 to 100. Given a minimum and maximum value, I do believe we can construct an amplifier which will zoom into any given range."},
                {"who":"nicola", "text":"We shall name it the Zoom element."},
                {"who":"george", "text":"Quite, although we should invent it first. The North can be our maximum and the South our minimum. The East output will tell us where the West input lies within the range."}
            ],
            [
                {"who":"george", "text":"Good, now we can zoom into any pressure range we choose. What I need next is a way of detecting if we are within a range. Take a look at this \"steam speedometer\".\n\nAda made it for Charles to measure the amount of steam passing through it. When steam passes through a long pipe, it will lose some pressure. The faster the steam is passing through, the more pressure it loses. If the two sides are at same pressure, there must be no moving steam. She even put some valves in the pipe to increase the resistance and make the difference greater."},
                {"who":"george", "text":"What I need is a way of telling if the West input reference is between the two pressures. It must be lower than the North, but higher than the South."}
            ],
            [
                {"who":"george", "text":"Now, by zooming into a range, I can tell more precisely how much steam someone is using, but I can also tell if I am within the range I am inspecting. I shall tell my customers to prepare for an extra decimal place on their next steam bills!"},
                {"who":"annie", "text":"Has all this research been to solely to aid your company profits? This is not what our agreement was."},
                {"who":"george", "text":"But Lady Easley! I made these for you. Believe me, these will be very useful components in the future."},
                {"who":"annie", "text":"I highly doubt that. I think it is time for some pure research.\n\nLet's go back to the Latch design Ada and I were working on. I wanted a latch which can be enabled or disabled. If the North input is high, the latch operates as normal, but if it is low, it should neither drive the output, nor accept a new input upon seeing a timing pulse. We can use the old design, although it may be more efficient to make a custom one."}
            ],
            [
                {"who":"annie", "text":"Now, the reason I wanted that design was to be able to construct an \"addressable latch\" where the North input selects between one of several latches. This way I could store several values and access each at will.\n\nLet's start with two. The North input selects between two latches. North value 0 to 50 will select one, and North value 50 to 100 will select the second."}
            ],
            [
                {"who":"annie", "text":"Exactly, unfortunately this is as far as we got. Next I wanted a latch that could store five values, but Ada and I could never fit it all into a single design. The select ranges would be 0-20, 20-40, 40-60, 60-80 and 80-100. Unfortunately detecting which of the ranges the select signal was in was too difficult."},
                {"who":"george", "text":"If only one had a range detecting design."},
                {"who":"annie", "text":"Your design detects flow, not a pressure range."},
                {"who":"george", "text":"Well, yes and no. It detects a pressure range of flowing steam. If placed in chain, and steam is passed through, they will detect a range of pressures."}
            ],
            [
                {"who":"annie", "text":"I admit, that flow detector was quite ingenious and was just the trick we needed. But now, how would we go about strapping two of these Latch5 block to make a Latch10?\n\nThe select ranges would be 0-10, 10-20, 20-30..."},
                {"who":"george", "text":"And this is why I asked for the zoom element to be designed. I have seen the genius in your ideas and have already planned ahead."}
            ],
            [
                {"who":"ada", "text":"Well, I am impressed. We had only been gone a couple days and you have created the storage part of the Steamputer."},
                {"who":"nicola", "text":"The what?"},
                {"who":"annie", "text":"All will be revealed in good time.\n\nWell, I think my job here is done! I managed to design the storage. I will leave you to investigate the calculations and control?"},
                {"who":"ada", "text":"Well let's start small. We need a component which gives us the smaller of the two input values. Should be simple enough."}
            ],
            [
                {"who":"charles", "text":"Ada! My darling! Try this exciting new beverage George introduced me to! It is called \"Froffee Coffee\". Taste it!"},
                {"who":"ada", "text":"Hmmm, yes it is rather ni..."},
                {"who":"charles", "text":"You know what would make it even better!?!"},
                {"who":"ada", "text":"High press..."},
                {"who":"charles", "text":"High Pressure Steam!"},
                {"who":"ada", "text":"Darling. I very much appreciate you have made amends with George, but were you two not supposed to be planning the programme elements?"},
                {"who":"charles", "text":"Already done! George is finalising the poem... or should I say requirements."},
                {"who":"ada", "text":"Oh! Well we must quickly create the Max component and then you can have access to our engineers.\n\nThe output this time must be the maximum of the two inputs."}
            ],
            [
                {"who":"charles", "text":"If we have some time before George comes, we should spend it making his pressure vessels safer. They are safe up to 90 PSI, but beyond that they are liable to explode. What I require is a \"steam fuse\". Allow the flow of steam from West to East, but once the pressure reaches beyond 90PSI, disconnect the supply and vent the vessel. Remember to disconnect the supply first, and only then vent the tank."}
            ],
            [
                {"who":"charles", "text":"Come George! I think we have some privacy!"},
                {"who":"george", "text":"Are you sure about this Charles? Lady Easley barely acknowledges my existence."},
                {"who":"charles", "text":"Stiff upper lip old chap!"},
                {"who":"george", "text":"Very well. This is somewhat of a sensitive matter. I require a device which increases by 10 PSI each cycle. It should start at 0 PSI and at each timing pulse should increase by 10 PSI. Instead of reaching 100 PSI, it should reset back to 0 PSI.\n\nPlease, do be discreet about its construction."}
            ],
            [
                {"who":"george", "text":"Charles, I cannot thank you enough for letting me use your poems. This one perfectly articulates my feelings for Lady Easley. It describes her beauty, her kindness and her ingenious latch designs. All I needed to do is replace the object of affection from your \"High Pressure Steam\" to my \"Lady Easley\"."},
                {"who":"george", "text":"Take a look at Easley's Latch10 design. We require something simpler, yet more complex. For each input value range, I need a specific pressure to be output. There is no need to ever update the values held.\n\nNow might be a good time to examine how to make custom components. You can use any old design as a basis and change the implementation for that instance."}
            ],
            [
                {"who":"george", "text":"We are nearly there. Let's connect these parts together so it will replay my poem. At every steam pulse, the next value should be read out. This won't be trivial as our counter goes through a sequence 0, 10, 20, 30... while our poem storage wants a sequence 5, 15, 25, 35..."}
            ],
            [
                {"who":"charles", "text":"Excellent stuff! It is just a shame we have to rely on these horrid Cogsworth clocks to provide the timing pulses."},
                {"who":"nicola", "text":"Gertrude, do you remember how you diffused that bomb? I think we can make a clock just as precise."},
                {"who":"charles", "text":"However you do it, I want it flip once every tick and I don't want it changing time depending on what it is connected to."}
            ],
            [
                {"who":"ada", "text":"What have you two been up to?"},
                {"who":"charles", "text":"George and I have just delivered a most marvellous poetry reciting machine to Lady Easley. It has been programmed to recite George's feelings towards her.\n\nWith sufficient refinement one could reduce such a device to the size of a horse."},
                {"who":"ada", "text":"That sounds lovely. Although I do hope you reversed the pressures as Annie's codes are all negated."},
                {"who":"george", "text":"WHAT!?! Nicola! What did I just send her?"},
                {"who":"nicola", "text":"Hmm... It appears you complemented her on her magnificent beard ... requested her lewd etchings ... and instructed her to attack the enemy at dawn."},
                {"who":"george", "text":"...\nOn that note, I shall return to my residence to spend some time with a bottle of brandy."},
                {"who":"ada", "text":"Charles! Go and help him!\n\nWhile they are gone, perhaps you two can help. Charles was supposed to install two pipes into this wall, but it only has one. I need North connected to South, and West to East. Is there any way we can do this without waiting for a new pipe to be installed?"},
                {"who":"nicola", "text":"Good thing we live in a clockwork universe because I think I have an idea."}
            ],
            [
                {"who":"annie", "text":"Hello Ada. Is George here? I have come to speak with him about this machine that has been delivered to my residence."},
                {"who":"ada", "text":"Oh Annie! I am so sorry. He and Charles were completely ignorant of the codebook differences."},
                {"who":"annie", "text":"Oh, I figured that out immediately. It would have made it such a silly farce otherwise."},
                {"who":"ada", "text":"Nicola! Go and fetch George and Charles, wherever they got to."},
                {"who":"annie", "text":"This poetry device they made is quite a marvellous contraption. The components used are ingenious. Gertrude? This counter. I assume you had a hand in its construction. Could you adapt the design to include a way of setting the value? The new value would come on the West port, and the North port will select whether to use the new value."}
            ],
            [
                {"who":"ada", "text":"I have to say Annie, do you not find all this rather complicated?"},
                {"who":"annie", "text":"I do, but look how far we have come. Remember the week you spent trying to get the adder to work? Looking back, it all looks so simple now. Not only has our research progressed, but I think we have such a better understanding of steam."},
                {"who":"ada", "text":"Then perhaps you could aid me in looking at one of your message latches. I can't figure out what's wrong. All the messages from Lady Bechdel come out as nonsense."},
                {"who":"annie", "text":"Interesting. It appears that the timing pulse arrives little too early, before the value has become stable. If I could delay the pulse by a little less than a tick, then that would fix it. It would need to have a very quick shift between 0 and 100 PSI. Let us make something."}
            ],
            [
                {"who":"annie", "text":"What does this gauge show?"},
                {"who":"ada", "text":"That would be the steam pressure going to the Cogsworth Clockworks. Why?"},
                {"who":"annie", "text":"Look. It is such a peculiar pattern. Also, are they not closed? It is a Sunday after all.\n\nIt jumps up to 100 PSI for one tick, then another value for another tick, before returning to 0 PSI."},
                {"who":"ada", "text":"That is intriguing. I wonder if we could decode it."}
            ],
            [
                {"who":"nicola", "text":"Lady Chavvington! I have searched all across the city and I have failed to locate..."},
                {"who":"ada", "text":"We know where they are! George managed to get a message through to us by turning an inlet on and off. They have been locked in the Cogsworth Clockworks steam room. Let us go there at once!"},
                {"who":"charles", "text":"[BANG] [BANG] [BANG]\nGet us out! The room is filling with High Pressure Steam! Oh, the cruel irony of being killed by the thing I love."},
                {"who":"nicola", "text":"The key that should open this door doesn't work! It appears someone has shot at the lock and ruptured a pipe inside! I know nothing of picking locks, let alone broken ones."}
            ],
            [
                {"who":"charles", "text":"Gertrude! I cannot thank you enough, not only for saving our lives, but also doing so using High Pressure Steam!"},
                {"who":"ada", "text":"Darling, how did you get into this dreadful situation?"},
                {"who":"charles", "text":"George and I were enjoying a couple drinks at the Old Brass tavern when things turned blurry. The next thing I remember is waking up in this room with Cogsworth accusing us of ruining his life. After being dismissed from the Academy, his investors began asking questions. His only choice was to silence us, giving him enough time to take his investors' money and beat a hasty retreat.\n\nQuick! To the aerodrome! We must not let him get away."},
                {"who":"george", "text":"This pipe carries launch codes from West to East. Each one is three codes long and transmitted at two ticks per code. Once we see Cogsworth's code of 27, 39, 31, we will know he is here and trying to get away."},
                {"who":"ada", "text":"Then it would be too late. By then he will have permission to launch and could get away. We must tell the aerodrome manager not to allow him to leave."},
                {"who":"george", "text":"Alas, the manager has been replaced with a Cogsworth machine. Likely a compromised one.\n\nWe must not allow Cogsworth's launch code to get through, yet we must not disrupt the aerodrome lest he discovers we are onto him.\n\nWhat if we delayed the signal by a few ticks and if we see it, we could remove it? This will give us time to locate and apprehend him."}
            ],
            [
                {"who":"ada", "text":"At last. With Cogsworth behind bars, we can finally complete our Steamputer.\n\nAll the parts are now in place. I have written what I shall name a \"programme\", to calculate Fibonacci numbers, but the results are incorrect.\n\nWe will need to refine the components until we get a functioning machine. There may be considerable time spent diagnosing the issues and fine tuning."}
            ],
            [
                {"who":"charles", "text":"It is here! The response from the Academy.\n\n\"We thank you for your submission of the Steamputer for review by the Academy of Sciences. We find it has considerably extended our knowledge in steam computation. Therefore we are pleased to say your application for membership has been approved!\""},
                {"who":"nicola", "text":"Congratulations Lady Chavvington."},
                {"who":"ada", "text":"Actually, the application was not for me. It was on Gertrude's behalf.\n\nGertrude, you were the one who constructed all these components and have shown us how to manipulate steam to wondrous uses. It is you who should be teaching others of the steam computation."},
                {"who":"charles", "text":"Huzzah!\n\nLet us celebrate this afternoon!"},
                {"who":"george", "text":"Lady Easley? Will you join us for the occasion?"},
                {"who":"annie", "text":"I am afraid I cannot, for I have an appointment this afternoon with a dashing gentleman."},
                {"who":"george", "text":"Oh."},
                {"who":"annie", "text":"That would be you George. Afternoon tea at Madingley Hall was offered and I graciously accept."},
                {"who":"ada", "text":"Thank you for playing ComPressure."}
            ]
        ],
        "hints":
        [
            [
                {"who":"charles", "text":"Click and hold the left mouse button to place a new pipe from the start point to the end. If you drag a new pipe over the old one, it will not connect them. If you get something wrong, you can remove the pipes using the right mouse button."}
            ],
            [
                {"who":"charles", "text":"The build menu lets you place a steam source which supplies steam at 100 PSI. An open ended pipe will release the pressure to 0. By tapping off a pipe somewhere in the middle, it may be possible to create a pressure somewhere in between."}
            ],
            [
                {"who":"charles", "text":"The build menu has the valve component. By connecting the \"+\" side of the valve to the North, it allows the North input to control how open the valve is. You can then simply connect East and West to connect the two when North is at High Pressure."}
            ],
            [
                {"who":"nicola", "text":"If I understand correctly, we need to connect the \"+\" port of the valve to a high pressure steam source, and the port marked \"-\" to the South input. This will connect East and West only when the South port pressure is low. If it is high, it will close the valve."}
            ],
            [
                {"who":"nicola", "text":"When the input is high, we connect the North. We know how to do that from the \"Normally Open\" design. And when the input is low, we connect the South. That's our \"Normally Closed\" design."}
            ],
            [
                {"who":"nicola", "text":"Well, let's start with the basics. When the input is high, we will connect the output to a steam source. When it is low, we will connect to the atmosphere. To connect to atmosphere, we simply leave the pipe end open.\n\nAs Lady Chavvington noted, the valves are analogue and it appears when values are between 0 and 100, the valves will partly open and recreate the exact ratio."}
            ],
            [
                {"who":"nicola", "text":"This time, when the input is high pressure, we want it to be connected to atmosphere. When the input is low is when we supply the steam. Our switch design was able to select between two values. Those values could be steam and atmosphere."}
            ],
            [
                {"who":"nicola", "text":"We can use valves to measure which of North and South is higher. If North is higher, we connect the output to steam. If South is higher, we connect it to atmosphere.\n\nRemember, the steam in the output pipe will not drain away by itself, we need to  actively release it using a valve."}
            ],
            [
                {"who":"nicola", "text":"I guess we already have a comparator, and we have a source of a precise value of 50."}
            ],
            [
                {"who":"nicola", "text":"When the input is 100, we want the output to be 50. So I guess we connect our 50 generator to the output using a valve. And when the input is 0, we vent the output to atmosphere."}
            ],
            [
                {"who":"nicola", "text":"This sounds like our buffer design again, but when the input is 50, we want the output to be 100. So the atmosphere venting valve should be closed once we reach 50. I guess, instead of using the 100 PSI on \"+\" side of the venting valve, we could switch it to 50. "}
            ],
            [
                {"who":"nicola", "text":"I don't remember there being any other components in this. I think we just need to connect what is there to the output."}
            ],
            [
                {"who":"nicola", "text":"If we pass the output through our encryption component, we can determine what the input must have been.\n\nWhen the two inputs on the comparator are equal, the output is neither pressurised, nor vented. If we get too much wobble, we should go back to our comparator design and make it less strong."}
            ],
            [
                {"who":"nicola", "text":"We can use the same trick as in our decrypt design. We increase or decrease the amount we open the bottom valve until the pressure between them is exactly 50. We have an Amp50 which does this."}
            ],
            [
                {"who":"nicola", "text":"We open one valve to the value of the West input minus the South input, we can then open a second valve to the same level of openness by looking for when the pressure between them is 50."}
            ],
            [
                {"who":"nicola", "text":"This one is somewhat harder. Using a subtractor gives us too much wobble.\n\nComparing the output minus one of the inputs to the other input fails if the second input is 0 and the valve is fully closed. But in that case we can use a second valve pair to do the same comparison and switching the inputs. We can then use an Amp50 to make sure the pressure between the four valves is 50 PSI.\n\nClick the requirements for a diagram of this setup."}
            ],
            [
                {"who":"annie", "text":"When the South input is high, we open our storage pipe. We can the use a buffer to pressurize the output to the same level as we captured. We have to close off the output while the South input is high so as to not let the new pressure propagate through. The easiest way to guarantee this is to use threshold of 50 on the timing and output valves."}
            ],
            [
                {"who":"nicola", "text":"The output is the value of a latch controlled by the South input. The input to the latch is either the latch output plus or minus the West input. The North input selects between them. We have an adder, a subtractor and a switch."}
            ],
            [
                {"who":"nicola", "text":"For a change a wobble is actually desirable. Amplifiers in a ring configuration will make the design unstable and will wobble up and down."}
            ],
            [
                {"who":"nicola", "text":"When West is higher than South, start adding more steam. When West is lower than North, start releasing more steam."}
            ],
            [
                {"who":"nicola", "text":"You can put valves in series. Only if all the valves are open will steam flow through."}
            ],
            [
                {"who":"nicola", "text":"This is not much different than our normal latch design, except the output and the timing pulse are not connected when the North input is low."}
            ],
            [
                {"who":"nicola", "text":"If the North select input is higher than 50, we enable one latch, otherwise we enable the other."}
            ],
            [
                {"who":"nicola", "text":"We need so many select signals! What if we chain a row of flow detectors with steam inlet at one end and atmosphere at the other? This would give us all the values we need to create."}
            ],
            [
                {"who":"nicola", "text":"We can use two Latch5 elements and switch between them depending if the select is below or above 50. But then we would need to scale the select from one of the two ranges (0 - 50, or 50 - 100) to the range the Latch5 design takes (0 - 100).\n\nI guess that Zoom element is useful after all, but in this instance it may need to be quite powerful. Each zoom would be connected to five flow detectors, and it will take it a while to pressurize all those pipes. To make a design stronger, we could simply duplicate it."}
            ],
            [
                {"who":"ada", "text":"It should be as easy as a comparator and a switch."}
            ],
            [
                {"who":"ada", "text":"Is this not just the same as our Min component but selecting the other way round?"}
            ],
            [
                {"who":"charles", "text":"We can form a value of 90 PSI using a long pipe venting pipe. A comparator between that and out input will tell us when to vent the vessel. As our comparator pressure rises from 0 PSI to 50 PSI, it should close off the input. Once it rises above 50 PSI it should open a valve to release the content of the vessel to the atmosphere."}
            ],
            [
                {"who":"george", "text":"We can use an adder with a static 10 PSI on one input. Then use a latch to capture the new value. Finally a Fuse in the loop will reset the counter to 0 PSI."}
            ],
            [
                {"who":"george", "text":"We can use the same method we used in the Latch10 design to select between ten values. Each value will need to be custom made and connected to the output when selected. This involves several custom designs."}
            ],
            [
                {"who":"george", "text":"We can connect our counter to the ROM, but first we will need to add 5 using an adder."}
            ],
            [
                {"who":"nicola", "text":"If we form a ring of Amp50 components with an inversion somewhere, we can get a regular beat. Once we get it close, we can tune it by adding pipe elements to slow it down a little."}
            ],
            [
                {"who":"nicola", "text":"A clock can select between the two inputs and on the other side of the wall, a synchronised clock can select between the outputs. Although we should not connect both inputs. By the time we open one, the second should be sealed off. We can use a 50 PSI as a reference."}
            ],
            [
                {"who":"annie", "text":"We can amend the counter to insert a switch to select between a new value or the incremented one."}
            ],
            [
                {"who":"annie", "text":"We only need to delay values of 0 PSI and 100 PSI. A chain of Amp50 elements will delay the pulse, with some minor tuning."}
            ],
            [
                {"who":"annie", "text":"A delay element will give us the timing pulse we need. Once we see the delayed pulse, we can capture the value, but also force the delay input to 0 PSI."}
            ],
            [
                {"who":"nicola", "text":"Instead of just plugging the hole, we could attach it to 100 PSI. That would make it easier. To make a steam key, one can replicate the pressures that are formed inside the lock."}
            ],
            [
                {"who":"george", "text":"We need three latches to delay the input sufficiently. A clock generator with a custom additional delay can clock them. To detect if all values are correct, a pipe can be slowly filled and if any latch value is either greater or less than the searched value, it can vent the pipe."}
            ],
            [
                {"who":"ada", "text":"Take your time and understand how the machine works. Once you do, you can improve your designs so they improve the operation of the Steamputer."}
            ],
            [
                {"who":"ada", "text":"No more hints. Enjoy your win."}
            ]
        ]
    },
    "Deutsch":
    {
        "tooltips":
        {
            "Save"                      : "Speichern",
            "Restore"                   : "Wiederherstellen",
            "Best solution"             : "Beste Lösung",
            "Customize"                 : "Anpassen",
            "Import level"              : "Importstufe",
            "Delete"                    : "Löschen",
            "Copy design\nto current"   : "Entwurf auf Strom kopieren",
            "Delete level"              : "Ebene löschen",
            "Return"                    : "Rückgabe",
            "Level Editor"              : "Level Editor",
            "Level select"              : "Level select",
            "Design"                    : "Design",
            "Test"                      : "Test",
            "Experiment"                : "Experiment",
            "Scores"                    : "Spielstände",
            "Help"                      : "Hilfe",
            "Repeat\ndialogue"          : "Repeat\ndialogue",
            "Hint"                      : "Hinweis",
            "New design"                : "Neues Design",
            "Valve"                     : "Ventil",
            "Steam Inlet"               : "Dampfeinlass",
            "Rotate left"               : "Drehen nach links",
            "Rotate right"              : "Drehen nach rechts",
            "Reflect\nvertically"       : "Reflect\nvertical",
            "Reflect\nhorizontally"     : "Reflect\nhorizontal",
            "Lock blocks"               : "Blöcke sperren",
            "Add sign"                  : "Vorzeichen hinzufügen",
            "Stop tests"                : "Tests anhalten",
            "Repeat 1 test"             : "1 Test wiederholen",
            "Run all tests"             : "Alle Tests ausführen",
            "Export to\nclipboard"      : "Exportieren nach\nclipboard",
            "Import from\nclipboard"    : "Importieren von\nclipboard",
            "Accuracy mode"             : "Genauigkeitsmodus",
            "Price mode"                : "Preismodus",
            "Steam mode"                : "Dampfmodus",
            "Confirm"                   : "Bestätigen",
            "Cancel"                    : "Abbrechen",
            "Exit"                      : "Beenden",
            "Full Screen"               : "Vollbild",
            "Join our Discord group"    : "Treten Sie unserer Discord-Gruppe bei",
            "Info"                      : "Info",
            "Select language"           : "Sprache auswählen",
            "If you are stuck, consider discussing your challenges with the brightest minds of our High Pressure Steam Society on Discord. Press Esc and click the \"Join our Discord group\" button." :
                                            "Wenn Sie nicht weiterkommen, können Sie Ihre Herausforderungen mit den klügsten Köpfen unserer High Pressure Steam Society auf Discord besprechen. Drücken Sie Esc und klicken Sie auf die Schaltfläche \"Join our Discord group\".",
            "Alas our journey must stop somewhere. The adventure continues\nin the full game.\n\nTo be continued..." :
                                            "Leider muss unsere Reise irgendwo enden. Das Abenteuer geht im vollständigen Spiel weiter.\n\nTo be continued...",
            "Cross"                     : "Kreuz",
            "50"                        :  "50",
            "Normally Open"             : "Normalerweise offen",
            "Normally Closed"           : "Normalerweise geschlossen",
            "Switch"                    : "Schalter",
            "Buffer"                    : "Puffer",
            "Inverter"                  : "Wechselrichter",
            "Comparator"                : "Vergleicher",
            "Amp50"                     : "Amp50",
            "Div2"                      : "Div2",
            "Mul2"                      : "Mul2",
            "Encrypt"                   : "Verschlüsseln",
            "Decrypt"                   : "Entschlüsseln",
            "Sensor"                    : "Sensor",
            "Subtractor"                : "Subtraktor",
            "Adder"                     : "Adder",
            "Latch"                     : "Verriegelung",
            "Tabulator"                 : "Tabulator",
            "Broken Link"               : "Defekter Link",
            "Zoom"                      : "Zoom",
            "Flow Detector"             : "Durchflussdetektor",
            "LatchE"                    : "LatchE",
            "Latch2"                    : "Latch2",
            "Latch5"                    : "Latch5",
            "Latch10"                   : "Latch10",
            "Min"                       : "Min",
            "Max"                       : "Max",
            "Fuse"                      : "Fuse",
            "Counter"                   : "Zähler",
            "ROM"                       : "ROM",
            "Poem"                      : "Gedicht",
            "Clock"                     : "Uhr",
            "Cross v2"                  : "Kreuz v2",
            "CounterE"                  : "ZählerE",
            "Delay"                     : "Verzögerung",
            "Self-timed latch"          : "Selbsttätige Verriegelung",
            "Lock Picking"              : "Lock Picking",
            "Code filter"               : "Code-Filter",
            "Steamputer"                : "Steamputer",
            "END"                       : "ENDE"
        },
        "help":
        [
            "Im Menü \"Level Select\"beschreibt das untere Feld die Anforderungen an den Entwurf. Jeder Entwurf hat vier Anschlüsse und die Anforderungen geben den erwarteten Ausgang in Bezug auf andere Anschlüsse an. Jeder Anschluss hat eine farbliche Kennzeichnung. Klicken Sie auf die Anforderungen, um einen Hinweis zu erhalten.",
            "Sobald Sie alle Tests bestanden haben, wird der nächste Entwurf verfügbar. Sie können jederzeit zurückkommen, um Ihre Lösung zu verfeinern.\n\nDrücken Sie die Pfeiltaste unten, um das Lernprogramm fortzusetzen. Sie können zur Hilfe zurückkehren, indem Sie F1 drücken.",
            "Rohre können verlegt werden, indem Sie entweder mit der linken Maustaste das Rohr von der Quelle zum Ziel ziehen, oder indem Sie mit der linken Maustaste das Rohr in Mausrichtung verlängern. Mit der rechten Maustaste können Sie den Rohrverlegemodus abbrechen.",
            "Halten Sie die rechte Maustaste gedrückt, um Rohre und andere Elemente zu löschen.",
            "Im Menü \"Build\" können Sie Komponenten zu Ihrer Konstruktion hinzufügen. Wählen Sie die Komponente \"Dampfeinlass\" und bewegen Sie den Mauszeiger über Ihren Entwurf. Mit den Pfeiltasten können Sie die Ausrichtung ändern. Dies kann auch mit den Tasten Q und E oder dem Scrollrad der Maus geschehen. Klicken Sie mit der linken Maustaste, um die Komponente zu platzieren. Klicken Sie mit der rechten Maustaste, um den Modus zum Platzieren des Dampfeinlasses zu verlassen.",
            "Ventile können auf die gleiche Weise platziert werden. Durch Drücken der Tabulatortaste oder der mittleren Maustaste gelangen Sie in den Modus für die Ventilplatzierung. Erneutes Drücken der Tabulatortaste oder der mittleren Maustaste schaltet auf die Platzierung des Dampfeinlasses um.",
            "Ein Dampfeinlass liefert Dampf mit einem Druck von 100. Alle Rohre mit offenen Enden entlüften den Dampf bei Druck 0 in die Atmosphäre.",
            "An Rohrverbindungen ist der Druck an verschiedenen Stellen sichtbar. Beachten Sie, wie jedes Rohr einen kleinen Widerstand hat.",
            "Ventile lassen Dampf durch, wenn auf der (+)-Seite des Ventils ein höherer Druck herrscht als auf der (-)-Seite. Je höher er ist, desto mehr ist das Ventil geöffnet. Dampf auf der (+)- und (-)-Seite wird nicht verbraucht.\n\nHier ist die (-)-Seite zur Atmosphäre entlüftet und somit auf 0 Druck. Wenn (+) bei 100 PSI und (-) bei 0 PSI liegt, ist das Ventil zu 100 % geöffnet. Wenn (+) auf 75 und (-) auf 25 steht, ist das Ventil zu 50 % geöffnet.",
            "Wenn der Druck auf der (+)-Seite gleich oder niedriger ist als auf der (-)-Seite, wird das Ventil geschlossen und es wird kein Dampf durchgelassen.",
            "Durch Druckbeaufschlagung der (+)-Seite mit einem Dampfeinlass wird das Ventil nur dann geöffnet, wenn der Druck auf der (-)-Seite niedriger als 100 PSI ist. Wie zuvor ergibt sich die Offenheit des Ventils aus dem Druck auf der (+)-Seite minus dem Druck auf der (-)-Seite.",
            "Durch Anlegen eines hohen Drucks an die (-)-Seite wird das Ventil geschlossen, da der Druck auf der (-)-Seite gleich oder höher als auf der (+)-Seite wird.",
            "Im Testmenü können Sie überprüfen, wie gut Ihr Entwurf funktioniert. Mit den ersten drei Tasten können Sie den Test anhalten, einen einzelnen Test wiederholt ausführen bzw. alle Tests ausführen. Sie können auch die Hotkeys 1, 2 und 3 verwenden.\n\nDie aktuellen Punktzahlen für die einzelnen Tests werden angezeigt, wobei unten die Punktzahl des besten Designs zu sehen ist. Rechts steht die Endnote, die aus den schlechtesten aller Tests gebildet wird.",
            "Die nächste Tafel zeigt die Abfolge der Eingänge und erwarteten Ausgänge für den aktuellen Test. Die aktuelle Phase ist hervorgehoben. Die beim letzten Durchlauf aufgezeichnete Ausgabe wird auf der rechten Seite angezeigt. Sie können die Leertaste drücken, um schnell zur nächsten Phase vorzuspringen.\n\nDie Bewertung basiert darauf, wie nahe die Ausgabe am Zielwert liegt. Das Diagramm zeigt den Ausgangswert während der letzten Phase des Tests. Die verblasste Linie im Diagramm zeigt den Weg des bisher besten Entwurfs an.",
            "Im Experimentiermenü können Sie die Anschlüsse manuell einstellen und die Funktionsweise Ihres Entwurfs untersuchen. Die vertikalen Schieberegler stellen den gewünschten Wert ein. Die horizontalen Schieberegler darunter stellen die Kraft des Eingangs ein. Wenn Sie den Schieberegler ganz nach links stellen, wird er zu einem Ausgang. Die Anfangswerte werden vom aktuellen Test eingestellt.",
            "Die Grafik am unteren Rand zeigt den Verlauf der Portwerte",
            "Komponenten können entweder durch Klicken bei gedrückter Strg-Taste oder durch Ziehen bei gedrückter Umschalttaste ausgewählt werden. Ausgewählte Komponenten können mit den WASD-Tasten verschoben oder mit Q und E gedreht werden, wenn das Ziel leer ist. Die Tasten zum Kopieren und Einfügen sind: C für Kopieren, X für Ausschneiden und V für Einfügen. Zum Löschen ausgewählter Komponenten drücken Sie die Entf-Taste.\n\nRückgängig wird über die Taste Z erreicht (Strg ist optional) und Wiederherstellen entweder über Y oder Umschalt+Z. Rückgängig kann auch durch Halten der rechten Maustaste und Klicken der linken ausgelöst werden.",
            "Durch Drücken von Esc wird das Spielmenü angezeigt. Mit den Schaltflächen können Sie das Spiel beenden, zwischen Fenster- und Vollbildmodus umschalten, unserer Discord-Gruppe beitreten und die Credits anzeigen.\n\nDie Schieberegler passen die Soundeffekte und die Musiklautstärke an.",
            "Fertige Konstruktionen stehen zur Verwendung als Komponenten zur Verfügung. Verfügbare Komponenten werden im Erstellungsmenü angezeigt. Wenn Sie einen Entwurf ändern, wird seine Implementierung in allen Komponenten aktualisiert.\n\nDurch Doppelklicken auf die Komponente können Sie sie inspizieren. Sie können den Stapel wieder aufklappen, indem Sie auf das Design-Symbol oben links klicken. Wenn Sie während der Inspektion auf die Schaltfläche \"Anpassen\" klicken, wird ein lokaler Entwurf erstellt, der bearbeitet werden kann und nicht mehr aktualisiert wird, wenn das Original geändert wird. Der Entwurf wird rot, um dies zu signalisieren.",
            "Es gibt vier Steckplätze zum Speichern von Designs. Das beste Design wird ebenfalls gespeichert, so dass es später abgerufen werden kann. Designs können über eine Zeichenfolge in der Zwischenablage ausgetauscht werden.\n\nKlicken Sie auf den Punktestand, um die globale Punktegrafik und Ihren Punktestand im Vergleich zu Ihren Freunden anzuzeigen. Deren Designs können eingesehen werden.",
            "Eine Methode, einen bestimmten Druck zu erzeugen, ist das gleichzeitige Be- und Entlüften einer Leitung in einem bestimmten Verhältnis. Ein Ventil ist so offen wie der Druck auf der (+) Seite minus dem Druck auf der (-) Seite.\n\nOpenness = P - N\n\nWobei P der Druck auf der positiven Seite des Ventils und N der Druck auf der negativen Seite ist. Hier ist die untere Ventilöffnung 40 (60 - 20).",
            "Der in dieser Anordnung erzeugte Druck ist in Prozent die Offenheit des Quellventils geteilt durch die Summe der Offenheit beider Ventile.\n\nDruck = S / (S + V)\n\n Wobei S die Offenheit des Versorgungsventils und V die Offenheit des Entlüftungsventils ist.\n In diesem Fall ist die Versorgung 40 (40 - 0). Die Entlüftung ist ebenfalls 40 (60 - 20). Der erwartete Wert dazwischen ist 40 / (40 + 40) = 50%, also 50 PSI.",
            "Es sind drei Bewertungsmodi verfügbar. Der Standardmodus (Genauigkeit) bewertet die Nähe zum Zielwert (für den schlechtesten Test).\n\nDer Preismodus ordnet Designs nach Kosten. Rohre kosten £1 pro Anschluss, Ventile kosten £10 und Dampfeinlässe kosten £5. Für jede Unterkonstruktion wird eine zusätzliche Gebühr von 4 £ erhoben.\n\nDer Dampfmodus misst die von den Dampfeinlässen gelieferte Dampfmenge.",
            "Es ist möglich, benutzerdefinierte Ebenen zu erstellen. Diese haben ein benutzerdefiniertes Symbol, Tests und können über die Zwischenablage ausgetauscht werden.\nTests und Testschritte können über die +/- Tasten hinzugefügt/entfernt werden. Die Zeitspanne pro Schritt ist konfigurierbar. Wenn beim Abspielen aller Tests einige Schritte übersprungen werden können, wählt die Schaltfläche \"Alle überspringen\" den Untertest aus, mit dem begonnen werden soll. Der Entwurf kann wahlweise auf alle oder nur im Modus \"Play one test\" zurückgesetzt werden. Die Port-Symbole wählen aus, welche Ports verwendet werden. Durch Anklicken der Ports links neben dem Wert werden die verwendeten Ports als Ausgang ausgewählt. Die Werte werden im Menü \"Experiment\" geändert."
        ],
        "dialogue":
        [
            [
                {"who": "charles", "text": "Grüße Gertrude! Mein Name ist Charles Chavvington, der Besitzer dieser allgemeinen Hochdruck-Dampfanlage. Von hier aus versorgen wir die halbe Stadt mit Hochdruckdampf, der alles von Dampfregenschirmen bis zu Dampfxylophonen antreibt. Meine teure verstorbene Frau Ada hat verfügt, dass ihre Forschungen über die mathematischen Eigenschaften von Dampf über ihre Zeit bei uns hinaus fortgesetzt werden sollten. Was uns zu dem Grund führt, warum Sie bei mir angestellt sind. Ihre Aufgabe soll es sein, ihr Vermächtnis zu bewahren und diese wissenschaftlichen Forschungen fortzuführen."},
                {"who": "charles", "text": "Ich vertraue darauf, dass Sie die elementare Dampftechnik in Ihrem vorherigen Studium gemeistert haben, aber bevor wir Ihnen den Zugang zu ihrem Labor gestatten, müssen Sie zuerst beweisen, dass Sie den grundlegenden Bau von Dampfleitungen beherrschen.\n\nVerbinden Sie den West-Generator mit den Ost-Anlagen und den Nord-Generator mit den Süd-Anlagen. Verbinden Sie auf keinen Fall die Rohre miteinander! Dadurch erhalten die südlichen Anlagen kostenlosen Dampf, und sie bezahlen ihre Rechnungen nie pünktlich!"},
                {"who": "charles", "text": "Wenn Sie mit unseren Hochdruck-Dampfrohren nicht vertraut sind, finden Sie oben rechts mit dem Symbol \"?\" eine technische Anleitung."}
            ],
            [
                {"who": "charles", "text": "Verflixt noch mal! Die Sicherheitstür zu Adas Labor wird mit Niederdruckdampf betrieben! Ich konnte nie herausfinden, wie sie dieses verflixte Ding aufbekommen hat.\n\nHier bei General High Pressure Steam Works erzeugen wir Dampf mit 100 Pfund pro Quadratzoll. Die Tür verwendet den Niederdruckdampf von Moorhouse, der mit 50 Pfund pro Quadratzoll (PSI) arbeitet. Ich will verdammt sein, wenn ich diesen degenerierten Moorhouse-Dampf auf mein Grundstück leite!"},
                {"who": "charles", "text": "Wenn Sie nicht eine Versorgung mit Niederdruckdampf bei 50 PSI herbeizaubern können, können wir genauso gut aufgeben.\n\n Im Baumenü finden Sie einen Dampfeinlass, der Sie mit reichlich Hochdruckdampf bei 100 PSI versorgen kann. Er befindet sich dort oben und ist mit einem Schraubenschlüssel markiert. Sie können auch zweimal die Tabulatortaste drücken, um Zugriff darauf zu erhalten."}
            ],
            [
                {"who": "charles", "text": "Meine Güte! Du hast es geschafft! Schreckliche Verschwendung von gutem Dampf, aber es hat den Job erledigt. Ich entschuldige mich für den unaufgeräumten Zustand, aber einige Ganoven haben sich Zugang verschafft und eine furchtbare Sauerei hinterlassen.\n\nIn diesem Labor hat meine liebste Ada Experimente an den Ventilen durchgeführt, die ich nach ihren genauen Vorgaben konstruiert habe. Indem wir eine gute Dosis Hochdruckdampf auf die mit einem \"+\" markierte Öffnung geben, können wir das Ventil öffnen, so dass der Dampf frei zwischen den beiden nicht markierten Enden hindurchströmen kann."},
                {"who": "charles", "text": "Probieren Sie es aus. Verbinden Sie West und Ost, aber nur, wenn im Norden ein hoher Druck herrscht."}
            ],
            [
                {"wer": "nicola", "text": "Beeindruckend!"},
                {"who": "charles", "text": "Ah, Nicola, du kommst genau richtig. Gertrude, Nicola wird Ihr Assistent sein. Er hat bereits begonnen, die Notizen zu studieren, die Ada hinterlassen hat. Der nächste Teil ist etwas anspruchsvoller für die alten grauen Zellen.\n\nWährend die Beaufschlagung der \"+\"-Seite mit Dampf das Ventil öffnet, schließt die Beaufschlagung der \"-\"-Seite das Ventil. Das Ventil ist nur geöffnet, wenn \"+\" unter einem höheren Druck als die \"-\"-Seite steht."},
                {"who": "charles", "text": "Ada hat mich gebeten, dies hinzuzufügen, damit sie ein Ventil herstellen kann, das sich bei Anlegen von Hochdruck an die Steuerleitung schließt. Mal sehen, ob diese Ventile noch richtig funktionieren.\n\nSchließen Sie den Osten und Westen an, aber nur, wenn der vom Süden kommende Druck niedriger als 100 PSI ist.\n\nSie können den Dampfeinlass als Quelle für guten Hochdruckdampf verwenden."}
            ],
            [
                {"who": "charles", "text": "Ausgezeichnet! Jetzt können wir durch Kombination dieser beiden Entwürfe eine Komponente konstruieren, die zwischen zwei Quellen umschaltet.\n\nWenn das West-Kontrollhaus 100 PSI Hochdruckdampf liefert, sollte der Nord-Generator an die Ost-Einrichtungen angeschlossen werden. Wenn das westliche Kontrollhaus jedoch 0 PSI atmosphärischen Druck liefert, sollte der südliche Generator an die östlichen Einrichtungen angeschlossen werden."},
                {"who": "nicola", "text": "Was passiert, wenn das Steuerhaus einen Druck zwischen 0 und 100 liefert?"},
                {"who": "charles", "text": "Was!?! Das wäre Niederdruckdampf! Wir arbeiten nicht mit Niederdruckdampf! Ich habe mein Vermögen nicht damit gemacht, Leute mit Niederdruckdampf zu versorgen!\n\nVergessen Sie diesen ganzen Niederdruck-Quatsch. Wenn die West-Steuerung auf Hochdruck steht, schließen Sie den Nord-Generator an, ansonsten den Süd-Generator."}
            ],
            [
                {"who": "nicola", "text": "Lady Chavvingtons Notizen sprechen von einer Dampfverbindung zwischen dem Labor und Lady Easleys Residenz, die zur Kommunikation genutzt wurde."},
                {"who": "charles", "text": "Ja, ich habe es entfernen lassen. Neue Verfahren. Zu viel von unserem Hochdruckdampf ging verloren. Der einzige Dampf, der unsere Anlage verlassen darf, wird dosiert und an zahlende Kunden geliefert. Keiner meiner Hochdruckdämpfe darf diese Wände verlassen."},
                {"who": "nicola", "text": "Ich denke, wir können noch eine Verbindung herstellen, ohne Dampf abzulassen. Laut diesen Notizen..."},
                {"who": "charles", "text": "Hah! Unmöglich! Das ist elementare Dampftechnik, mein lieber Junge! Die Dampfkommunikation beruht auf der Übertragung von Dampf, und du darfst nichts von meinem Dampf \"übertragen\"! Jedenfalls werde ich anderswo gebraucht. Diese Angelegenheit scheint nicht so dringend zu sein, wie die Ermittlungen über meinen fehlenden Dampf."},
                {"who": "nicola", "text": "Laut Lady Chavvington war Charles nicht als der größte Zuhörer bekannt. Sie beschreibt den Entwurf in einigen Details."},
                {"who": "ada", "text": "5. Juni\nIch habe heute ein fantastisches Druckreplikationsgerät erstellt. Um einen Druck mit einem bestimmten Wert zu erzeugen, habe ich Ventile verwendet, die in einem bestimmten Verhältnis Dampf zuführen und entlüften. Indem ich das Dampfventil zu 80 % öffnete und das atmosphärische Entlüftungsventil zu 20 %, konnte ich den ursprünglichen Druck von 80 PSI nachbilden. Charles' Ventile scheinen sich auf den Druck auf der \"+\"-Seite zu öffnen, abzüglich des Drucks auf der \"-\"-Seite"},
                {"who": "ada", "text": "Dies scheint für eine ganze Reihe von Werten mit einem Minimum an Fehlern zu funktionieren. Aufgrund seiner isolierenden Eigenschaften werde ich es einen \"Puffer\" nennen.\n\nDie Kommunikation durch Druck, anstatt durch den Fluss von Dampf, bietet wundersame Möglichkeiten, da der Wert nicht durch den Widerstand langer Rohre verfälscht wird. Ich habe Charles die Idee erklärt, obwohl er mehr mit Fragen des Firmengewinns beschäftigt war."},
                {"who": "nicola", "text": "Es scheint, dass einige Teile der ursprünglichen Konstruktion noch in der Wand installiert sind. Solange wir Lady Easleys Dampf nutzen, um die Geräte jenseits der Wand zu betreiben, wird sich Charles nicht beschweren."}
            ],
            [
                {"who": "nicola", "text": "Nicht perfekt, aber wir können immer wieder zurückkommen und es verbessern. Faszinierend, nicht wahr? Die Kombination der Ventile reproduziert jeden Druckwert. Der eingehende Druck öffnet die Dampfeinlass- und die Atmosphärenentlüftungsventile auf die exakten Werte, um den Druck in der Ausgangsleitung korrekt zu reproduzieren.\n\nLassen Sie uns unsere erste Nachricht senden und Lady Easley besuchen, um zu sehen, ob es funktioniert."},
                {"who": "annie", "text":"[Einige Zeit später]\nDu hast mich so erschreckt! Für eine Minute dachte ich, es wäre Ada, die aus dem Jenseits zu mir spricht."},
                {"who": "nicola", "text": "Wir bitten um Entschuldigung Lady Easley. Wir versuchen, Lady Chavvingtons Forschung fortzusetzen. Wir haben versucht, 80 PSI zu senden, was laut unserem Codebuch \"Hallo\" bedeutet"},
                {"who": "annie", "text": "Nein! 80 PSI bedeutet, \"Hilfe! Ich bin im Jenseits gefangen!\". Es sind 20 PSI, die \"Hallo\" bedeuten.\n\nAls Ada das System installierte, machte sie einen Fehler bei den Ventilen und alle Drücke wurden verkehrt herum empfangen. Als sie das Problem untersuchte, bekam sie ihre Erleuchtung über die Möglichkeiten von Dampf. Wir haben das nie behoben, und stattdessen habe ich alle Druckwerte in meinem Codebuch invertiert."},
                {"who": "nicola", "text": "Interessant. Vielleicht sollten wir sehen, ob wir den gleichen Fehler machen können."}
            ],
            [
                {"who": "charles", "text": "Verflixt! Beim besten Willen kann ich den Druckvergleicher von Ada nicht finden. Jedes Jahr vergleicht die hoch angesehene High Pressure Steam Society die Drücke aller Hochdruckdampfwerke, um den Lieferanten des Dampfes mit dem höchsten Druck zu ermitteln. Ohne einen genauen Komparator müssen wir den diesjährigen Wettbewerb absagen.\n\nMeine fünfjährige Siegesserie wäre ruiniert! Ich bin sicher, dass sie hier irgendwo noch einen hatte..."},
                {"who": "nicola", "text": "Wir sollten versuchen, es zu schaffen, sonst mischt er sich nur weiter ein..."},
                {"who": "charles", "text": "Was hast du gesagt, Junge?"},
                {"who": "nicola", "text": "Ich sagte, wir könnten einen machen, Sir."},
                {"who": "charles", "text": "Hervorragend! Denken Sie nur daran, dass es nicht ausreicht, den Ausgang mit Hochdruckdampf zu verbinden, wenn ein Eingang größer als der andere ist, man muss auch den Ausgang entlüften, wenn das Gegenteil der Fall ist. Meine Rohre sind vollständig abgedichtet und lassen nie Dampf austreten, es sei denn, man öffnet ein Ventil, um sie zu entlüften."}
            ],
            [
                {"who": "charles", "text": "Ausgezeichnet! Solche Präzision! Ich bin sicher, es könnte den Druck einer Feder auf einem Kricketfeld erkennen.\n\n Ich brauche nur noch ein weiteres Gerät, bevor ich Sie Ihren Untersuchungen überlasse. Um in die Hochdruck-Dampf-Gesellschaft aufgenommen zu werden, muss man nachweisen, dass sein Dampfwerk Hochdruckdampf erzeugt."},
                {"who": "charles", "text": "Hier bei General High Pressure Steam Works produzieren wir Hochdruckdampf bei 100 PSI, dem einzigen Druck, den ich als echten Hochdruckdampf anerkennen würde. Aber technisch gesehen wird jeder Dampfdruck über 50 PSI als Hochdruckdampf angesehen. Als Vorsitzender der Hochdruckdampf-Gesellschaft ist es meine Aufgabe, dafür zu sorgen, dass minderwertige, Niederdruckdampf produzierende Abweichler nicht zugelassen werden."},
                {"who": "nicola", "text": "Wir haben noch Ihre Konstruktion für den 50 PSI-Dampfgenerator in der Werkzeugkiste. Wir können die bereits erstellten Entwürfe als Komponenten verwenden."}
            ],
            [
                {"who": "charles", "text": "Bravo! Mit dieser Vorrichtung werde ich diese Niederdruck-Dampferzeuger von unserer exklusiven Gesellschaft fernhalten."},
                {"who": "nicola", "text": "Wie viele Mitglieder sind es bisher?"},
                {"who": "charles", "text": "Nun... Eine... Wie ich schon sagte: \"Sehr exklusiv\". Ich muss auf jeden Fall los, sonst verpasse ich die Empfangsdrinks!"},
                {"who": "nicola", "text": "Endlich...\n\nLaut Lady Chavvingtons Tagebuch wurde eine zweite Kommunikationsleitung installiert, die zur Residenz von keinem Geringeren als Lord Moorhouse führt! Charles wäre nicht glücklich gewesen, wenn er es gefunden hätte. Sehen Sie."},
                {"who": "ada", "text": "17. Juni\n\nNachdem die Pipeline zum Anwesen von Lord Moorhouse fertiggestellt ist, beginne ich mit der Arbeit an einem Gerät, das den hohen Bereich der Druckwerte (0-100) auf solche verdichtet, die für das Niederdrucksystem (0-50) akzeptabel sind. Zu meiner völligen Überraschung war der Druckpuffer in der Lage, den Eingangsdruck auf genau die Hälfte zu skalieren, wenn er mit dem Niederdruckdampf von Lord Moorhouse betrieben wurde, aber immer noch 100 PSI als Referenzeingang verwendete."},
                {"who": "nicola", "text": "Wirklich!?! Wie kann das nur funktionieren?"}
            ],
            [
                {"who": "nicola", "text": "Erstaunlich! Nun, damit haben wir die Hälfte geschafft. Wir können senden; aber jetzt müssen wir auch empfangen. Wir müssen ihren Dampfdruck auf unsere Reichweite verstärken. Laut Lady Chavvington müssen wir das Gerät mit unserem 100 PSI-Dampf versorgen, aber 50 PSI als Referenzdruck verwenden."}
            ],
            [
                {"who": "nicola", "text": "Mal sehen, ob das funktioniert.\n\n80 PSI [Hallo]\n55 PSI [Anfrage Meeting]\n57 PSI [Afternoon Tea in Madingley Hall]"},
                {"who": "george", "text":"...\n23 PSI [Negativ]\n...\n6 PSI [6]\n12 PSI [/]\n7 PSI [7]"},
                {"who": "nicola", "text": "Was?!? 6/7? Lassen Sie mich im Tagebuch nachsehen.\n...\nAlles, worüber der Eintrag für den 7. Juni spricht, ist die Konstruktion des Druckinverters. Wie konnte er überhaupt mit uns kommunizieren, wenn die Drücke vertauscht waren? ... vertauscht ... vertauscht? ...  Natürlich! \n\nMeine Entschuldigung. Ich habe zu viel Zeit in den Kolonien verbracht. Hier ist der korrekte Eintrag."},
                {"who": "ada", "text": "\"6. Juli\" Ich vermute, dass unsere Kommunikation kompromittiert wurde! Nach tagelangem Bitten stimmte Lord Moorhouse zu, unsere Forschungsbemühungen zu vereinen. Wir tauschten die Codes für die Türen unserer jeweiligen Labore über unseren Dampfkommunikator aus. Nur wenige Stunden später kam eine handschriftliche Nachricht in unserer Residenz an, die mich darüber informierte, dass sein Labor geplündert wurde und ich nicht mehr willkommen sei. Ich beeilte mich, um festzustellen, dass in mein Labor ebenfalls eingebrochen worden war! So viel Arbeit ist verloren gegangen"},
                {"who": "ada", "text": "Ich habe den Code sicher gespeichert. Sicherlich hätte Charles so etwas nicht getan. Ich habe sofort die Tür meines Labors austauschen lassen. Charles würde eher sterben, als eine Moorhouse-Dampftür zu bedienen."},
                {"who": "ada", "text": "Ich fühle mich hier nicht mehr sicher. Ich habe meine Schwester kontaktiert, um meine baldige Ankunft zu erwarten. Es war ein perfekter Zeitpunkt, um mein neues Verschlüsselungssystem zu testen, das unsere Kommunikation sicher halten wird. Ich habe immer noch nicht das Schild erhalten, das Charles versprochen hat, an dem Rohr anzubringen, das zu ihrer Residenz führt. Er kann manchmal so vergesslich sein."},
                {"who": "nicola", "text": "Das war ihr letzter Tagebucheintrag.\n\nOh je! Ich dachte nicht, dass dieses Rohr irgendwo hinführt, also habe ich die Komponenten für unsere anderen Entwürfe verwendet. Glücklicherweise waren einige festgeschweißt, also habe ich sie an Ort und Stelle gelassen. Die Verschlüsselungseinheit scheint größtenteils zu funktionieren."}
            ],
            [
                {"who": "nicola", "text": "Na das war ja einfach. Die Verschlüsselung ist einfach ein unausgeglichener Puffer. Aber wie könnte man einen Entwurf machen, der eine solche Chiffre genau umkehrt?\n\nVielleicht könnte Lady Easley helfen. Ich werde mich erkundigen, ob sie zur Verfügung steht, um uns zu helfen."},
                {"who": "annie", "text": "Haben Sie unter Adas Papieren zufällig eine Serviette aus den Madingley Hall Tea Rooms gefunden? Ich glaube, sie war auf den 24. Juni datiert. Wir diskutierten gerade über das neue Papier der Royal Society zum Thema \"Konvergenz in monotonen Reihen\", als Ada anfing, Dinge auf eine Serviette zu kritzeln. Dann rannte sie los und rief aus, dass sie das Entschlüsselungsproblem gelöst haben könnte. Ohne die Rechnung zu begleichen, wie ich hinzufügen möchte."},
                {"who": "ada", "text": "\"24. Juni\" Ein Entschlüsselungsgerät kann durch wiederholtes Raten des Wertes, Verschlüsseln und Vergleichen mit der verschlüsselten Eingabe gebildet werden. Sollte die Eingabe höher sein, erhöhen wir den Schätzwert. Sollte sie niedriger sein, verringern wir sie. Ein solches Gerät könnte zahlreiche Funktionen umkehren.\n\nCharles' Dampfkomparator war genau das, was ich brauchte, obwohl ich daran denken muss, ihn ihm vor dem diesjährigen Treffen der Hochdruck-Dampf-Gesellschaft zurückzugeben."},
                {"who": "nicola", "text": "Wenigstens wissen wir, wo sein Komparator hin ist."}
            ],
            [
                {"who": "nicola", "text": "Unglaublich! Mit dieser Technik könnten wir die Präzision all unserer Designs verbessern. Lady Chavvingtons Schwester muss mehr Informationen über diese Techniken haben.\n\n80 PSI [Hallo]"},
                {"who": "ada", "text": "80 PSI [Hallo]\n93 PSI [Hier ist Ada Chavvington]\n"},
                {"who": "nicola", "text": "60 PSI [Who?]\n73 PSI [Repeat]"},
                {"who": "ada", "text": "25 PSI [A], 28 PSI [D], 25 PSI [A]\n24 PSI [_]\n27 PSI [C], 32 PSI [H], 25 PSI [A], 46 PSI [V], 46 PSI [V], 33 PSI [I], 38 PSI [N], 31 PSI [G], 44 PSI [T], 39 PSI [O], 38 PSI [N]"},
                {"who": "nicola", "text": "Das ist unerwartet. Wir müssen sofort Lord Chavvington informieren.\n...\nLord Chavvington! Wir haben eine Verbindung zur Residenz von Lady Chavvingtons Schwester hergestellt, aber die Person am anderen Ende behauptet, Lady Chavvington selbst zu sein!"},
                {"who": "charles", "text": "Ah, ja, das wäre Ada."},
                {"who": "nicola", "text": "B... Aber Lord Chavvington, Sie sagten, Ada sei gestorben."},
                {"who": "charles", "text": "Was für ein Unsinn! Ada geht es bestens und sie bleibt bei ihrer Schwester, bis wir die Sache mit dem fehlenden Hochdruckdampf geklärt haben."},
                {"who": "nicola", "text": "Du hast sie als deine \"teure Verstorbene\" bezeichnet."},
                {"who": "charles", "text": "Ja... Sie ist abgereist... zu ihrer Schwester..."},
                {"who": "nicola", "text": "Alle nahmen an, sie sei gestorben..."},
                {"who": "charles", "text": "Hmm... Ja... Wenn ich darüber nachdenke, würde das die Blumen und Karten erklären, die mein Mitgefühl für meinen Verlust ausdrücken. Ich war gerührt von der Sorge der Leute um den Verlust meines Hochdruckdampfes. Je eher Sie die Dampfberechnungsmaschine fertigstellen, desto eher können wir der Sache auf den Grund gehen. Setzen Sie die Nachforschungen zügig fort."},
                {"who": "ada", "text": "27. Juni\nZusammen mit Lord Moorhouse wurden solche Fortschritte in unserer Forschung zur Dampfberechnung gemacht. Unsere früheren Konstruktionen litten unter Ungenauigkeiten. Nur wenn die Ventile perfekt ausbalanciert waren und eine Leistung von 50 erzeugten, war das Ergebnis perfekt. Dabei kam mir eine Idee.\n\nIch konnte spüren, wie offen ein beliebiges Ventil ist, indem ich ein zweites Ventil, das den Dampf ablässt, anbrachte und dessen Offenheit einstellte. Nur wenn beide Ventile gleich offen sind, ist der Druck zwischen ihnen genau 50. Ich musste nur den Wert so lange einstellen, bis dies der Fall war."},
                {"who": "ada", "text": "Damit konnte Lord Moorhouse ein dampfdruckbeaufschlagendes Bauteil herstellen, das er mir hoffentlich verraten wird.\n\nLord Moorhouse ist sehr schüchtern, aber sehr schlau, leider hat er oft zu viel Angst, seine Innovationen zu teilen."}
            ],
            [
                {"who": "nicola", "text": "Nun, es funktioniert. Wir können jetzt spüren, wie offen ein Ventil ist, aber ich sehe nicht, wie uns das der Dampfberechnung näher bringt. Ich nehme an, wir müssen Lord Moorhouse fragen."},
                {"who": "nicola", "text": "Lord Moorhouse. Danke, dass wir Sie aufsuchen durften. In ihrer Abwesenheit versuchen wir, die Dampfberechnungsarbeit von Lady Chavvington fortzusetzen. Nur Sie kennen die Konstruktion der Druckaddiereinheit und wir bitten Sie, sie mit uns zu teilen."},
                {"who": "george", "text": "Ich stimme zu. Nachdem ich darüber nachgedacht habe, muss der Fortschritt des Wissens trotz ihrer Kollusion mit Charles gegen mich weitergehen. Ich werde das Geheimnis der Addition im Austausch für die Versicherung, dass sie sicher vor ihm ist, offenbaren. Wenn ich die Gerüchte höre, die in diesen Hallen kursieren, vermute ich, dass sie durch seine Hand gestorben ist."},
                {"who": "nicola", "text": "Lady Chavvington ist gesund und munter und wohnt bei ihrer Schwester."},
                {"who": "george", "text": "Das ist eine Erleichterung. Die Vorstellung, dass sie noch mehr Zeit in dieser Hochdruck-Todesfalle verbringt, hält mich nachts wach. Wenn einer dieser Hochdrucktanker explodieren würde, Gott bewahre, wäre die Zerstörung immens. Ich würde nicht ruhen, bis die Welt von diesem Hochdruck-Horror befreit wäre... Oh... Wo war ich? Der Zusatzentwurf. Bevor man einen machen kann, muss man einen der Subtraktion machen. Ein Ventil ist so offen, wie der Druck auf der (+)-Seite minus dem Druck auf der (-)-Seite. Wenn man ein solches Ventil herstellt, kann man seine Offenheit messen."},
                {"who": "george", "text": "Aber jetzt müssen Sie gehen. Während Ada in Sicherheit ist, habe ich eine wichtige Aufgabe, auf die ich mich vorbereiten muss." }
            ],
            [
                {"who": "charles", "text": "Ich habe das Schild für die Pfeife mitgebracht, nach dem Ada gefragt hat."},
                {"wer": "nicola", "text": "Das muss schon Monate her sein."},
                {"who": "charles", "text": "Ja, nun, wenn ein Chavvington sagt, dass er etwas tun wird, dann wird es auch getan. Sie müssen ihn nicht jeden Monat daran erinnern.\n\nKönnten Sie ihr bitte eine Nachricht von mir schicken?\n\n80, 94, 76, 52, 68, 70"},
                {"who": "nicola", "text": "Ich sehe, Sie haben die Codes gelernt!"},
                {"who": "charles", "text": "Gelernt?!? Ich habe sie entworfen! Es war während meiner Zeit beim Militär. Eine Kombination der häufigsten Nachrichten, die zwischen Kapitänen ausgetauscht werden.\n\nSei ein guter Kerl und schicke es sofort ab."},
                {"who": "nicola", "text": "80 PSI [Hallo]\n94 PSI [Hier ist Charles Chavvington]\n76 PSI [Mein liebster Engel]\n52 PSI [Mein Herz sehnt sich nach dir]\n68 PSI [Ich warte sehnsüchtig auf deine Rückkehr]\n70 PSI [Ohne dich hat das Leben jeden Sinn verloren]"},
                {"who": "charles", "text": "Gut, wie ich sehe, ist die Konstruktion des Subtraktors abgeschlossen. Ausgezeichnet! Wie meine geliebte verstorbene Ada einst sagte..."},
                {"who": "nicola", "text": "Sir! Sie müssen aufhören, diesen Ausdruck zu verwenden! Die Leute fangen an, Sie für einen Mörder zu halten..."},
                {"who": "charles", "text": "Hmm... Ja. Wie Ada..., die nicht mehr unter uns weilt, einmal sagte: \"Ein Addierer ist nichts anderes als die Inversion eines Subtrahierers. Der Ausgang minus einen der Eingänge muss gleich dem anderen Eingang sein\". Aber welcher Eingang? \n\nSie verbrachte einige Zeit damit, frustriert zu sein, da der Entwurf stecken blieb, wenn dieser Eingang Null war, und das Umschalten der Eingänge führte nur dazu, dass der Entwurf stecken blieb, wenn der andere Eingang Null war. Ihr Heureka-Moment kam, als sie erkannte, dass es eine Kombination aus beiden Ansätzen sein musste."}
            ],
            [
                {"who": "annie", "text": "Warum hast du nicht auf meine Nachrichten geantwortet?"},
                {"who": "nicola", "text": "Unsere Entschuldigung Lady Easley, wir wussten nicht, dass Sie welche geschickt haben."},
                {"who": "annie", "text": "Sie sollten auf Ihren Nachrichtenschlössern hier drüben aufgezeichnet sein.\n...\n\nSie fehlen! Die Riegel müssen von demjenigen gestohlen worden sein, der in das Labor eingebrochen ist. Sie sollten sie sofort wiederherstellen, damit Sie keine weiteren wichtigen Mitteilungen verpassen."},
                {"who": "annie", "text": "Wenn eine Nachricht stabil ist, wird ein Dampfimpuls an die Zeitmessleitung gesendet. Dies veranlasst den Zwischenspeicher, den Wert zu diesem Zeitpunkt zu erfassen. Der Riegel zeichnet den Wert auf, behält aber den alten Wert bei, bis das Zeitsteuerungsrohr zu einem niedrigen Druckniveau zurückgekehrt ist.\n\nDa diese Riegel nacheinander platziert werden können, um eine Reihe von Meldungen aufzuzeichnen, ist es wichtig, dass der neue Wert erst freigegeben wird, wenn das Zeitsteuerungsrohr zu einem niedrigen Druckniveau zurückgekehrt ist."},
                {"who": "annie", "text": "Ich war immer beeindruckt davon, wie gut die Ventile von Charles abgedichtet sind, wobei ein geschlossenes Ventil den Druck in einem Rohr auf unbestimmte Zeit aufrechterhalten kann.\n\nIch hoffe, dass das Design nicht verloren geht, denn ich hatte solche Hoffnungen, es auf vielfältige Weise zu erweitern."}
            ],
            [
                {"who": "charles", "text": "Tolle Neuigkeiten für alle! Erlauben Sie mir, Ihnen Professor Joseph Cogsworth vorzustellen. Einer der, wenn nicht DER, hellste Kopf in allen Ländern. Seine auf Zahnrädern basierenden Tabelliermaschinen haben Wunder für unsere Buchhaltung bewirkt. Er hat uns bei der Suche nach dem vermissten Hochdruckdampf geholfen und sich herabgelassen, sich für Adas Arbeit zu interessieren."},
                {"who": "joseph", "text": "Interessant zu sehen, wie weit Sie gekommen sind. Wie ich sehe, haben Sie den Riegel nach der gleichen Spezifikation rekonstruiert, die Ada in ihren Notizen beschrieben hat."},
                {"who": "nicola", "text": "Diese Notizen sind während des Einbruchs verschwunden. Woher wussten Sie von ihnen?"},
                {"who": "joseph", "text": "Ada war immer eine große Bewunderin meiner Arbeit. Obwohl ich ihren dampfbasierten Ansatz für grob und ungenau hielt, suchte sie oft meinen Rat in der Hoffnung, dass er adäquat gemacht werden könnte."},
                {"who": "charles", "text": "Sobald Sie den Dampftabulator fertiggestellt haben, können wir feststellen, welcher meiner Buchhalter meinen Hochdruckdampf veruntreut hat.\n\nJeder Tabulator addiert oder subtrahiert einen Wert von der aktuellen Zählung. Der nördliche Anschluss wählt zwischen Addieren oder Subtrahieren und der südliche Anschluss liefert einen Zeitimpuls des Hochdruckdampfes.\n\nAda musste alle ihre früheren Konstruktionen verbessern, um die Genauigkeit aller verwendeten Komponenten zu erhöhen. Eine Arbeit, die sie nie zu Ende bringen konnte."}
            ],
            [
                {"who": "charles", "text": "Sehr gut, aber leider zu spät, denn Professor Cogsworth hat den schuldigen Buchhalter bereits identifiziert."},
                {"who": "joseph", "text": "In der Tat, aber im Gegenzug verlange ich nur, dass ich diesen kruden Versuch eines dampfbasierten Tabelliergeräts in Besitz nehme. Ada hat sich gewünscht, dass ich der Hüter all ihrer Forschungen bin. Gertrude? Nicola? Ihre Arbeit hier ist getan." },
                {"who": "ada", "text": "Das glaube ich kaum! Unwahrscheinlich, dass ich meine Arbeit einem Mann mit dem Charakter und dem Intellekt einer parasitären Wespe überlassen würde."},
                {"who": "joseph", "text": "Ada! Ich hatte den Eindruck, du wärst gestorben."},
                {"who": "ada", "text": "Charles! Nimm diesen Mann fest, denn er ist die Ursache dieser ganzen Aufregung"},
                {"who": "charles", "text": "Was!?! Ich glaube kaum, dass ein Mann seines Formats in solch unbedeutende Verbrechen verwickelt ist"},
                {"who": "george", "text": "Es ist wahr, Charles. Joseph hat mich mit Unwahrheiten gegen dich vergiftet und uns so manipuliert, dass wir uns gegenseitig verabscheuen. Zuerst habe ich mit ihm zusammengearbeitet, weil er eine Abneigung gegen Hochdruckdampf hatte, aber erst später habe ich seinen Hass auf ALLEN Dampf erkannt!"},
                {"who": "charles", "text": "Ist das wahr Joseph? Sie haben keine Leidenschaft für Hochdruckdampf?"},
                {"who": "joseph", "text": "Natürlich ist es wahr! Grässlicher Stoff. Aber mich festnehmen zu lassen? Weswegen? Aber Ihr habt keine Beweise für irgendwelche Missetaten." },
                {"who": "ada", "text": "Tatsächlich haben wir. Ihre Zahnradtabelliermaschinen haben winzige Bruchteile von jeder Transaktion entfernt. Erst als wir die Ergebnisse mit dem Dampftabulator verglichen haben, sind uns diese Fehler aufgefallen. Und das alles, damit Sie langsam Hochdruckdampf absaugen können. Hätte Charles nicht gespürt, dass etwas nicht stimmt, wäre das nie aufgefallen."},
                {"who": "joseph", "text": "Absurd! Was soll ich mit dieser ekelhaften Substanz!"},
                {"who": "george", "text": "Um den Druckbehälter langsam zu füllen, den Sie mich gebeten haben, unter dem Rathaus zu bauen."},
                {"who": "charles", "text": "Was!?! Aber das ist ein Niederdruckbehälter! Haben Sie keine Vorstellung von den Folgen, wenn Sie ihn mit Hochdruckdampf füllen!?!"},
                {"who": "joseph", "text": "Die einzige Konsequenz wäre, dass die Welt den Dampf endlich ein für alle Mal ablehnt! Sie sollte für Hinrichtungen reserviert und nur in Museen zu sehen sein. Zum Nachdenken! Der Dampf dringt in die Büros ein und verdrängt meine Maschinen! Denn es sind nur Zahnräder, die einen... WAS!?! Lass mich los! Lasst mich los, ihr erbärmlichen Narren! Das könnt ihr mir nicht antun! Wartet, bis die Akademie davon erfährt!"},
                {"who": "charles", "text": "Die Akademie wird sicherlich davon hören!\n\nNun, das ist ein zufriedenstellender Abschluss dieser Angelegenheit. Mein Hochdruckdampf ist sicher, genauso wie meine liebe Ada."},
                {"who": "ada", "text": "Eigentlich Liebling, ich glaube, die Geschichte der Dampfberechnung fängt gerade erst an."},
                {"who": "charles", "text": "In der Tat. Aber vielleicht sollten wir zuerst die Dampfbombe entschärfen."}
            ],
            [
                {"who": "ada", "text": "Danke Gertrude. Wenn Sie nicht so schnell reagiert hätten, hätten wir eine Katastrophe erlebt."},
                {"who": "george", "text": "Ich bin auch ziemlich beeindruckt. Ada, ich kann mich nicht genug dafür entschuldigen, dass ich Sie beschuldigt habe, meine Residenz zu durchwühlen. Wäre es möglich, dass Gertrude und Nicola mir bei meinen Entwürfen helfen? Ich denke, ihr Beitrag wird sehr konstruktiv sein."},
                {"who": "ada", "text": "Sprechen Sie nicht mehr davon, denn auch mir muss verziehen werden. Als Geste des guten Willens steht es Ihnen frei, mein... unser Labor zu benutzen. Lady Easley hat bereits Zugang. Ich glaube, Charles und ich brauchen eine kleine Pause von diesem ganzen Trubel. Wir werden in ein paar Tagen zurückkehren und ich freue mich schon darauf, Ihre Entdeckungen zu begutachten."},
                {"who": "george", "text": "Vielen Dank und gute Fahrt.\n\nNicola, könntest du mir den x2-Druckverstärker suchen."},
                {"who": "nicola", "text": "Es ist genau hier.\n\nDie Konstruktion ist einfach, dennoch finde ich die Bedienung umwerfend nützlich."},
                {"who": "george", "text": "In der Tat. Obwohl dieses Gerät Werte von einem bestimmten Bereich von 0 bis 50 auf den Bereich von 0 bis 100 verstärkt. Angesichts eines minimalen und maximalen Wertes glaube ich, dass wir einen Verstärker konstruieren können, der in jeden gegebenen Bereich hineinzoomt."},
                {"who": "nicola", "text": "Wir werden es das Zoom-Element nennen."},
                {"who": "george", "text": "Durchaus, obwohl wir es erst erfinden sollten. Der Norden kann unser Maximum und der Süden unser Minimum sein. Der Ost-Ausgang wird uns sagen, wo der West-Eingang innerhalb des Bereichs liegt."}
            ],
            [
                {"who": "george", "text": "Gut, jetzt können wir in einen beliebigen Druckbereich zoomen. Was ich als nächstes brauche, ist eine Möglichkeit zu erkennen, ob wir uns innerhalb eines Bereichs befinden. Schauen Sie sich diesen \"Dampftachometer\" an.\n\nAda hat ihn für Charles gebaut, um die Menge des durchströmenden Dampfes zu messen. Wenn Dampf durch ein langes Rohr strömt, verliert er etwas Druck. Je schneller der Dampf durchläuft, desto mehr Druck verliert er. Wenn auf beiden Seiten der gleiche Druck herrscht, darf sich kein Dampf bewegen. Sie hat sogar einige Ventile in das Rohr eingebaut, um den Widerstand zu erhöhen und den Unterschied größer zu machen."},
                {"who": "george", "text": "Was ich brauche, ist eine Möglichkeit zu sagen, ob die Eingangsreferenz West zwischen den beiden Drücken liegt. Er muss niedriger sein als der Norden, aber höher als der Süden."}
            ],
            [
                {"who": "george", "text": "Durch das Heranzoomen in einen Bereich kann ich jetzt genauer sagen, wie viel Dampf jemand verbraucht, aber ich kann auch sagen, ob ich innerhalb des Bereichs bin, den ich inspiziere. Ich werde meinen Kunden sagen, dass sie sich auf eine zusätzliche Nachkommastelle auf ihren nächsten Dampfrechnungen einstellen sollen!"},
                {"who": "annie", "text": "Diente diese ganze Forschung nur dazu, den Gewinn Ihres Unternehmens zu fördern? Das ist nicht das, was unsere Vereinbarung war"},
                {"who": "george", "text": "Aber Lady Easley! Die habe ich für Sie gemacht. Glauben Sie mir, das werden in Zukunft sehr nützliche Komponenten sein."},
                {"who": "annie", "text": "Das bezweifle ich stark. Ich denke, es ist Zeit für etwas reine Forschung.\n\nZurück zu dem Latch-Entwurf, an dem Ada und ich gearbeitet haben. Ich wollte ein Latch, das aktiviert oder deaktiviert werden kann. Wenn der North-Eingang high ist, arbeitet das Latch ganz normal, aber wenn er low ist, sollte es weder den Ausgang ansteuern, noch einen neuen Eingang akzeptieren, wenn es einen Zeitimpuls sieht. Wir können das alte Design verwenden, obwohl es vielleicht effizienter ist, ein eigenes zu bauen."}
            ],
            [
                {"who": "annie", "text": "Nun, der Grund, warum ich dieses Design wollte, war, dass ich in der Lage sein wollte, ein \"adressierbares Latch\" zu konstruieren, bei dem der North-Eingang zwischen einem von mehreren Latches auswählt. Auf diese Weise könnte ich mehrere Werte speichern und auf jeden nach Belieben zugreifen.\n\n Beginnen wir mit zwei. Der Nord-Eingang wählt zwischen zwei Zwischenspeichern aus. Der Nordwert 0 bis 50 wählt einen aus, und der Nordwert 50 bis 100 wählt den zweiten aus."}
            ],
            [
                {"who": "annie", "text": "Genau, leider ist das alles, was wir erreicht haben. Als Nächstes wollte ich einen Riegel, der fünf Werte speichern kann, aber Ada und ich konnten nicht alles in ein einziges Design packen. Die Auswahlbereiche wären 0-20, 20-40, 40-60, 60-80 und 80-100. Leider war es zu schwierig zu erkennen, in welchem der Bereiche sich das Select-Signal befand."},
                {"who": "george", "text": "Wenn man nur eine Entfernungsmessung hätte."},
                {"who": "annie", "text": "Ihre Konstruktion erfasst den Durchfluss, nicht einen Druckbereich."},
                {"who": "george", "text": "Nun, ja und nein. Er erkennt einen Druckbereich von strömendem Dampf. Wenn sie in einer Kette platziert werden und Dampf durchgelassen wird, erkennen sie einen Druckbereich."}
            ],
            [
                {"who": "annie", "text": "Ich gebe zu, dass der Durchflussdetektor ziemlich genial war und genau der Trick war, den wir brauchten. Aber wie würden wir nun zwei dieser Latch5-Blöcke zu einem Latch10 zusammenfügen? Die Auswahlbereiche wären 0-10, 10-20, 20-30..."},
                {"who": "george", "text": "Und deshalb habe ich darum gebeten, das Zoom-Element zu gestalten. Ich habe die Genialität in Ihren Ideen gesehen und habe bereits vorausgeplant."}
            ],
            [
                {"who": "ada", "text": "Also, ich bin beeindruckt. Wir waren erst ein paar Tage weg und Sie haben den Speicherteil des Steamputers erstellt."},
                {"Wer": "Nicola", "Text": "Die was?"},
                {"who": "annie", "text": "Alles wird zu gegebener Zeit enthüllt.\n\nNun, ich denke, meine Arbeit hier ist getan! Ich habe es geschafft, den Speicher zu entwerfen. Ich überlasse es Ihnen, die Berechnungen und die Steuerung zu untersuchen..."},
                {"who": "ada", "text": "Fangen wir mal klein an. Wir brauchen eine Komponente, die uns den kleineren der beiden Eingabewerte liefert. Sollte einfach genug sein."}
            ],
            [
                {"who": "charles", "text": "Ada! Mein Schätzchen! Probiere dieses aufregende neue Getränk, das George mir vorgestellt hat! Es heißt \"Froffee Coffee\". Probieren Sie es!"},
                {"who": "ada", "text": "Hmmm, ja es ist eher ni..."},
                {"who": "charles", "text": "Weißt du, was es noch besser machen würde!?!"},
                {"who": "ada", "text": "High press..."},
                {"who": "charles", "text": "Hochdruckdampf!"},
                {"who": "ada", "text": "Darling. Ich schätze es sehr, dass du dich mit George versöhnt hast, aber hättet ihr zwei nicht die Programmelemente planen sollen?"},
                {"who": "charles", "text": "Schon erledigt! George beendet das Gedicht... oder sollte ich sagen, die Anforderungen."},
                {"who": "ada", "text": "Oh! Nun müssen wir schnell die Max-Komponente erstellen und dann können Sie auf unsere Ingenieure zugreifen.\n\nDer Output muss diesmal das Maximum der beiden Inputs sein."}
            ],
            [
                {"who": "charles", "text": "Wenn wir etwas Zeit haben, bevor George kommt, sollten wir sie damit verbringen, seine Druckbehälter sicherer zu machen. Sie sind bis zu 90 PSI sicher, aber darüber hinaus sind sie explosionsgefährdet. Was ich brauche, ist eine \"Dampfsicherung\". Erlauben Sie den Dampffluss von West nach Ost, aber sobald der Druck über 90 PSI steigt, trennen Sie die Versorgung und entlüften Sie den Behälter. Denken Sie daran, zuerst die Zufuhr zu unterbrechen und erst dann den Behälter zu entlüften."}
            ],
            [
                {"who": "charles", "text": "Komm George! Ich denke, wir haben etwas Privatsphäre!"},
                {"who": "george", "text": "Bist du dir sicher, dass das Charles ist? Lady Easley erkennt meine Existenz kaum an."},
                {"who": "charles", "text": "Stiff upper lip old chap!"},
                {"who": "george", "text": "Sehr gut. Dies ist eine etwas heikle Angelegenheit. Ich benötige ein Gerät, das bei jedem Zyklus um 10 PSI ansteigt. Es sollte bei 0 PSI beginnen und bei jedem Zeitimpuls um 10 PSI ansteigen. Anstatt 100 PSI zu erreichen, sollte es wieder auf 0 PSI zurückgesetzt werden. Bitte seien Sie diskret bei der Konstruktion."}
            ],
            [
                {"who": "george", "text": "Charles, ich kann dir nicht genug dafür danken, dass ich deine Gedichte verwenden darf. Dieses hier drückt meine Gefühle für Lady Easley perfekt aus. Es beschreibt ihre Schönheit, ihre Liebenswürdigkeit und ihre genialen Riegeldesigns. Alles, was ich tun musste, war, das Objekt der Zuneigung von Ihrem \"Hochdruckdampf\" zu meinem \"Lady Easley\" zu ersetzen."},
                {"who": "george", "text": "Werfen Sie einen Blick auf das Latch10-Design von Easley. Wir benötigen etwas einfacheres, aber komplexeres. Ich brauche für jeden Eingangswertbereich einen bestimmten Druck, der ausgegeben werden soll. Es besteht keine Notwendigkeit, die gehaltenen Werte jemals zu aktualisieren.\n\nNun ist vielleicht ein guter Zeitpunkt, um zu untersuchen, wie man benutzerdefinierte Komponenten herstellt. Sie können ein beliebiges altes Design als Basis verwenden und die Implementierung für diese Instanz ändern."}
            ],
            [
                {"who": "george", "text": "Wir sind fast da. Verbinden wir diese Teile miteinander, damit es mein Gedicht wiedergibt. Bei jedem Dampfimpuls soll der nächste Wert ausgelesen werden. Das wird nicht trivial sein, da unser Zähler eine Sequenz 0, 10, 20, 30... durchläuft, während unser Gedichtspeicher eine Sequenz 5, 15, 25, 35... will."}
            ],
            [
                {"who": "charles", "text": "Ausgezeichnete Sache! Es ist nur schade, dass wir uns auf diese schrecklichen Cogsworth-Uhren verlassen müssen, um die Zeitimpulse zu liefern."},
                {"who": "nicola", "text": "Gertrude, weißt du noch, wie du die Bombe entschärft hast? Ich denke, wir können eine Uhr genauso präzise bauen."},
                {"who": "charles", "text": "Wie auch immer Sie es machen, ich möchte, dass es einmal pro Tick umspringt und ich möchte nicht, dass es die Zeit ändert, je nachdem, mit was es verbunden ist."}
            ],
            [
                {"who": "ada", "text": "Was habt ihr zwei getrieben?"},
                {"who": "charles", "text": "George und ich haben gerade eine wunderbare Gedichte rezitierende Maschine an Lady Easley geliefert. Sie wurde so programmiert, dass sie Georges Gefühle ihr gegenüber rezitiert. Mit genügend Raffinesse könnte man ein solches Gerät auf die Größe eines Pferdes reduzieren."},
                {"who": "ada", "text": "Das klingt schön. Obwohl ich hoffe, dass Sie die Drücke umgekehrt haben, da Annies Codes alle negiert sind."},
                {"who": "george", "text": "WHAT!?! Nicola! Was habe ich ihr gerade geschickt?"},
                {"who": "nicola", "text": "Hmm... Es scheint, Sie haben sie zu ihrem prächtigen Bart beglückwünscht ... ihre anzüglichen Ätzungen angefordert ... und sie angewiesen, den Feind im Morgengrauen anzugreifen."},
                {"who": "george", "text":"...\n In diesem Sinne werde ich zu meiner Residenz zurückkehren, um einige Zeit mit einer Flasche Brandy zu verbringen."},
                {"who": "ada", "text": "Charles! Geh und hilf ihm!\n\nWährend sie weg sind, könnt ihr zwei vielleicht helfen. Charles sollte zwei Rohre in diese Wand einbauen, aber sie hat nur eins. Ich brauche eine Verbindung von Norden nach Süden und von Westen nach Osten. Gibt es eine Möglichkeit, dass wir das machen können, ohne auf ein neues Rohr zu warten?"},
                {"who": "nicola", "text": "Gut, dass wir in einem Uhrwerk-Universum leben, denn ich glaube, ich habe eine Idee."}
            ],
            [
                {"who": "annie", "text": "Hallo Ada. Ist George da? Ich bin gekommen, um mit ihm über diese Maschine zu sprechen, die zu meinem Wohnsitz geliefert wurde"},
                {"who": "ada", "text": "Oh Annie! Es tut mir so leid. Er und Charles waren völlig unwissend über die Unterschiede im Codebuch."},
                {"who": "annie", "text": "Oh, das habe ich sofort herausgefunden. Sonst wäre es so eine dumme Farce geworden."},
                {"who": "ada", "text": "Nicola! Geh und hol George und Charles, wo auch immer sie hingekommen sind."},
                {"who": "annie", "text": "Dieses Poesiegerät, das sie gemacht haben, ist eine ganz wunderbare Vorrichtung. Die verwendeten Komponenten sind genial. Gertrude? Dieser Zähler. Ich nehme an, Sie waren an seiner Konstruktion beteiligt. Könnten Sie das Design so anpassen, dass man den Wert einstellen kann? Der neue Wert käme über den West-Port, und der Nord-Port wählt aus, ob der neue Wert verwendet werden soll."}
            ],
            [
                {"who": "ada", "text": "Ich muss schon sagen Annie, findest du das nicht alles etwas kompliziert?"},
                {"who": "annie", "text": "Ich schon, aber sieh nur, wie weit wir gekommen sind. Erinnerst du dich an die Woche, in der du versucht hast, die Kreuzotter zum Laufen zu bringen? Rückblickend sieht das alles jetzt so einfach aus. Nicht nur unsere Forschung hat Fortschritte gemacht, sondern ich denke, wir haben auch ein besseres Verständnis von Dampf."},
                {"who": "ada", "text": "Dann könnten Sie mir vielleicht dabei helfen, einen Ihrer Nachrichtenverschlüsse anzuschauen. Ich kann nicht herausfinden, was falsch ist. Alle Nachrichten von Lady Bechdel kommen als Unsinn heraus."},
                {"who": "annie", "text": "Interessant. Es scheint, dass der Zeitimpuls etwas zu früh kommt, bevor der Wert stabil geworden ist. Wenn ich den Impuls um etwas weniger als einen Tick verzögern könnte, dann würde das das Problem beheben. Es müsste eine sehr schnelle Verschiebung zwischen 0 und 100 PSI geben. Lassen Sie uns etwas machen."}
            ],
            [
                {"who": "annie", "text": "Was zeigt dieses Messgerät an?"},
                {"who": "ada", "text": "Das wäre der Dampfdruck, der zum Cogsworth-Uhrwerk geht. Warum?"},
                {"who": "annie", "text": "Schau. Das ist so ein merkwürdiges Muster. Sind die nicht auch geschlossen? Es ist schließlich Sonntag.\n\nEs springt für einen Tick auf 100 PSI, dann für einen weiteren Tick auf einen anderen Wert, bevor es wieder auf 0 PSI zurückgeht."},
                {"who": "ada", "text": "Das ist faszinierend. Ich frage mich, ob wir es entschlüsseln können."}
            ],
            [
                {"who": "nicola", "text": "Lady Chavvington! Ich habe die ganze Stadt abgesucht und konnte sie nicht ausfindig machen..."},
                {"who": "ada", "text": "Wir wissen, wo sie sind! George hat es geschafft, eine Nachricht zu uns durchzukommen, indem er einen Einlass ein- und ausschaltete. Sie wurden in der Dampfzentrale des Cogsworth-Uhrwerks eingesperrt. Lasst uns sofort dorthin gehen!"},
                {"who": "charles", "text":"[BANG] [BANG] [BANG] [BANG]\nHolt uns raus! Der Raum füllt sich mit Hochdruckdampf! Oh, die grausame Ironie, von der Sache getötet zu werden, die ich liebe."},
                {"who": "nicola", "text": "Der Schlüssel, der diese Tür öffnen sollte, funktioniert nicht! Es scheint, dass jemand auf das Schloss geschossen hat und ein Rohr im Inneren gebrochen ist! Ich weiß nichts über das Knacken von Schlössern, geschweige denn von kaputten."}
            ],
            [
                {"who": "charles", "text": "Gertrude! Ich kann Ihnen nicht genug danken, nicht nur dafür, dass Sie unser Leben gerettet haben, sondern auch dafür, dass Sie dies mit Hochdruckdampf getan haben!"},
                {"who": "ada", "text": "Liebling, wie bist du in diese furchtbare Situation geraten?"},
                {"who": "charles", "text": "George und ich genossen ein paar Drinks in der Old Brass Taverne, als die Dinge verschwammen. Das Nächste, woran ich mich erinnere, ist, dass ich in diesem Raum aufwachte und Cogsworth uns beschuldigte, sein Leben ruiniert zu haben. Nachdem er von der Akademie entlassen wurde, begannen seine Investoren Fragen zu stellen. Seine einzige Wahl war, uns zum Schweigen zu bringen, was ihm genug Zeit gab, das Geld seiner Investoren zu nehmen und einen eiligen Rückzug anzutreten.\n\nSchnell! Zum Flugplatz! Wir dürfen ihn nicht entkommen lassen."},
                {"who": "george", "text": "Dieses Rohr überträgt Startcodes von West nach Ost. Jeder von ihnen ist drei Codes lang und wird mit zwei Ticks pro Code übertragen. Sobald wir Cogsworths Code von 27, 39, 31 sehen, wissen wir, dass er hier ist und versucht, zu entkommen."},
                {"who": "ada", "text": "Dann wäre es zu spät. Bis dahin hat er die Starterlaubnis und könnte entkommen. Wir müssen dem Flugplatzleiter sagen, dass er nicht abfliegen darf."},
                {"who": "george", "text": "Leider ist der Manager durch eine Cogsworth-Maschine ersetzt worden. Wahrscheinlich eine kompromittierte. Wir dürfen nicht zulassen, dass Cogsworths Startcode durchkommt, aber wir dürfen auch nicht den Flugplatz stören, damit er nicht herausfindet, dass wir ihm auf der Spur sind. Wie wäre es, wenn wir das Signal um ein paar Ticks verzögern und wenn wir ihn sehen, könnten wir ihn entfernen. Das wird uns Zeit geben, ihn zu lokalisieren und festzunehmen."}
            ],
            [
                {"who": "ada", "text": "Endlich. Da Cogsworth hinter Gittern ist, können wir endlich unseren Steamputer fertigstellen.\n\nAlle Teile sind jetzt an ihrem Platz. Ich habe ein \"Programm\" geschrieben, um Fibonacci-Zahlen zu berechnen, aber die Ergebnisse sind falsch.\n\nWir werden die Komponenten verfeinern müssen, bis wir eine funktionierende Maschine haben. Es kann viel Zeit in die Diagnose und Feinabstimmung investiert werden."}
            ],
            [
                {"who": "charles", "text": "Es ist da! Die Antwort der Akademie.\n\n\"Wir danken Ihnen für die Einreichung des Steamputers zur Überprüfung durch die Akademie der Wissenschaften. Wir finden, dass er unser Wissen über die Dampfberechnung erheblich erweitert hat. Daher freuen wir uns, Ihnen mitteilen zu können, dass Ihr Antrag auf Mitgliedschaft genehmigt wurde!\""},
                {"who": "nicola", "text": "Herzlichen Glückwunsch Lady Chavvington."},
                {"who": "ada", "text": "Eigentlich war die Bewerbung nicht für mich. Es war im Auftrag von Gertrude.\n\nGertrude, du warst diejenige, die all diese Komponenten konstruiert hat und uns gezeigt hat, wie man Dampf zu wundersamen Zwecken manipulieren kann. Sie sind es, die anderen die Dampfberechnung beibringen sollte."},
                {"who": "charles", "text": "Huzzah!\n\nLasst uns heute Nachmittag feiern!"},
                {"who": "george", "text": "Lady Easley? Werden Sie uns zu diesem Anlass begleiten?"},
                {"who": "annie", "text": "Ich fürchte, ich kann nicht, denn ich habe heute Nachmittag eine Verabredung mit einem schneidigen Herrn."},
                {"wer": "george", "text": "Oh."},
                {"who": "annie", "text": "Das wärst du, George. Der Nachmittagstee in Madingley Hall wurde angeboten, und ich nehme dankend an." },
                {"who": "ada", "text": "Danke, dass Sie ComPressure spielen."}
            ]
        ],
        "hints":
        [
            [
                {"who": "charles", "text": "Klicken Sie mit der linken Maustaste und halten Sie sie gedrückt, um ein neues Rohr vom Startpunkt bis zum Ende zu platzieren. Wenn Sie ein neues Rohr über das alte ziehen, werden sie nicht verbunden. Wenn Sie etwas falsch machen, können Sie die Rohre mit der rechten Maustaste entfernen."}
            ],
            [
                {"who": "charles", "text": "Im Baumenü können Sie eine Dampfquelle platzieren, die Dampf mit 100 PSI liefert. Ein Rohr mit offenem Ende lässt den Druck auf 0 ab. Durch Anzapfen eines Rohrs irgendwo in der Mitte ist es möglich, einen Druck irgendwo dazwischen zu erzeugen."}
            ],
            [
                {"who": "charles", "text": "Das Build-Menü hat die Ventilkomponente. Indem Sie die \"+\"-Seite des Ventils mit Norden verbinden, kann der Eingang Norden steuern, wie offen das Ventil ist. Sie können dann einfach Ost und West verbinden, um die beiden zu verbinden, wenn Nord auf Hochdruck steht."}
            ],
            [
                {"who": "nicola", "text": "Wenn ich das richtig verstehe, müssen wir den Anschluss \"+\" des Ventils mit einer Hochdruck-Dampfquelle und den mit \"-\" gekennzeichneten Anschluss mit dem Eingang Süd verbinden. Dadurch werden Ost und West nur verbunden, wenn der Druck am Südanschluss niedrig ist. Wenn er hoch ist, wird das Ventil geschlossen."}
            ],
            [
                {"who": "nicola", "text": "Wenn der Eingang hoch ist, verbinden wir den Norden. Wie das geht, wissen wir von der Konstruktion \"Normalerweise offen\". Und wenn der Eingang niedrig ist, verbinden wir den Süden. Das ist unser \"Normalerweise geschlossen\"-Design."}
            ],
            [
                {"who": "nicola", "text": "Nun, beginnen wir mit den Grundlagen. Wenn der Eingang hoch ist, werden wir den Ausgang mit einer Dampfquelle verbinden. Wenn er niedrig ist, werden wir eine Verbindung zur Atmosphäre herstellen. Um eine Verbindung zur Atmosphäre herzustellen, lassen wir das Rohrende einfach offen. Wie Lady Chavvington bemerkte, sind die Ventile analog und es scheint, wenn die Werte zwischen 0 und 100 liegen, werden die Ventile teilweise geöffnet und stellen das exakte Verhältnis wieder her."}
            ],
            [
                {"who": "nicola", "text": "Dieses Mal, wenn der Eingang Hochdruck ist, wollen wir, dass er mit der Atmosphäre verbunden wird. Wenn der Eingang niedrig ist, liefern wir den Dampf. Unser Schalterentwurf konnte zwischen zwei Werten wählen. Diese Werte könnten Dampf und Atmosphäre sein."}
            ],
            [
                {"who": "nicola", "text": "Wir können Ventile verwenden, um zu messen, welcher von Nord und Süd höher ist. Wenn Nord höher ist, verbinden wir den Ausgang mit Dampf. Wenn Süd höher ist, verbinden wir ihn mit der Atmosphäre.\n\nDenken Sie daran, dass der Dampf in der Ausgangsleitung nicht von selbst abfließt, wir müssen ihn aktiv mit einem Ventil ablassen."}
            ],
            [
                {"who": "nicola", "text": "Ich denke, wir haben bereits einen Komparator, und wir haben eine Quelle für einen genauen Wert von 50."}
            ],
            [
                {"who": "nicola", "text": "Wenn der Eingang 100 ist, wollen wir, dass der Ausgang 50 ist. Also schließen wir unseren 50er-Generator mit einem Ventil an den Ausgang an. Und wenn der Eingang 0 ist, entlüften wir den Ausgang in die Atmosphäre."}
            ],
            [
                {"who": "nicola", "text": "Das klingt wieder nach unserem Pufferentwurf, aber wenn der Eingang 50 ist, soll der Ausgang 100 sein. Also sollte das Atmosphären-Entlüftungsventil geschlossen werden, sobald wir 50 erreichen. Ich denke, anstatt die 100 PSI auf der Seite des Entlüftungsventils zu verwenden, könnten wir es auf 50 umstellen. "}
            ],
            [
                {"who": "nicola", "text": "Ich kann mich nicht erinnern, dass hier noch andere Komponenten vorhanden sind. Ich denke, wir müssen nur das, was da ist, mit dem Ausgang verbinden."}
            ],
            [
                {"who": "nicola", "text": "Wenn wir den Ausgang durch unsere Verschlüsselungskomponente leiten, können wir feststellen, wie der Eingang gewesen sein muss.\n\nWenn die beiden Eingänge am Komparator gleich sind, wird der Ausgang weder unter Druck gesetzt, noch entlüftet. Wenn wir zu viel Wobble erhalten, sollten wir zu unserem Komparatorentwurf zurückgehen und ihn weniger stark machen."}
            ],
            [
                {"who": "nicola", "text": "Wir können denselben Trick wie bei unserem Entschlüsselungsentwurf anwenden. Wir erhöhen oder verringern den Betrag, den wir das Bodenventil öffnen, bis der Druck zwischen ihnen genau 50 beträgt. Wir haben einen Amp50, der dies tut."}
            ],
            [
                {"who": "nicola", "text": "Wir öffnen ein Ventil auf den Wert des West-Eingangs minus des Süd-Eingangs, wir können dann ein zweites Ventil auf den gleichen Öffnungsgrad öffnen, indem wir danach suchen, wann der Druck zwischen ihnen 50 beträgt."}
            ],
            [
                {"who": "nicola", "text": "Diese Aufgabe ist etwas schwieriger. Die Verwendung eines Subtraktors gibt uns zu viel Wobble.\n\nDer Vergleich des Ausgangs minus einem der Eingänge mit dem anderen Eingang schlägt fehl, wenn der zweite Eingang 0 ist und das Ventil vollständig geschlossen ist. Aber in diesem Fall können wir ein zweites Ventilpaar verwenden, um den gleichen Vergleich durchzuführen und die Eingänge zu schalten. Wir können dann einen Amp50 verwenden, um sicherzustellen, dass der Druck zwischen den vier Ventilen 50 PSI beträgt.\n\nKlicken Sie auf die Anforderungen, um ein Diagramm dieses Aufbaus zu sehen."}
            ],
            [
                {"who": "annie", "text": "Wenn der Eingang Süd hoch ist, öffnen wir unsere Speicherleitung. Wir können einen Puffer verwenden, um den Ausgang auf den gleichen Druck zu bringen, den wir erfasst haben. Wir müssen den Ausgang schließen, während der Eingang Süd hoch ist, damit sich der neue Druck nicht ausbreiten kann. Der einfachste Weg, dies zu gewährleisten, ist die Verwendung eines Schwellenwerts von 50 an den Timing- und Ausgangsventilen."}
            ],
            [
                {"who": "nicola", "text": "Der Ausgang ist der Wert eines Latchs, der vom Eingang Süd gesteuert wird. Der Eingang zum Latch ist entweder der Latch-Ausgang plus oder minus dem West-Eingang. Der Nord-Eingang wählt zwischen beiden aus. Wir haben einen Addierer, einen Subtrahierer und einen Schalter."}
            ],
            [
                {"who": "nicola", "text": "Zur Abwechslung ist ein Wobbeln eigentlich erwünscht. Verstärker in einer Ringkonfiguration machen die Konstruktion instabil und wackeln auf und ab."}
            ],
            [
                {"who": "nicola", "text": "Wenn West höher als Süd ist, beginnen Sie, mehr Dampf hinzuzufügen. Wenn West niedriger ist als Nord, beginnen Sie, mehr Dampf abzulassen."}
            ],
            [
                {"who": "nicola", "text": "Sie können Ventile in Reihe schalten. Nur wenn alle Ventile geöffnet sind, fließt Dampf durch."}
            ],
            [
                {"who": "nicola", "text": "Dies ist nicht viel anders als unser normales Latch-Design, außer dass der Ausgang und der Zeitimpuls nicht verbunden sind, wenn der North-Eingang niedrig ist."}
            ],
            [
                {"who": "nicola", "text": "Wenn der North-Select-Eingang größer als 50 ist, aktivieren wir einen Latch, ansonsten den anderen."}
            ],
            [
                {"who": "nicola", "text": "Wir brauchen so viele Auswahlsignale! Wie wäre es, wenn wir eine Reihe von Strömungsdetektoren mit Dampfeinlass an einem Ende und Atmosphäre am anderen Ende verketten? Das würde uns alle Werte liefern, die wir brauchen."}
            ],
            [
                {"who": "nicola", "text": "Wir können zwei Latch5-Elemente verwenden und zwischen ihnen umschalten, je nachdem, ob das Select unter oder über 50 liegt. Aber dann müssten wir den Select von einem der beiden Bereiche (0 - 50 oder 50 - 100) auf den Bereich skalieren, den das Latch5-Design einnimmt (0 - 100).\n\nIch denke, dass das Zoom-Element doch nützlich ist, aber in diesem Fall muss es vielleicht ziemlich leistungsfähig sein. Jeder Zoom würde mit fünf Durchflussdetektoren verbunden sein, und es wird eine Weile dauern, um all diese Rohre unter Druck zu setzen. Um eine Konstruktion stärker zu machen, könnten wir sie einfach duplizieren."}
            ],
            [
                {"who": "ada", "text": "Es sollte so einfach sein wie ein Komparator und ein Schalter."}
            ],
            [
                {"who": "ada", "text": "Ist das nicht genau das Gleiche wie unsere Min-Komponente, nur andersherum ausgewählt?"}
            ],
            [
                {"who": "charles", "text": "Wir können mit einem langen Entlüftungsrohr einen Wert von 90 PSI bilden. Ein Komparator zwischen diesem und unserem Eingang wird uns sagen, wann wir den Behälter entlüften müssen. Wenn unser Komparatordruck von 0 PSI auf 50 PSI ansteigt, sollte er den Eingang abschließen. Sobald er über 50 PSI ansteigt, sollte er ein Ventil öffnen, um den Inhalt des Behälters an die Atmosphäre abzugeben."}
            ],
            [
                {"who": "george", "text": "Wir können einen Addierer mit einem statischen 10 PSI an einem Eingang verwenden. Dann verwenden Sie ein Latch, um den neuen Wert zu erfassen. Schließlich wird eine Fuse in der Schleife den Zähler auf 0 PSI zurücksetzen."}
            ],
            [
                {"who": "george", "text": "Wir können die gleiche Methode verwenden, die wir im Latch10-Design verwendet haben, um zwischen zehn Werten zu wählen. Jeder Wert muss kundenspezifisch angefertigt und bei Auswahl mit dem Ausgang verbunden werden. Dies beinhaltet mehrere benutzerdefinierte Designs."}
            ],
            [
                {"who": "george", "text": "Wir können unseren Zähler mit dem ROM verbinden, aber zuerst müssen wir 5 mit einem Addierer addieren."}
            ],
            [
                {"who": "nicola", "text": "Wenn wir einen Ring aus Amp50-Komponenten mit einer Inversion irgendwo bilden, können wir einen regelmäßigen Beat erhalten. Sobald wir ihn in der Nähe haben, können wir ihn durch Hinzufügen von Pipe-Elementen abstimmen, um ihn etwas zu verlangsamen."}
            ],
            [
                {"who": "nicola", "text": "Eine Uhr kann zwischen den beiden Eingängen wählen und auf der anderen Seite der Wand kann eine synchronisierte Uhr zwischen den Ausgängen wählen. Allerdings sollten wir nicht beide Eingänge miteinander verbinden. In dem Moment, in dem wir einen öffnen, sollte der zweite verschlossen sein. Wir können einen 50 PSI als Referenz verwenden."}
            ],
            [
                {"who": "annie", "text": "Wir können den Zähler so ändern, dass ein Schalter eingefügt wird, um zwischen einem neuen Wert oder dem inkrementierten Wert zu wählen."}
            ],
            [
                {"who": "annie", "text": "Wir müssen nur Werte von 0 PSI und 100 PSI verzögern. Eine Kette von Amp50-Elementen wird den Impuls verzögern, mit einigen kleinen Anpassungen."}
            ],
            [
                {"who": "annie", "text": "Ein Verzögerungselement wird uns den benötigten Zeitimpuls liefern. Sobald wir den verzögerten Impuls sehen, können wir den Wert erfassen, aber auch den Verzögerungseingang auf 0 PSI zwingen."}
            ],
            [
                {"who": "nicola", "text": "Anstatt das Loch einfach zu stopfen, könnten wir es auf 100 PSI befestigen. Das würde es einfacher machen. Um einen Dampfschlüssel herzustellen, kann man die Drücke, die sich im Inneren des Schlosses bilden, nachbilden."}
            ],
            [
                {"who": "george", "text": "Wir benötigen drei Latches, um den Eingang ausreichend zu verzögern. Ein Taktgenerator mit einer benutzerdefinierten zusätzlichen Verzögerung kann sie takten. Um zu erkennen, ob alle Werte korrekt sind, kann ein Rohr langsam gefüllt werden und wenn irgendein Latch-Wert entweder größer oder kleiner als der gesuchte Wert ist, kann er das Rohr entlüften."}
            ],
            [
                {"who": "ada", "text": "Nehmen Sie sich Zeit und verstehen Sie, wie die Maschine funktioniert. Wenn Sie das getan haben, können Sie Ihre Entwürfe so verbessern, dass sie den Betrieb des Steamputers verbessern."}
            ],
            [
                {"who": "ada", "text": "Keine weiteren Hinweise. Genießen Sie Ihren Gewinn."}
            ]
        ]
    },
   "日本語":
   {
        "tooltips":
        {
            "Save" : "Save",
            "Restore" : "リストア",
            "Best solution" : "「ベストソリューション",
            "Customize" : "カスタマイズ",
            "Import Level" : "輸入レベル」のことです",
            "Delete" : "削除",
            "Copy design\nto current" : "Copy design\nto current",
            "Delete level" : "Delete level",
            "Return" : "戻る",
            "Level Editor" : "レベルエディター",
            "Level select" : "レベルセレクト",
            "Design" : "デザイン",
            "Test" : "テスト",
            "Experiment" : "実験",
            "Score" : "スコア",
            "Help" : "ヘルプ",
            "Repeat\ndialogue" : "Repeat\ndialogue",
            "Hint" : "Hint",
            "New Design" : "新しいデザイン",
            "Valve" : "バルブ」のことです",
            "Steam Inlet" : "スチームインレット",
            "Rotate left" : "Rotate left",
            "Rotate right" : "Rotate right",
            "Reflect\nvertically"       :   "Reflect\nvertically",
            "Reflect\nhorizontally"     :   "Reflect\nhorizontally",
            "Lock Blocks" : "Lock Blocks",
            "Add sign" : "Add sign",
            "Stop tests" : "テストの停止",
            "Repeat 1 test" : "のことです",
            "Run all tests" : "すべてのテストを実行する",
            "Export to\nclipboard" : "○○クリップボードに書き出す",
            "Import from\nclipboard" : "○○クリップボードからインポート」と表示されます",
            "Accuracy mode" : "Accuracy mode",
            "Price mode" : "価格モード」のことです",
            "Steam mode" : "Steam mode",
            "Confirm" : "確認",
            "Cancel" : "キャンセル",
            "Exit" : "出口",
            "Full Screen" : "フルスクリーン",
            "Join our Discord group" : "Join our Discord group",
            "Info" : "情報",
            "Select language" : "言語の選択",
            "If you are stuck, consider discussing your challenges with the brightest minds of our High Pressure Steam Society on Discord. Press Esc and click the \"Join our Discord group\" button." :
                                            "もし行き詰ったら、DiscordでHigh Pressure Steam Societyの聡明な頭脳と課題を議論することを検討してください。Escキーを押しながら「Join our Discord group」ボタンをクリックしてください",
            "Alas our journey must stop somewhere. The adventure continues\nin the full game.\n\nTo be continued..." :
                                            "残念ながら我々の旅はどこかで止まらなければならない。冒険はゲーム本編で＿＿＿続きます。続きはこちら",
            "Cross" : "クロス」",
            "50"   :   "50",
            "Normally Open" : "Normally Open",
            "Normally Closed" : "Normally Closed",
            "Switch": "スイッチ",
            "Buffer" : "バッファ",
            "Inverter" : "インバーター",
            "Comparator" : "コンパレータ",
            "Amp50" : "Amp50",
            "Div2" : "Div2",
            "Mul2" : "Mul2",
            "Encrypt" : "エンクリプト",
            "Decrypt" : "デクリプト",
            "Sensor" : "センサー",
            "Subtractor" : "サブトラクター",
            "Adder" : "アダー",
            "Latch" : "ラッチ",
            "Tabulator" : "Tabulator",
            "Broken Link" : "を参照してください",
            "Zoom" : "ズーム",
            "Flow Detector":"フローディテクター",
            "LatchE" : "LatchE",
            "Latch2" : "Latch2",
            "Latch5" : "Latch5",
            "Latch10" : "Latch10",
            "Min" : "ミニ です",
            "Max" : "マックス",
            "Fuse" : "Fuse",
            "Counter" : "カウンター",
            "ROM" : "ROM",
            "Poem" : "ポエム",
            "Clock" : "時計」のことです",
            "Cross v2" : "Cross v2",
            "CounterE" : "CounterE",
            "Delay" : "ディレイ",
            "Self-timed latch" : "Self-timed latch",
            "Lock Picking" : "ロックピッキング",
            "Code filter" : "コードフィルター」のことです",
            "Steamputer" : "Steamputer",
            "END" : "エンド"

        },
        "help":
        [
            "レベルセレクト メニューでは、一番下のパネルにデザインの要求事項が書かれています。各デザインには4つのポートがあり、要件には他のポートに関して期待される出力が記載されています。各ポートにはカラーの識別子がついています。要件をクリックするとヒントが表示されます",
            "すべてのテストに合格すると、次のデザインが使えるようになります。あなたはいつでも自分のソリューションを改良するために戻ってくることができます。___ 下のパイプボタンを押して、チュートリアルを続けてください。F1を押すと、ヘルプに戻ることができます。",
            "パイプの敷設は、マウスの左ボタンでパイプを敷設元から敷設先にドラッグするか、マウスの左ボタンをクリックしてマウスの方向にパイプを伸ばすことで行うことができます。右クリックでパイプ敷設モードをキャンセルできます。",
            "マウスの右ボタンを押したまま、パイプなどの要素を削除する",
            "ビルド \"メニューでは、デザインにコンポーネントを追加することができます。スチームインレットコンポーネントを選択し、デザインの上にカーソルを置きます。矢印ボタンで向きを変えることができます。この操作は、QとEキー、またはマウスのスクロールホイールでも行えます。マウスの左ボタンをクリックすると、コンポーネントが配置されます。右クリックで蒸気インレット配置モードを終了します",
            "バルブ \"も同様の方法で配置できます。Tab、またはマウスの中ボタンを押すと、バルブの配置モードに入るショートカットです。もう一度Tab、またはマウスの中ボタンを押すと、蒸気口の配置に切り替わります。",
            "蒸気口は圧力100で蒸気を供給します。端が開いているパイプは、圧力0で蒸気を大気に放出します",
            "パイプの接続部には、異なるポイントでの圧力が見える。それぞれのパイプに少しの抵抗があることに注意してください",
            "バルブは、バルブの(+)側が(-)側よりも高い圧力であれば、蒸気を通過させることができます。高ければ高いほど、バルブは開きます。(+)側と(-)側の蒸気は消費されません。___\nここでは、（-）側は大気に排出されているため、圧力は0です。(+)が100PSI、(-)が0PSIの場合、バルブは100%開いています。(+)が75、(-)が25の場合、バルブは50%の開度になります",
            "（＋）側の圧力が（-）側と同等かそれ以下の場合、バルブは閉じた状態になり、蒸気は通過しません。",
            "蒸気口で(+)側を加圧することにより、(-)側の圧力が100PSIよりも低い場合にのみ、バルブは開状態になります。___ _ 前のように、バルブの開度は、(+)側の圧力から(-)側の圧力を引いたものです",
            "(-)側に高圧をかけると、(-)側の圧力が(+)側と同等かそれ以上になってバルブが閉まる",
            "テスト \"メニューでは、デザインの性能を検査することができます。最初の3つのボタンは、それぞれテストの一時停止、1つのテストの繰り返し実行、すべてのテストの実行を行います。また、ホットキー1、2、3を使用することもできます。個々のテストの現在のスコアが表示されます。右側には、すべてのテストの中で最も悪いものから形成された最終スコアが表示されます",
            "次のパネルは、現在のテストの入力と期待される出力のシーケンスを示しています。現在のフェーズがハイライトされています。前回の実行時に記録された出力が右側に表示されています。Spaceを押すと、次のフェーズに早送りできます。グラフは、テストの最終段階での出力値を示しています。グラフの中の色あせた線は、これまでのベストデザインの経路を示しています",
            "experiment \"メニューでは、ポートを手動で設定し、デザインの動作を検証することができます。縦のスライダで希望の値を設定します。下の水平方向のスライダは、入力の力を設定します。スライダーを左いっぱいにすると出力になります。初期値は現在のテストから設定されています",
            "下部のグラフは、ポート値の履歴を示しています。",
            "コンポーネントは、Ctrlを押しながらのクリック、またはShiftを押しながらのドラッグで選択できます。選択されたコンポーネントはWASDキーで移動でき、移動先が空の場合はQとEで回転させることができます。コピー＆ペーストのキーはC はコピー、X はカット、V はペーストを意味します。選択したコンポーネントを削除するには、Delete キーを押します。元に戻すには Z キー（Ctrl はオプション）、やり直しには Y または Shift+Z キーを使用します。元に戻すには、マウスの右ボタンを押しながら左ボタンをクリックすることでもできます",
            "Esc \"を押すと、ゲームメニューが表示されます。ボタンでは、ゲームの終了、ウィンドウ/フルスクリーンの切り替え、Discordグループへの参加、クレジットの表示ができます。___\nスライダーは、効果音や音楽の音量を調整します。",
            "完成したデザインは、部品として使用することができます。利用可能なコンポーネントはビルドメニューに表示されます。デザインを変更すると、すべてのコンポーネントの実装が更新されます。___\nコンポーネントをダブルクリックすると、そのコンポーネントを検査することができます。左上のデザイン・アイコンをクリックすると、スタックにポップアップで戻ることができます。インスペクション中にカスタマイズボタンを押すと、編集可能なローカルデザインが作成され、オリジナルが変更されても更新されなくなります。このことを示すために、デザインは赤に変わります",
            "デザインを保存するスロットが4つあります。一番良いデザインも保存されるので、後で呼び出すことができます。クリップボードの文字列を使ってデザインを交換することができます。彼らのデザインを見ることができます",
            "特定の圧力 \"を作り出す方法のひとつとして、配管内に特定の比率で同時に供給と排出を行う方法がある。バルブの開度は、＋側の圧力から-側の圧力を引いた値になります。ここで、Pはバルブのプラス側の圧力、Nはマイナス側の圧力を表しています。ここでは、下側のバルブの開度を40（60-20）としています",
            "この配置で発生する圧力は、パーセントで言うと、供給弁の開度を両方の弁の開度の合計で割ったものです。___ 圧力 = S / (S + V)\n___ ここで、Sは供給バルブの開度、Vは排出バルブの開度です。___ この場合、Supplyは40（40 - 0）。ベントも40（60 - 20）です。この間の期待値は40 / (40 + 40) = 50%、つまり50PSI」となります",
            "3つの採点モードが用意されています。デフォルト（Accuracy）モードでは、（最悪のテストに対する）目標値への近さを採点します。＿＿＿価格モードは、デザインをコストでランク付けします。パイプは1ポートにつき1ポンド、バルブは10ポンド、スチームインレットは5ポンドです。各サブデザインには4ポンドの追加料金がかかります。___\n蒸気モードでは、蒸気インレットから供給される蒸気の量を測定します",
            "ユーザー定義のレベルを作成することができます。これらのレベルには、ユーザー定義のアイコンとテストがあり、クリップボードを通じて交換することができます。テストとテストステップは、+/-ボタンで追加／削除できます。ステップごとの時間は設定可能です。すべてのテストを再生する際に、一部のステップをスキップできる場合は、「skip all」ボタンで開始するサブテストを選択します。デザインのリセットは、すべてのテストで行うことも、プレイワンテストモードでのみ行うことも可能です。ポートのアイコンは、使用するポートを選択します。値の左にあるポートをクリックすると、出力として使われるポートが選択されます。値の変更は実験メニューで行います。"
        ],
        "dialogue":
        [
            [
                {"who": "charles", "text": "Gertrude!私の名前はチャールズ・チャヴィントン、この高圧蒸気機関のオーナーです。ここから街の半分に高圧蒸気を供給し、蒸気傘や蒸気木琴などあらゆるものを動かしています。亡き妻エイダは、蒸気の数学的特性の研究を、私たちとの時間を超えて続けるようにと定めていました。それが、あなたが私に雇われた理由です。君の仕事は、彼女の遺産を守り、この科学的探求を続けることだ」。"},
                {"who": "charles", "text": "あなたはこれまでの学習で初歩的な蒸気工学を習得していると思いますが、彼女の研究室へのアクセスを許可する前に、まず基本的な蒸気管の構造に習熟していることを証明してください。西の発電機を東の設備に、北の発電機を南の設備に接続してください。どんな場合でも、パイプを一緒に接続してはいけません。そんなことをすれば、南側の施設に無料で蒸気を供給することになり、彼らは請求書を期限内に支払うことができないのだ！」｝。"},
                {"who": "charles", "text": "高圧蒸気管についてよくわからない場合は、右上の「？」マークのところにエンジニアリングマニュアルがありますので、そちらをご覧ください。"}
            ],
            [
                {"who": "charles", "text": "Darn it!エイダの研究室のセキュリティドアは、低圧蒸気で操作されているのだ。彼女がどうやってこの爆発したドアを開けるのか、私には理解できませんでした。___ _ ここGeneral High Pressure Steam Worksでは、1平方インチあたり100ポンドの蒸気を発生させています。このドアはムーアハウス社の低圧蒸気を使用しており、1平方インチあたり50ポンド（PSI）で作動します。あの変態的なムーアハウス社の蒸気を私の敷地内に配管したら、とんでもないことになりますよ！」｝。"},
                {"who": "charles", "text": "50PSIの低圧蒸気を魔法で供給できない限り、諦めた方がいいかもしれません。ビルドメニューの中に、100PSIの高圧蒸気を大量に供給できる蒸気口があります。その上にスパナのマークがついています。Tabキーを2回押してもアクセスできます」。"}
            ],
            [
                {"who": "charles", "text": "By Jove!やりましたね。せっかくの蒸気を無駄にしてしまったが、これで仕事ができた。整理されていないことをお詫びしますが、一部のチンピラが侵入してひどい状態になっています。この実験室で、私の愛するエイダは、私が彼女の仕様に合わせて作ったバルブの実験を行った。印のポートに高圧蒸気をたっぷりと当てれば、バルブが開き、印のない2つの端の間を蒸気が自由に行き来することができるのです」。"},
                {"who": "charles", "text": "Give it a try.西と東をつなぐ。ただし、北が高気圧のときに限る」｝。"}
            ],
            [
                {"who": "nicola", "text": "Impressive!" },
                {"who": "charles", "text": "ああ、ニコラ、ちょうどいいところに来たね。ガートルード、ニコラは君のアシスタントだ。彼はすでにエイダが残したノートの勉強を始めています。さて、次の部分は、古い灰色の脳には少し難しいです。バルブが開くのは、「＋」が「-」側よりも高い圧力を受けているときだけです。"},
                {"who": "charles", "text": "Adaから、コントロールパイプに高圧をかけたときに閉じるバルブを作れるように、これを追加してほしいと頼まれました。これらのバルブがまだ正しく動作するかどうか見てみましょう"}
            ],
            [
                {"who": "charles", "text": "Excellent!さて、この2つの設計を組み合わせると、2つのソースを切り替えるコンポーネントを構築することができます。しかし、西のコントロールハウスが0PSIの大気圧の時は、南の発電機を東の設備に接続する必要があります。"},
                {"who": "nicola", "text": "What happens when the control house supplies a pressure between 0 and 100?"},
                {"who": "charles", "text": "えっ！！？それは低圧蒸気のことです。私たちは低圧の蒸気で仕事をしているわけではない。私は低圧蒸気を人々に提供して財を成したわけではありません。低圧蒸気のことは気にしないでください。西の制御が高圧の場合は 北の発電機を接続し- そうでなければ南の発電機を接続する"}
            ],
            [
                {"who": "nicola", "text": "Lady Chavvingtonのノートには、研究室とLady Easleyの住居の間に通信用の蒸気接続があったことが書かれている。"},
                {"who": "charles", "text": "はい、除去しました。新しい手順です。高圧蒸気があまりにも多く行方不明になっていました。私たちの施設から出ることが許されている蒸気は、計量されて有料のお客様に提供されるものだけです。私の高圧蒸気はこの壁から出てはいけません」。"},
                {"who": "nicola", "text": "蒸気を出さなくても、まだ接続できると思います。このノートによると..."},
                {"who": "charles", "text": "Hah! Impossible!これは初歩的な蒸気学だよ。蒸気の通信は蒸気の移動に依存しており、汝は私の蒸気を一切「移動」してはならない。私は他の場所で必要とされています。この件は、私の消えた蒸気の調査ほど緊急ではないようだ。"},
                {"who": "nicola", "text": "Lady Chavvingtonによると、チャールズはあまり聞き上手ではなかったようです。彼女はそのデザインを詳細に説明しています」。"},
                {"who": "ada", "text": "6月5日_今日は、素晴らしい圧力再現装置を作りました。特定の値の圧力を作り出すために、蒸気を供給するバルブと排出するバルブを正確な比率で使用しました。蒸気用のバルブを80％、大気開放用のバルブを20％開くことで、元の圧力である80PSIを再現することができました。チャールズのバルブは、「＋」側の圧力から「-」側の圧力を引いた分だけ開くようです。"},
                {"who": "ada", "text": "これは、全範囲の値に対して、最小限のエラーで動作するように見えます。その絶縁特性から、私はこれを「バッファー」と呼ぶことにします。私はチャールズにこのアイデアを説明しましたが、彼は会社の利益の問題で頭がいっぱいでした」。"},
                {"who": "nicola", "text": "オリジナルデザインの一部がまだ壁に取り付けられたままになっているようです。イーズリー様の蒸気で壁の向こうの機器を動かすことができれば、チャールズも文句はないでしょう」。"}
            ],
            [
                {"who": "nicola", "text": "完璧ではないけれど、いつでも戻ってきて改善することができる。魅力的ですよね。バルブの組み合わせで、あらゆる圧力値を再現します。入力された圧力は、出力パイプ内の圧力を正しく再現するために、蒸気入口バルブと大気開放バルブを正確なレベルで開きます"},
                {"who": "annie", "text":"[しばらくしてから]\nYou gave me so scare!一瞬、エイダが墓の向こうから話しかけているのかと思ったよ」"},
                {"who": "nicola", "text": "Our apologies Lady Easley.私たちはチャビントン夫人の研究を続けようとしています。コードブックによると「こんにちは」という意味の80PSIを送ろうとしていたのですが..."},
                {"who": "annie", "text": "No! 80PSIは「助けて!私は死後の世界に閉じ込められています！」という意味です。こんにちは」を意味するのは20PSIです。___ _ エイダがシステムを設置したとき、彼女はバルブを間違えて、すべての圧力を逆さまに受け取ってしまいました。この問題を調査したときに、彼女は蒸気の可能性についてひらめきました。私たちはそれを修正することなく、代わりに私はコードブックのすべての圧力値を反転させました」｝。"},
                {"who": "nicola", "text": "面白いですね。同じ間違いをしないか見てみましょう」。"}
            ],
            [
                {"who": "charles", "text": "Drat!エイダが作った圧力比較器がどうしても見つかりません。高名な高圧蒸気協会は、毎年、すべての高圧蒸気機関の圧力を比較して、最も高い圧力の蒸気を供給している機関を決定している。正確な比較器がなければ、今年の大会は中止せざるを得ません。___ _ 5年間の優勝記録が台無しになってしまう！？彼女はきっとどこかに別のものを持っていたのでしょう...」｝。"},
                {"who": "nicola", "text": "頑張ってみましょう、でないと彼はずっと邪魔をしてきますよ..." },
                {"who": "charles", "text": "What was that you say, boy?" },
                {"who": "nicola", "text": "I said we could make one, sir." },
                {"who": "charles", "text": "Splendid!ただ、一方の入力が他方の入力よりも大きいときに出力を高圧蒸気に接続するだけでは不十分で、逆のときには出力を排出しなければなりません。私のパイプは完全に密閉されていて、バルブを開けてガス抜きをしない限り、蒸気が漏れることはありません」｝。"}
            ],
            [
                {"who": "charles", "text": "Excellent!こんなに精密なんだ。クリケットのピッチにかかる羽の圧力を検知できると思います。高圧蒸気協会に入会するためには、高圧蒸気を発生させる蒸気装置であることを証明しなければなりません」。"},
                {"who": "charles", "text": "ここGeneral High Pressure Steam Worksでは、100 PSIの高圧蒸気を製造していますが、これは私が真の高圧蒸気と認める唯一の圧力です。しかし、技術的には50 PSI以上の圧力の蒸気はすべて高圧蒸気とみなされます。高圧蒸気協会の会長である私の責任は、低圧蒸気を発生させる劣悪な変質者が入会できないようにすることです"},
                {"who": "nicola", "text": "ツールボックスには、あなたのデザインした50PSIの蒸気発生器がまだあります。すでに作ったデザインを部品として使うことができます」。"}
            ],
            [
                {"who": "charles", "text": "Bravo!この装置があれば、低圧蒸気発生装置を我々の排他的な社会から締め出すことができる」｝。"},
                {"who": "nicola", "text": "How many members are there some far?"},
                {"who": "charles", "text": "Well...一つ目は...\"非常に限定的 \"と言った通りです。___\nいずれにしても、レセプションの飲み物に乗り遅れないように、そろそろ失礼します！"},
                {"who": "nicola", "text": "ついに...チャールズがそれを見つけたら、喜んではいられないだろう。見てください」。"},
                {"who": "ada", "text": "6月17日＿＿＿ムーアハウス卿の屋敷へのパイプラインが完成したので、高域の圧力値（0〜100）を低圧システムで許容できる値（0〜50）に圧縮する装置の開発に着手しています。驚いたことに、ムーアハウス卿の低圧蒸気を動力源とし、なおかつ100PSIを基準入力とした場合、圧力バッファは入力圧力を正確に1/2に縮小することができた。"},
                {"who": "nicola", "text": "Really!!!!そんなのうまくいくわけないじゃないですか" }
            ],
            [
                {"who": "nicola", "text": "Astonishing!さて、これで半分が終わりました。送ることはできても、今度は受け取ることが必要です。相手の蒸気圧をこちらの範囲まで増幅しなければなりません。チャビントン夫人によれば 100PSIの蒸気を使うが 基準圧力は50PSIだ"}
            ],
            [
                {"who": "nicola", "text": "Let's see if this works.___ 80 PSI [Hello]\n55 PSI [Request meeting]\n57 PSI [Afternoon tea at Madingley Hall]"},
                {"who": "george", "text":"...___ 23 PSI [Negative]\n...___ 6 psi [6]\n12 psi [/]\n7 psi [7]"},
                {"who": "nicola", "text": "What?!6/7?日記を見てみましょう。6月7日のエントリーには 圧力インバーターの設計について書かれています圧力が逆になっていたら どうやってコミュニケーションを取っていたんだろう？  もちろんです！_ _ すみません植民地での生活が長すぎましたこれが正しいエントリーです。"},
                {"who": "ada", "text": "7月6日＿＿＿通信が遮断されたのではないか！？ムーアハウス卿は、何日もかけて懇願した結果、私たちの研究活動を統合することに同意した。私たちは蒸気通信機を使って、それぞれの研究室のドアのコードを交換した。その数時間後、私たちの家に手渡しのメモが届き、彼の研究室が荒らされたので、私はもう歓迎されないという内容だった。慌てて行ってみると、私の研究室も荒らされていました。多くの仕事を失った」。"},
                {"who": "ada", "text": "I saved the code secure.きっとチャールズはそんなことはしないだろう。私はすぐに研究室のドアを交換してもらった。チャールズはムーアハウスのスチームドアを操作するくらいなら、死んだほうがましだと思っています」。"},
                {"who": "ada", "text": "ここはもう安全ではありません。私は妹に連絡を取り、私がもうすぐ到着することを伝えた。私たちの通信を安全に保つための新しい暗号化システムを試すのに最適なタイミングでした。チャールズが彼女の家につながるパイプにつけると約束したサインはまだ受け取っていない。彼は忘れっぽいところがあるからね」。"},
                {"who": "nicola", "text": "それが彼女の最後の日記でした。______ あららそのパイプがどこかにつながっているとは思わなかったので、その部品を他のデザインに使いました。幸い、いくつかは溶接されていたので、そのままにしておきました。暗号化装置はほぼ機能しているようです。"}
            ],
            [
                {"who": "nicola", "text": "Well that was simple.暗号は単純にアンバランスなバッファーである。しかし、このような暗号を正確に反転させるデザインをどうやって作ることができるでしょうか？彼女の協力が得られるかどうか、問い合わせてみます。___ ..."},
                {"who": "annie", "text": "エイダの書類の中に、メイディングリーホールのティールームで使われたナプキンがありましたか？日付は6月24日だったと思います。王立協会の新しい論文「単調系列の収束」について議論していたとき、エイダはナプキンに何かを書き留め始めたのです。そして、解読問題を解決したかもしれないと叫んで飛び出していった。その時、彼女は自分が解読問題を解決したかもしれないと叫んで走り出した。"},
                {"who": "ada", "text": "June 24th\n値を推測し、それを暗号化し、暗号化された入力と比較することを繰り返すことで、復号化装置を形成することができます。入力値が高ければ推測値を大きくし、低ければ小さくする。逆に入力が少なければ、推測値を小さくする。このような装置は、多くの機能を反転させることができます。でも、今年の高圧蒸気学会の前には、忘れずに彼に返さなければなりません」。"},
                {"who": "nicola", "text": "At least we know where his comparator got to"}
            ],
            [
                {"who": "nicola", "text": "信じられない!この技術を使えば、すべてのデザインの精度を上げることができる。チャビントン夫人の妹は、この技術についてもっと情報を持っているに違いない。＿＿＿ 80 PSI [Hello]"},
                {"who": "ada", "text": "80 PSI [Hello]\n93 PSI [This is Ada Chavvington]\n"},
                {"who": "nicola", "text": "60 PSI [Who?]\n73 PSI [Repeat]"},
                {"who": "ada", "text": "25 PSI [A], 28 PSI [D], 25 PSI [A]\n24 PSI [_]\n27 PSI [C], 32 PSI [H], 25 PSI [A], 46 PSI [V], 46 PSI [V], 33 PSI [I], 38 PSI [N], 31 PSI [G], 44 PSI [T], 39 PSI [O], 38 PSI [N]"},
                {"who": "nicola", "text": "This is unexpected.すぐにChavvington卿に報告しなければなりません。___ ...チャビントン卿！チャビントン夫人の妹の家に接続しましたが相手はチャビントン夫人本人だと言っています！"},
                {"who": "charles", "text": "Ah, yes, that would be Ada."},
                {"who": "nicola", "text": "B...でもチャビントン卿、エイダは死んだって言ってたわよね」｝。"},
                {"who": "charles", "text": "何を言っているんだ！？エイダは完全に元気で、高圧蒸気がなくなった件が解決するまで姉のところにいる」｝。"},
                {"who": "nicola", "text": "あなたは彼女を「親愛なる故人」と呼んだ"},
                {"who": "charles", "text": "Yes...。彼女は出発しました...姉のところへ..." },
                {"who": "nicola", "text": "Everyone assumed she died..."},
                {"who": "charles", "text": "Hmm....そうですね...。よくよく考えてみると、私の死を悼む花やカードの説明がつきます。私の高圧蒸気を失ったことを心配してくださった方々に感動しました。(´・ω・`)それにしても。早く蒸気計算機を完成させてくれれば、すぐにでも真相を究明することができます。急いで研究を続けてください」｝。"},
                {"who": "ada", "text": "6月27日\nムーアハウス卿と共に、蒸気計算の研究に大きな進展がありました。それまでの設計では、不正確な点がありました。バルブのバランスが完璧で、出力が50の場合にのみ、完璧な結果が得られました。これを見て、私はあることを思いつきました。蒸気を排出するもう一つのバルブを設置し、そのバルブの開度を調整することで、どのバルブがどれだけ開いているかを知ることができるのです。二つの弁が同じように開いているときだけ、二つの弁の間の圧力は正確に50になります。あとはそれになるように調整すればよいのです」。"},
                {"who": "ada", "text": "これを使って、ムーアハウス卿は蒸気圧を加える部品を作ることができました。___\nLord Moorhouseは最も恥ずかしがり屋ですが、鞭のように賢いので、残念ながら自分の革新技術を共有するのを恐れてしまうことがよくあります。"}
            ],
            [
                {"who": "nicola", "text": "うまくいきました。バルブがどれだけ開いているかを感知できるようになりましたが、これでどうやって蒸気の計算に近づけるのかわかりません。ムーアハウス卿に聞いてみましょうか」。"},
                {"who": "nicola", "text": "Lord Moorhouse.お声をかけていただき、ありがとうございます。彼女が不在の間、チャビントン夫人の蒸気計算の仕事を続けようとしています。あなただけが圧力付加装置の構造を知っていますどうか私たちに教えてください。"},
                {"who": "george", "text": "I do agree.考えてみると、彼女がチャールズと結託して私に反抗しても、知識の進歩は続けなければならない。私は、彼女がチャールズから安全であることを保証する代わりに、足し算の秘密を公開します。このホールでの噂を聞くと、彼女は彼の手で死んだのではないかと思います」。"},
                {"who": "nicola", "text": "Lady Chavvington is alive and well, staying with her sister."},
                {"who": "george", "text": "これで安心だ。彼女があの高圧の死の罠にこれ以上いると思うと、私は夜も眠れません。もし、あの高圧タンカーが爆発したら......考えたくもないが、その破壊力は計り知れないだろう。世界からこの高圧の恐怖がなくなるまで、私は休むことができません...。追加設計です。作る前に、引き算のものを作らなければなりません。バルブは、(+)側の圧力から(-)側の圧力を引いた分だけ開くものです。そんなバルブを作ったら、その開き具合を測ってみましょう」。"},
                {"who": "george", "text": "But now, you must leave leave.エイダの安全を確保した上で、私は重要な仕事の準備をしなければなりません」。"}
            ],
            [
                {"who": "charles", "text": "エイダさんに頼まれていたパイプのサインを持ってきました"},
                {"who": "nicola", "text": "That must have been months ago."},
                {"who": "charles", "text": "そうですね、Chavvingtonが何かをすると言ったら、それは実行されます。毎月、彼に思い出させる必要はありません。___ _ 私からのメッセージを彼女に送ってもらえませんか？___ \n80, 94, 76, 52, 68, 70"},
                {"who": "nicola", "text": "I see you have learned the codes!" },
                {"who": "charles", "text": "学んだ？私がデザインしたんだ！」。兵役中のことです。隊長の間で交わされる最も頻繁なメッセージの組み合わせ。___\nBe a good chap and send it off at once." },
                {"who": "nicola", "text": "80 PSI [Hello]\n94 PSI [This is Charles Chavvington]\n76 PSI [My sweetest angel]\n52 PSI [My heart yearns for you]\n68 PSI [I longly awns for your return]\n70 PSI [Without you life has lost all meaning]"},
                {"who": "charles", "text": "よし、これで減算器の設計は完了だな。素晴らしいですね。親愛なるエイダがかつて言ったように..."},
                {"who": "nicola", "text": "先生！その言い方はやめたほうがいいですよ。人はあなたを殺人者と思い始めています..."},
                {"who": "charles", "text": "Hmm....そうですね。加算器は減算器の反転にすぎない。一方の入力を差し引いた出力は、もう一方の入力と等しくなければならない」。しかし、どちらの入力でしょうか？彼女は、その入力がゼロになると設計が動かなくなり、入力を切り替えても、もう一方の入力がゼロになると設計が動かなくなってしまうことに不満を感じ、しばらくの間、悩んでいました。彼女は、両方のアプローチを組み合わせる必要があることに気付いたとき、発見の瞬間を迎えました。"}
            ],
            [
                {"who": "annie", "text": "Why have been responding to my messages?"},
                {"who": "nicola", "text": "Our apologies Lady Easley, we did not know you had had sent any"},
                {"who": "annie", "text": "こちらのメッセージラッチに記録されているはずです。___ ..._ _ _ 消えてしまった！研究室に侵入した者がラッチを盗んだのでしょう。他の重要な通信を見逃さないためにも、すぐに作り直してください"},
                {"who": "annie", "text": "メッセージが安定すると、タイミングパイプに蒸気のパルスが送られます。これにより、ラッチはその時の値を捕捉します。ラッチは値を記録しますが、タイミングパイプが低圧レベルに戻るまで、古い値を維持します"},
                {"who": "annie", "text": "チャールズのバルブの密閉性の高さにはいつも感心していました。このデザインが失われないことを願っています。"}
            ],
            [
                {"who": "charles", "text": "皆さん、素晴らしいニュースです。ジョセフ・コグスワース教授を紹介させていただきます。全世界で最も優秀な頭脳の持ち主の一人であり、そうではないかもしれません。彼のギア式集計機は、私たちの会計部門に素晴らしい成果をもたらしました。彼は行方不明になっている高圧蒸気の問題に協力してくれていて、エイダの仕事にも興味を持ってくれています"},
                {"who": "joseph", "text": "あなたがどれだけ進歩したかを見るのは興味深い。エイダがノートに書いたのと同じ仕様でラッチを再構築したようですね"},
                {"who": "nicola", "text": "あのノートは、休憩中になくなってしまいました。どうしてそれを知っているんですか？" },
                {"who": "joseph", "text": "エイダはいつも私の仕事を賞賛してくれました。彼女の蒸気を使ったアプローチは粗悪で不正確だと思っていましたが、それが適切なものになることを期待して、しばしば私に助言を求めてきました」。"},
                {"who": "charles", "text": "蒸気の集計器を完成させれば、私の会計士のうち誰が高圧蒸気を横領したのかがわかるでしょう。北側の接続部で加算か減算かを選択し、南側の接続部で高圧蒸気のタイミングパルスを供給します。エイダは、使用するすべての部品の精度を上げるために、これまでの設計をすべて改良しなければなりませんでした。彼女が完成させることができなかった仕事だ」。"}
            ],
            [
                {"who": "charles", "text": "素晴らしい、しかし残念ながら遅すぎる、コグスワース教授がすでに罪を犯した会計士を特定しているからだ。" },
                {"who": "joseph", "text": "確かに、だがその見返りとして、この蒸気式集計装置の粗悪な試みを手に入れてもらいたいのだ。エイダは、彼女の研究のすべてを私が管理することを望んだ。ガートルード？ニコラ？君らの仕事は終わった"},
                {"who": "ada", "text": "I hardly think that!性格も知性も寄生虫のようなスズメバチのような男に、自分の仕事を渡すとは思えません」｝。"},
                {"who": "joseph", "text": "Ada!亡くなったとばかり思っていました" },
                {"who": "ada", "text": "Charles!この男を捕まえろ、この騒動の原因は彼にあるのだから"},
                {"who": "charles", "text": "えっ！！？彼のような人物がそんな小さな犯罪に手を染めるとは思えません」。"},
                {"who": "george", "text": "It's true Charles.ジョセフは私をあなたに対抗するために虚偽の情報を流し、お互いに憎しみ合うように仕向けました。最初は高圧蒸気を嫌う彼に協力していましたが、後になって彼がすべての蒸気を嫌っていることに気がつきました」｝。"},
                {"who": "charles", "text": "Is this true Joseph?あなたは高圧蒸気に情熱を持っていないのですか」。"},
                {"who": "joseph", "text": "Of course it is true!恐ろしい物質だ。しかし、私を逮捕しろと？何のために？何の証拠もないでしょう？"},
                {"who": "ada", "text": "実はそうなんです。歯車式の集計機では、各取引からわずかな端数が取り除かれていました。蒸気式の集計機と比較して、初めてその誤差を発見したのです。これは、高圧の蒸気をゆっくりと吸い上げるためです。チャールズが何かを感じ取っていなければ、これを発見することはできなかっただろう。"},
                {"who": "joseph", "text": "Preposterous!こんな気持ちの悪い物質で何がしたいんだ！」｝。"},
                {"who": "charles", "text": "えっ！！？でも、それは低圧の容器だよ。高圧蒸気を入れたらどうなるか、わからないのか！」｝。"},
                {"who": "joseph", "text": "The only result is the world finally rejecting steam once and for all!蒸気は死刑執行のためのものであり、博物館でしか見られないようにすべきだ。考えてみてください。蒸気がオフィスに侵入し、私の機械を駆逐してしまうのです。歯車でしか生産できない...放してくれ！手を離せ！哀れな愚か者たちよ！こんなことは許されない！アカデミーに知らせろ！"},
                {"who": "charles", "text": "アカデミーは必ずやこのことを耳にするだろう!私の高圧蒸気は無事だし、愛するエイダも無事だ"},
                {"who": "ada", "text": "Actually darling, I think the story of steam computation is not yet now beginning" },
                {"who": "charles", "text": "確かに。しかし、まずはその蒸気爆弾を拡散させるべきかもしれません」。"}
            ],
            [
                {"who": "ada", "text": "ありがとう、ガートルード。あなたの迅速な判断がなければ、大惨事になっていたでしょう" },
                {"who": "george", "text": "私もかなり感心しました。エイダ、あなたが私の家を略奪したことを非難したことを、いくら謝っても足りません。ガートルードとニコラに私のデザインを手伝ってもらうことはできないだろうか？彼らの意見は非常に建設的だと思います。"},
                {"who": "ada", "text": "もうこの話はしないでください、私も許されなければなりませんから。親切の印として、私の...私たちの研究室を自由に使ってください。イーズリー女史がすでに利用しています。チャールズと私はこの騒動から少し離れる必要があると思っています。数日後に戻ってきますが、あなたの発見を調べるのが楽しみです。"},
                {"who": "george", "text": "Thank you, and safe journey.___\nニコラ、x2プレッシャー・アンプを探してくれないか？" },
                {"who": "nicola", "text": "ここにあります。___\n構造はシンプルですが、操作は驚くほど便利だと思います。"},
                {"who": "george", "text": "確かに。この装置は、0〜50の特定の範囲の値を0〜100の範囲まで増幅しますが最小値と最大値が与えられれば、任意の範囲を拡大するアンプを構築できると思います"},
                {"who": "nicola", "text": "We shall name it the Zoom element."},
                {"who": "george", "text": "その通りだが、まず我々がそれを考案すべきだ。北が最大、南が最小になります。東の出力は、西の入力がその範囲内のどこにあるかを教えてくれます」。"}
            ],
            [
                {"who": "george", "text": "よし、これで任意の圧力範囲にズームできるようになった。次に必要なのは、その範囲内にいるかどうかを検出する方法です。この「蒸気式速度計」を見てみましょう。エイダがチャールズのために作ったもので、中を通る蒸気の量を測るためのものです。長いパイプの中を蒸気が通ると、ある程度の圧力が失われます。蒸気が速く通過すればするほど、より多くの圧力が失われます。両側が同じ圧力であれば、動く蒸気はないはずです。彼女はパイプの中にいくつかのバルブを入れて抵抗を増やし、その差を大きくしました」。"},
                {"who": "george", "text": "私が必要としているのは、西の入力基準が2つの圧力の間にあるかどうかを判断する方法です。北よりも低く、南よりも高くなければなりません」。"}
            ],
            [
                {"who": "george", "text": "さて、範囲を拡大することで、誰かが使っている蒸気の量をより正確に知ることができますが、自分が検査している範囲に入っているかどうかもわかりません。お客様には、次回の蒸気代の請求書に小数点以下の桁数が増えることを覚悟するように言っておこう！」｝。"},
                {"who": "annie", "text": "これまでの研究は、あなたの会社の利益のためだけに行われてきたのですか？これは、私たちの契約とは異なります」。"},
                {"who": "george", "text": "But Lady Easley!私はあなたのためにこれを作りました。信じてください、これは将来とても役に立つ部品になりますよ」｝。"},
                {"who": "annie", "text": "I very doubt that.私は、純粋な研究をするべきだと思います。___ _ エイダと私が取り組んでいたラッチのデザインに戻りましょう。私は、有効にも無効にもできるラッチが欲しかったのです。ノース入力が高ければラッチは通常通り動作しますが、低ければ出力を駆動せず、タイミングパルスを見ても新しい入力を受け付けないようにします。古いデザインを使ってもいいのですが、カスタムで作った方が効率がいいかもしれません」。"}
            ],
            [
                {"who": "annie", "text": "さて、私がこのデザインを求めた理由は、North入力が複数のラッチのうちの1つを選択する「アドレス可能なラッチ」を構築できるようにするためでした。この方法では、複数の値を保存し、それぞれに自由にアクセスすることができます。North入力は、2つのラッチを選択します。北の値0〜50で1つ、北の値50〜100で2つ目が選択されます」。"}
            ],
            [
                {"who": "annie", "text": "そのとおりですが、残念ながらここまでしかできませんでした。次に、5つの値を格納できるラッチが欲しかったのですが、Adaと私は1つのデザインにすべてを収めることができませんでした。選択範囲は、0-20、20-40、40-60、60-80、80-100です。残念ながら、セレクト信号がどの範囲にあるかを検出するのは難しすぎました。"},
                {"who": "george", "text": "If only one had range detecting design."},
                {"who": "annie", "text": "Your design detects flow, not a pressure range"},
                {"who": "george", "text": "Well, yes and no.流れている蒸気の圧力範囲を検出します。鎖状に配置して蒸気を通すと、圧力の範囲を検出します」。"}
            ],
            [
                {"who": "annie", "text": "確かに、あのフローディテクターは非常に独創的で、私たちが必要としていたトリックでした。しかし今度は、このLatch5ブロックを2つ繋げてLatch10を作るにはどうしたらいいでしょうか？___\n選択範囲は、0-10、10-20、20-30..."},
                {"who": "george", "text": "そして、これがズームエレメントのデザインを依頼した理由です。あなたのアイデアには天才的なものを感じ、すでに計画を立てています」"}
            ],
            [
                {"who": "ada", "text": "いやあ、感心しました。私たちがいなくなってまだ2日しか経っていないのに、あなたはスチームコンピューターの収納部分を作ってしまったのですから"},
                {"who": "nicola", "text": "The what?" },
                {"who": "annie", "text": "すべては時が来れば明らかになる。ストレージの設計はできました。あなたには、計算と制御の調査をお任せします」。"},
                {"who": "ada", "text": "さて、小さなことから始めましょう。私たちは、2つの入力値のうち小さい方の値を与えるコンポーネントが必要です。簡単なことですね。"}
            ],
            [
                {"who": "charles", "text": "Ada!私のダーリン!ジョージが紹介してくれた新しい飲み物を試してみてね。その名も \"フロフィー・コーヒー \"です。ぜひ味わってみてください」。"},
                {"who": "ada", "text": "Hmmm, yes it is rather ni..."},
                {"who": "charles", "text": "You know what would be further better!!!" },
                {"who": "ada", "text": "High press..."},
                {"who": "charles", "text": "High Pressure Steam!" },
                {"who": "ada", "text": "ダーリン。あなたがジョージと仲直りしたことはとても感謝していますが、お二人は番組の要素を計画するはずではありませんでしたか？"},
                {"who": "charles", "text": "Already done!ジョージが詩の最終調整をしています...いや、要件というべきでしょうか" },
                {"who": "ada", "text": "おぉ！早速Maxコンポーネントを作成して、弊社のエンジニアにアクセスしてみましょうか。___\n今回の出力は、2つの入力の最大値でなければなりません。"}
            ],
            [
                {"who": "charles", "text": "もし、ジョージが来るまでに時間があったら、彼の圧力容器をより安全にするために使うべきだ。90PSIまでは安全ですが、それ以上になると爆発してしまいます。私が必要とするのは「蒸気ヒューズ」です。西から東への蒸気の流れを許容するが、圧力が90PSIを超えたら、供給を切り離して容器を排気する。まず電源を切り、それからタンクの空気を抜くことを忘れないでください」。"}
            ],
            [
                {"who": "charles", "text": "Come George!私たちにはプライバシーがあります！"},
                {"who": "george", "text": "Are you sure about this Charles?イーズリー夫人は私の存在をほとんど認めていません。"},
                {"who": "charles", "text": "Stiff upper lip old chap!"},
                {"who": "george", "text": "very well.これは少々デリケートな問題です。1サイクルごとに10PSIずつ増加する装置が必要です。0PSIからスタートして、タイミングパルスごとに10PSIずつ上昇する必要があります。100PSIに到達する代わりに、0PSIにリセットされる必要があります"}
            ],
            [
                {"who": "george", "text": "Charles, あなたの詩を使わせてくれて、感謝の言葉もありません。この詩は、イーズリー夫人に対する私の気持ちを完璧に表現しています。彼女の美しさ、優しさ、そして独創的なラッチのデザインが描かれています。私が必要としていたのは、愛情の対象をあなたの「高圧蒸気」から私の「イーズリー夫人」に置き換えることだけでした" },
                {"who": "george", "text": "EasleyのLatch10のデザインを見てください。私たちが求めているのは、よりシンプルでありながら、より複雑なものです。入力値の範囲ごとに、特定の圧力を出力する必要があります。保持している値を更新する必要はありません。昔の設計をベースにして、その例に合わせて実装を変えることができます」。"}
            ],
            [
                {"who": "george", "text": "We are almost there.私の詩を再生するために、これらのパーツをつなげてみましょう。スチームパルスのたびに、次の値を読み上げる必要があります。カウンタは0, 10, 20, 30...の順に進みますが、詩のストレージは5, 15, 25, 35...の順に進みますので、これは簡単なことではありません。"}
            ],
            [
                {"who": "charles", "text": "素晴らしい作品だ!ただ、タイミングパルスを提供するのに、この恐ろしいコグスワース・クロックに頼らなければならないのは残念です。"},
                {"who": "nicola", "text": "Gertrude, do you remember how you diffuse that bomb?同じように正確な時計を作れると思うわ。"},
                {"who": "charles", "text": "However you do it, I want it flip once every tick and I don't want it change time depending on what is connected." }
            ],
            [
                {"who": "ada", "text": "What have you two been up to?" },
                {"who": "charles", "text": "George and I have just delivered a most marvellous poetry reciting machine to Lady Easley.この機械は、ジョージの彼女に対する気持ちを朗読するようにプログラムされています。___\n十分な改良を加えれば、このような装置を馬の大きさにまで小さくすることができます"},
                {"who": "ada", "text": "それは素敵ですね。でも、アニーのコードがすべて否定されているので、圧力を元に戻してほしいですね」。"},
                {"who": "george", "text": "WHAT!!! Nicola!何を送ったんだろう？" },
                {"who": "nicola", "text": "Hmm...どうやら、彼女の立派なヒゲを褒めて...淫らな絵を要求して...夜明けに敵を攻撃するように指示したようですね」｝。"},
                {"who": "george", "text":"・・・。___ それはそうと、私は自分の住居に戻って、ブランデーのボトルを飲みながらしばらく過ごすことにしよう」"},
                {"who": "ada", "text": "Charles!彼を助けに行ってください！2人がいない間に、あなたたち2人が手伝ってあげてください。チャールズは、この壁に2本のパイプを取り付けるはずでしたが、1本しかありません。北と南、西と東をつなぐ必要があります。どうにかして新しいパイプを待たずに取り付けられないだろうか？"},
                {"who": "nicola", "text": "Good thing we live in clockwork universe because I think I have an idea."}
            ],
            [
                {"who": "annie", "text": "Hello Ada.ジョージはいますか？私の家に届いたこの機械のことで、彼と話をしたいのですが..." },
                {"who": "ada", "text": "Oh Annie!本当に申し訳ありません。彼とチャールズはコードブックの違いについて全く知らなかったのです"},
                {"who": "annie", "text": "ああ、それはすぐにわかりました。そうしないと、こんなくだらない茶番劇になってしまいますからね"},
                {"who": "ada", "text": "Nicola!ジョージとチャールズを連れてきてくれ。"},
                {"who": "annie", "text": "彼らが作ったこの詩の装置は、とても素晴らしい仕掛けになっています。使われている部品も工夫されています。ガートルード？このカウンター。君が設計したんだろう？値を設定できるようにしてくれないか？西側のポートに新しい値が入り、北側のポートでその値を使うかどうかを選択する」。"}
            ],
            [
                {"who": "ada", "text": "I have to say Annie, don't find all this rather complicated?" },
                {"who": "annie", "text": "そうですが、私たちはここまで来ました。アダーを動作させるために費やした1週間を覚えていますか？振り返ってみると、今ではすべてが簡単に見えます。研究が進んだだけでなく、蒸気についての理解も深まったと思います"},
                {"who": "ada", "text": "それであれば、あなたのメッセージラッチの1つを見るのを手伝ってもらえませんか？どこが悪いのかわかりません。ベクレル様からのメッセージが全て無意味なものになってしまいます。"},
                {"who": "annie", "text": "面白いですね。どうやら、値が安定する前にタイミングパルスが届くのが少し早すぎるようです。もし、パルスを1目盛りよりも少しだけ遅らせることができれば、それで解決するでしょう。0から100PSIの間を非常に素早くシフトする必要があります。何か作ってみよう」。"}
            ],
            [
                {"who": "annie", "text": "What does this gauge show?" },
                {"who": "ada", "text": "それは、コグスワース・クロックワークスに向かう蒸気の圧力でしょう。なぜ？"},
                {"who": "annie", "text": "見てください。こんなに独特な模様があるんですよ。また、休みではないのですか？今日は日曜日だからね。___ _ _ 1ティックで100PSIまで跳ね上がり、もう1ティックで別の値になり、その後0PSIに戻ります"},
                {"who": "ada", "text": "That is intriguing.解読できないかな」"}
            ],
            [
                {"who": "nicola", "text": "Lady Chavvington!街中を探したのですが、見つかりませんでした..."},
                {"who": "ada", "text": "We know where they are!ジョージは吸気口のスイッチを入れたり切ったりすることで、私たちにメッセージを伝えてくれました。彼らはコグスワース・クロックワークスのスチームルームに閉じ込められています。すぐに行きましょう！」｝。"},
                {"who": "charles", "text":"[BANG] [BANG] [BANG]\nGet us out!部屋中に高圧蒸気が充満している!愛するものに殺されるとは、なんとも残酷な皮肉だ。"},
                {"who": "nicola", "text": "このドアを開けるはずの鍵が効かない!誰かが鍵を撃って、中のパイプを破裂させたようです。壊れた鍵はともかく、鍵の開け方は全く知りません"}
            ],
            [
                {"who": "charles", "text": "Gertrude!私たちの命を救ってくれただけでなく、高圧蒸気を使ってくれたことに、感謝してもしきれません！」｝。"},
                {"who": "ada", "text": "Darling, how did you get into this dreadful situation?" },
                {"who": "charles", "text": "ジョージと私は、オールド・ブラスという酒場で2、3杯飲んでいたのですが、その時、何かがぼやけてしまいました。次に覚えているのは、この部屋で目が覚めたとき、コグスワースが彼の人生を台無しにしたと私たちを非難していたことです。アカデミーを解雇された後、彼の投資家たちは疑問を持ち始めました。彼の唯一の選択肢は、私たちを黙らせ、投資家のお金を奪って急いで退散する時間を与えることでした。_ _ _ 早く！飛行場へ！彼を逃がしてはいけません"},
                {"who": "george", "text": "このパイプは西から東へ発射コードを伝える。それぞれ3つのコードがあり、1つのコードにつき2つのティックで送信されます。コグスワースのコード「27、39、31」を見れば、彼がここにいて逃げようとしていることがわかるだろう"},
                {"who": "ada", "text": "それでは遅すぎます。その時には、彼は発射許可を得ていて、逃げられてしまうかもしれません。飛行場の管理者に、彼を逃がさないように言わなければなりません"},
                {"who": "george", "text": "残念ながら、マネージャーはコグスワースのマシンに置き換えられてしまいました。おそらく危険な状態のものでしょう。{pos(100,250)}コグスワースの発射コードを 許してはいけません でも飛行場を混乱させてはいけません 彼に気づかれないように{cH00ffff}信号を数十秒遅らせて 見つけたら削除するのはどうでしょう？そうすれば、彼を見つけて逮捕する時間ができます」。"}
            ],
            [
                {"who": "ada", "text": "やっとだ。コグスワースを牢屋に入れて、ようやくスチームコンピューターを完成させることができました。フィボナッチ数を計算する「プログラム」と名付けたものを書きましたが、結果は不正確です。問題の診断と微調整にかなりの時間を費やすことになるかもしれません」。"}
            ],
            [
                {"who": "charles", "text": "It is here!アカデミーからの回答です。___\n「科学アカデミーの審査のために『スチームコンピューター』を提出してくださったことに感謝します。我々は、この製品が蒸気計算に関する我々の知識を大幅に拡大したことを確認しました。したがって、あなたの会員申請が承認されたことを喜んでお伝えします！"},
                {"who": "nicola", "text": "Congratulations Lady Chavvington."},
                {"who": "ada", "text": "実は、あの申請は私のためではありませんでした。ガートルードのためのものでした。ガートルード、あなたはこれらすべての部品を作った人であり、蒸気を不思議な方法で操作する方法を私たちに教えてくれました。あなたこそ、蒸気の計算方法を他の人に教えるべきです」。"},
                {"who": "charles", "text": "Huzzah!___\n今日の午後、お祝いしましょう！"},
                {"who": "george", "text": "Lady Easley?この機会にご一緒にいかがですか？"},
                {"who": "annie", "text": "I am afraid I can't hide, because I have an appointment this afternoon with a dashing gentleman." },
                {"who": "george", "text": "Oh."},
                {"who": "annie", "text": "That would be you George.マディングリーホールでのアフタヌーンティーのお誘い、快くお受けします"},
                {"who": "ada", "text": "ComPressureをプレイしていただきありがとうございます。"}
            ]
        ],
        "hints":
        [
            [
                {"who": "charles", "text": "マウスの左ボタンをクリックしたまま、新しいパイプを始点から終点まで配置します。古いパイプの上に新しいパイプをドラッグしても、それらはつながりません。何か問題が発生した場合は、マウスの右ボタンでパイプを取り除くことができます。"}
            ],
            [
                {"who": "charles", "text": "ビルドメニューでは、100PSIの蒸気を供給する蒸気源を配置することができます。途中でパイプを切り離すことで、その中間の圧力を作り出すことができるかもしれません」。"}
            ],
            [
                {"who": "charles", "text": "ビルドメニューには、バルブのコンポーネントがあります。バルブの「＋」側を北側に接続することで、北側の入力でバルブの開度を制御できるようになります。あとは、北が高圧の時に東と西を接続するだけでOKです。"}
            ],
            [
                {"who": "nicola", "text": "私の理解が正しければ、バルブの「＋」ポートを高圧の蒸気源に接続し、「-」と書かれたポートを南側の入力に接続する必要があります。これにより、南側ポートの圧力が低い場合にのみ、東と西が接続されます。それが高い場合は、バルブを閉じてしまいます」。"}
            ],
            [
                {"who": "nicola", "text": "入力がハイのときは、ノースを接続します。その方法は、\"Normally Open \"の設計からわかっています。そして、入力が低いときには、南側を接続します。これが \"Normally Closed \"デザインです」と述べています。"}
            ],
            [
                {"who": "nicola", "text": "さて、まずは基本的なことから始めましょう。入力が大きいときは、出力を蒸気源に接続します。入力が少ないときは、大気に接続します。大気に接続するには、単にパイプの端を開いておきます。チャヴィントン夫人が指摘したように、バルブはアナログ式で、値が0から100の間にあるときは、バルブが部分的に開き、正確な比率を再現するようです」。"}
            ],
            [
                {"who": "nicola", "text": "今回は、入力が高圧のときは大気に接続します。入力が低圧のときは、蒸気を供給するときです。スイッチの設計では、2つの値を選択できるようにしました。その値は、蒸気と大気になります」。"}
            ],
            [
                {"who": "nicola", "text": "バルブを使って、北と南のどちらが高いかを測ることができます。北の方が高ければ、出力を蒸気に接続します。南の方が高ければ、大気に接続します"}
            ],
            [
                {"who": "nicola", "text": "すでに比較対象があり、50という正確な値のソースがあると思います"}
            ],
            [
                {"who": "nicola", "text": "入力が100のとき、出力を50にしたい。そこで、50の発電機をバルブを使って出力に接続するのだと思います。そして、入力が0のときは、出力を大気に放出します」。"}
            ],
            [
                {"who": "nicola", "text": "これはまたバッファの設計のようですが、入力が50のとき、出力を100にしたいとします。だから、50になった時点で大気開放バルブを閉じるべきなんだ。ベンチレーションバルブの「＋」側の100PSIを使う代わりに、50に切り替えればいいのではないでしょうか。"}
            ],
            [
                {"who": "nicola", "text": "この中に他のコンポーネントがあったことは覚えていません。そこにあるものを出力につなげればいいと思います"}
            ],
            [
                {"who": "nicola", "text": "出力を暗号化コンポーネントに通すと、入力が何であったかを判断することができます。比較器の2つの入力が等しい場合、出力は加圧も排気もされません。揺れが大きすぎる場合は、コンパレータの設計に戻って強度を下げる必要があります」。"}
            ],
            [
                {"who": "nicola", "text": "私たちは、decryptのデザインと同じトリックを使うことができます。両者の間の圧力がちょうど50になるまで、下側のバルブを開ける量を増減させます。これを実現するAmp50があります」。"}
            ],
            [
                {"who": "nicola", "text": "西の入力から南の入力を引いた値に合わせて1つのバルブを開き、その間の圧力が50になった時を見計らって、2つ目のバルブを同じレベルの開度にすることができます"}
            ],
            [
                {"who": "nicola", "text": "これはちょっと難しいですね。減算器を使うと、揺れが大きすぎます。しかしその場合は、2つ目のバルブペアを使って同じ比較を行い、入力を切り替えることができます。その後、Amp50を使って、4つのバルブ間の圧力が50PSIであることを確認できます。___\n要件をクリックすると、この設定の図が表示されます。"}
            ],
            [
                {"who": "annie", "text": "南側の入力が大きいときには、ストレージパイプを開きます。バッファを使って、出力を取り込んだのと同じレベルまで加圧することができます。新しい圧力が伝わらないように、South入力が高い間は出力を閉じなければなりません。これを保証する最も簡単な方法は、タイミングバルブと出力バルブの閾値を50にすることです」。"}
            ],
            [
                {"who": "nicola", "text": "出力は、South入力で制御されるラッチの値です。ラッチへの入力は、ラッチの出力に西の入力を加えたものか、あるいは差し引いたものです。北側の入力はそれらの間を選択します。加算器、減算器、スイッチがあります。"}
            ],
            [
                {"who": "nicola", "text": "For a change a wobble is actually desirable.アンプをリング状に配置すると、デザインが不安定になり、上下にふらついてしまいます」｝。"}
            ],
            [
                {"who": "nicola", "text": "西が南よりも高い位置にあるときは、より多くの蒸気を加え始める。西が北より低いときは、より多くの蒸気を放出してください」。"}
            ],
            [
                {"who": "nicola", "text": "バルブを直列に並べることができます。すべてのバルブが開いている場合にのみ、蒸気が流れます」。"}
            ],
            [
                {"who": "nicola", "text": "This is not much different from our normal latch design, except outside output and the timing pulse are not connected when the North input is low"}
            ],
            [
                {"who": "nicola", "text": "North Select入力が50より大きい場合、一方のラッチを有効にし、そうでない場合はもう一方を有効にします"}
            ],
            [
                {"who": "nicola", "text": "非常に多くの選択信号が必要です。一端が蒸気の入口、もう一端が大気になっているフローディテクタの列を連鎖させたらどうでしょう？そうすれば、必要な値がすべて得られるでしょう」。"}
            ],
            [
                {"who": "nicola", "text": "2つのLatch5要素を使用して、selectが50以下か50以上かで切り替えることができます。しかし、その場合、2つの範囲（0～50、または50～100）のうちの1つから、Latch5のデザインが取る範囲（0～100）にセレクトを拡大する必要があります。それぞれのズームは5つのフローディテクターに接続されていて、すべてのパイプを加圧するには時間がかかります。デザインをより強固にするためには、単純に複製すればいいのです」。"}
            ],
            [
                {"who": "ada", "text": "It should be as easy as a comparator and a switch"}
            ],
            [
                {"who": "ada", "text": "これは、私たちのMinコンポーネントと同じではなく、逆に選択しているのではないか？"}
            ],
            [
                {"who": "charles", "text": "長いパイプのベントパイプを使って、90PSIという値を形成することができます。その値と外部入力とのコンパレータで、容器を排気するタイミングを知ることができます。コンパレータの圧力が0PSIから50PSIに上昇すると、入力を遮断する必要があります。50PSI以上になったら、バルブを開いて容器内の内容物を大気に放出する必要があります」。"}
            ],
            [
                {"who": "george", "text": "1つの入力に静的な10PSIを持つ加算器を使うことができます。その後、ラッチを使用して新しい値をキャプチャします。最後にループ内のヒューズでカウンタを0PSIにリセットします」とあります。"}
            ],
            [
                {"who": "george", "text": "Latch10の設計で使ったのと同じ方法で、10個の値を選択することができます。各値はカスタムメイドで、選択されたときに出力に接続する必要があります。これにはいくつかのカスタムデザインが必要です」。"}
            ],
            [
                {"who": "george", "text": "カウンタをROMに接続することができますが、まず加算器を使って5を加える必要があります"}
            ],
            [
                {"who": "nicola", "text": "Amp50の部品をリング状にして、どこかで反転させれば、規則的なビートが得られます。それに近いものができたら、パイプの要素を加えて少し遅くすることで、チューニングすることができます"}
            ],
            [
                {"who": "nicola", "text": "時計は2つの入力を選択でき、壁の反対側では、同期した時計が出力を選択できます。しかし、両方の入力を接続するべきではありません。しかし、両方の入力を接続してはいけません。片方を開くまでに、もう片方は封鎖されているはずです。50PSIを基準にしてもいいでしょう」。"}
            ],
            [
                {"who": "annie", "text": "We can amend the counter to insert a switch to select someone a new value or the incremented one"}
            ],
            [
                {"who": "annie", "text": "0 PSIと100 PSIの値を遅延させるだけでよい。Amp50エレメントのチェーンを使えば、多少の調整でパルスを遅らせることができます。"}
            ],
            [
                {"who": "annie", "text": "遅延素子で必要なタイミングパルスを得ることができます。遅延パルスを確認したら、その値をキャプチャしますが、同時に遅延入力を強制的に0PSIにします」。"}
            ],
            [
                {"who": "nicola", "text": "ただ穴を塞ぐのではなく、100PSIに取り付ければいい。そうすれば簡単です。スチームキーを作るには、錠前の中で形成される圧力を再現すればよいのです」と述べています。"}
            ],
            [
                {"who": "george", "text": "入力を十分に遅延させるためには、3つのラッチが必要です。カスタムの追加遅延を備えたクロックジェネレータでクロックを生成します。すべての値が正しいかどうかを検出するために、パイプをゆっくりと満たし、どれかのラッチの値が検索された値よりも大きいか小さいかのどちらかであれば、パイプを排出することができます。"}
            ],
            [
                {"who": "ada", "text": "時間をかけて、マシンの動作を理解してください。そうすれば、スチームコンピューターの動作を改善するように設計を改善することができます」。"}
            ],
            [
                {"who": "ada", "text": "No more hint.勝利を楽しんでください」とあります。"}
            ]
        ]
    }
}
